{
	"next_comment_id": 22,
	"user_name": "Edantes",
	"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
	"post_like": {
		"1BePwsiwFD8BjtYfB8tQegiKXDLnHWW1Um_2": 1470908859,
		"1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R_5": 1470910576,
		"1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_4": 1470911739,
		"1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV_7": 1471378295
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "HOLLA",
			"post_uri": "19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ_2",
			"date_added": 1470907783
		},
		{
			"comment_id": 2,
			"body": "AYO!",
			"post_uri": "1D6Pn4487L8QyFtVSU14nxxtnfEgEs2Ny1_1",
			"date_added": 1470908436
		},
		{
			"comment_id": 3,
			"body": "# WELCOME",
			"post_uri": "1EtP9CTjup6B3GNiCt9dwRddYgkh3MKhj7_1",
			"date_added": 1470909758
		},
		{
			"comment_id": 4,
			"body": "In light of all the dodgy KAT clones that have popped up in its wake and the distrust they inevitably breed I think rebranding would be a better idea, start fresh and build a reputation organically instead of coattailing on an existing one, earn it instead of jacking it.",
			"post_uri": "1D6Pn4487L8QyFtVSU14nxxtnfEgEs2Ny1_1",
			"date_added": 1470947197
		},
		{
			"comment_id": 5,
			"body": "@Sirenyc: yeah, just call it something else, the original KAT support crew are going to be resurrecting it soon apparently, see the article on TorrentFreak. That will make any other KAT seem scammy.",
			"post_uri": "1D6Pn4487L8QyFtVSU14nxxtnfEgEs2Ny1_1",
			"date_added": 1470996188
		},
		{
			"comment_id": 6,
			"body": "Sharing is caring <3",
			"post_uri": "19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ_5",
			"date_added": 1471041882
		},
		{
			"comment_id": 7,
			"body": "KAT clones have a bad reputation, they're scummy and misleading at the best of times and generally breed mistrust, definitely not the most ringing of endorsements. The site design is good but it really needs a new name, new brand, new start. Personally, I think we should use the existing ZeroNet defaults as templates and gradually expand their functionality. Hell, the ZeroTalk template is a good start, as seen with ZeroTorrent. Use one site per category, code in some user classes, add a social network or messageboard for the community and voila, we're up and running, you can simply keep adding and expanding on that, it keeps things modular and manageable.",
			"post_uri": "19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ_7",
			"date_added": 1471124746
		},
		{
			"comment_id": 8,
			"body": "That's ideal then, the same great layout but fully rebranded, I'd get behind that. ",
			"post_uri": "19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ_7",
			"date_added": 1471127969
		},
		{
			"comment_id": 9,
			"body": "@gorgamin: KAT is dead, was great while it lasted but its never coming back. But thats OK, this new indexer we are building is going to be even better. :)",
			"post_uri": "19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ_7",
			"date_added": 1471128141
		},
		{
			"comment_id": 10,
			"body": "@Jayofthezero: you're supposed to be able to add it manually in FF under Options>Advanced>Network>Connections>Automatic proxy configuration URL, adding the file path. But it doesn't work for me for whatever reason.",
			"post_uri": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_6",
			"date_added": 1471189286
		},
		{
			"comment_id": 11,
			"body": "Ah, great, works for me too! Cheers :)",
			"post_uri": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_6",
			"date_added": 1471205249
		},
		{
			"comment_id": 12,
			"body": "If you can't select clone on the menu I don't think its possible....",
			"post_uri": "19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ_11",
			"date_added": 1471205556
		},
		{
			"comment_id": 13,
			"body": "http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS/6",
			"post_uri": "1LkRBTdWeynXXmUhb5DXxesygs2aKaUnXx_2",
			"date_added": 1471207085
		},
		{
			"comment_id": 14,
			"body": "Yeah, its another dead-end. Dont worry about it, we'll have something else up and running soon enough.",
			"post_uri": "19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ_11",
			"date_added": 1471207841
		},
		{
			"comment_id": 15,
			"body": "yeah, webRTC is a mofo. http://whatismyipaddress.com/webrtc-test  https://ipleak.net/",
			"post_uri": "19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ_13",
			"date_added": 1471308688
		},
		{
			"comment_id": 16,
			"body": "Hope you got a big-ass external drive attached to it. :D",
			"post_uri": "1N1AZUiwisp1bgMoH3WSTsPSPD6DXWFpJ9_3",
			"date_added": 1471457934
		},
		{
			"comment_id": 17,
			"body": "Dont think the option to clone (from the menu) ZeroTorrent is available. Shame, it makes a great starting template. If anybody manages to get one up and running and wants to partner with a veteran torrents harvester, let me know, me and the fellas here are sitting on gigabytes worth of content that needs a forever home.",
			"post_uri": "1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV_8",
			"date_added": 1471484971
		},
		{
			"comment_id": 18,
			"body": "That easy, huh? Maybe I'll try my hand at it, haven't messed with web stuff for quite a while, would be fun. Thanks, matey!",
			"post_uri": "1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV_8",
			"date_added": 1471485944
		},
		{
			"comment_id": 19,
			"body": "I'm on several private trackers and find most worthwhile stuff tends to trickle down eventually. I've rarely, if ever, been unable to find something on either the lower-tier private trackers or on public ones. So you're not really missing out as much as you might think. Also, be really careful about soliciting invites in a \"public\" arena, it is a bannable offense and the powers-that-be at the exclusive god-tier trackers pool their records and maintain an information-sharing database that tracks and documents their many users. So if you get banned on one tracker it'll red-flag you and you'll often get banned from the rest of them as well.\n\nhttps://torrentfreak.com/private-torrent-sites-run-their-own-mini-prism-to-share-data-on-users-130908/",
			"post_uri": "1CFhytwoGGPNqmueehPqotaf2iG9uxD98e_11",
			"date_added": 1471579131
		},
		{
			"comment_id": 20,
			"body": "The key thing that everybody will care about is anonymity. Tor is still secure as far as we're told but is there anything specific about ZeroNet that might leak sensitive info? For example, at least one darknet site was busted via a Javascript exploit and without JS you don't have a dynamic ZeroNet site. In other words, people would need to feel safe enough to use such a marketplace on here.",
			"post_uri": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa_32",
			"date_added": 1471899465
		},
		{
			"comment_id": 21,
			"body": "@Method-X: Yeah, that is the great thing about ZN sites, they can't be hacked directly. So, if you can avoid being compromised thusly and you're always using Tor then you're sorted as far as that is concerned. The escrow thing might be tricky though.....bitcoin multisig is a hassle for most people. But that said, they've come to accept a measure of risk for such transactions, I find. Honestly, I think the most efficient ZN marketplace would be a DIY swapmeet scenario: each vendor sets up their own hub (shop) and an off-site market forum is used for fedback, reviews, etc, just like on Reddit. The scammers would get named and shamed while the honest vendors could be trusted for direct transactions. And with no money being deposited \"into\" the market itself the threat of an exit scam would go away, worst that could happen is individual buyers getting ripped off by individual vendors. \n\n@Talnicrom: if you think you could build something like that, go for it, we're all pioneers here. I'm currently neck-deep in building a torrent indexer but we could definitely also do with a marketplace as well. You could start off by cloning ZeroTalk and reworking it into a Craigslist-type thing, easy to build and expand on that as you go along.   ",
			"post_uri": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa_32",
			"date_added": 1471919823
		}
	]
}