{
	"next_comment_id": 14,
	"user_name": "Zerro",
	"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
	"post_like": {
		"17gEFavobc7RsKNGbSzZwoSZ6jNB7hT2KN_1472745017": 1472747281,
		"1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L_1473356635": 1473358014,
		"156HySyXH37jFXXqKCwVq8HqsrZLZzy8Qx_1473558275": 1473591234,
		"156HySyXH37jFXXqKCwVq8HqsrZLZzy8Qx_1473638159": 1473679412,
		"1EYE1FBEewUHZ26L9wu7HtPkNqmCQqDUis_1473820085": 1473820739,
		"17gEFavobc7RsKNGbSzZwoSZ6jNB7hT2KN_1474202843": 1475069935
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Начиналось все вроде неплохо, но давно не был, не знаю. Тут какие-то нападки на русский язык среди русскоязычныx. ",
			"post_uri": "1Ass6guGVga526YPZYTa1fQSFyaezf2AQR_1472719536",
			"date_added": 1472723801
		},
		{
			"comment_id": 2,
			"body": "I have ignored it.",
			"post_uri": "1FE7qxxvZDhoyhpadqWNCgT9X96hEQKEYM_1472758933",
			"date_added": 1472761748
		},
		{
			"comment_id": 3,
			"body": "I use [Termux](https://termux.com).",
			"post_uri": "1H5VKNWtkBA7RpJWyYuFw5bqjwbgjXoqKp_1472905475",
			"date_added": 1472906414
		},
		{
			"comment_id": 4,
			"body": "ZeroNet is not a filesharing network.",
			"post_uri": "16ZUTMi6pPXrFY34ebDPA23LxhA6WARH6D_1473361910",
			"date_added": 1473366146
		},
		{
			"comment_id": 5,
			"body": "@Bingyuhuo: But the old man in Russia love Stalin.",
			"post_uri": "156HySyXH37jFXXqKCwVq8HqsrZLZzy8Qx_1473557892",
			"date_added": 1473591330
		},
		{
			"comment_id": 6,
			"body": "Ещё нужно технику изъять. А то эти ваши мэш сети.",
			"post_uri": "156HySyXH37jFXXqKCwVq8HqsrZLZzy8Qx_1473638159",
			"date_added": 1473679484
		},
		{
			"comment_id": 7,
			"body": "А зачем при пиздеже России вспоминать про пиздеж Eвропы или США? Каждый пиздеж нужно рассматривать индивидуально. И то где-то там тоже пиздят, это не может быть оправданием пиздежа в своей стране. Узнаю псевдопатриота-ватника. Вот только выгоды от замалчивания проблем стране никакой. Истинный патриот никогда не будет замалчивать проблемы. Что же о проблемах Европы и США, у них есть свой народ, который пусть и беспокоится за свое благосостояние.",
			"post_uri": "156HySyXH37jFXXqKCwVq8HqsrZLZzy8Qx_1473557585",
			"date_added": 1473688717
		},
		{
			"comment_id": 8,
			"body": "TiVo, lol.",
			"post_uri": "13wue9n6jcyxnmge6n6LYcKhxVv3LumHqp_1",
			"date_added": 1473689089
		},
		{
			"comment_id": 9,
			"body": "@zxmaster: \n> Ну вот тогда нехрен слушать мнение этого народа о России\nВот только не надо говорить, что мне слушать надо, а что нет. Мое восприятие информации, это исключительно мое дело. И других оно не касается. А прислушиваться к мнению со стороны всегда полезно, как интерпретировать эту информацию, каждый решает сам.\n\n> И нехер меня оскорблять и назвать патриотом, тем более России.\n\nДа не столь важно из какой части постсоветского пространства ты родом, менталитет везде один — совковый. И за примером тебе далеко ходить не надо. Даже вставать с дивана не обязательно.",
			"post_uri": "156HySyXH37jFXXqKCwVq8HqsrZLZzy8Qx_1473557585",
			"date_added": 1473704635
		},
		{
			"comment_id": 10,
			"body": "ZeroNet не предоставляет анонимность. Здесь все как с торрентами. Нужна анонимность, нужно использовать средства для этого, например тор. Кроме того, тут все сообщения подписаны, значит скомпрометировав профиль, все посты будут тоже скомпрометированы, на всех сайтах, даже на 0chan.bit. Решение: использовать разные профили для разных целей.",
			"post_uri": "1HfVavnWvCfuS2JcZBnw8DaTWckz8QBz5j_1473699679",
			"date_added": 1473705805
		},
		{
			"comment_id": 11,
			"body": "А в этом переносе есть какой-то особый смысл?",
			"post_uri": "1NHR4Gdv1dVLZS5HRwY6aJWfngk9jCLF87_1475147498",
			"date_added": 1475162819
		},
		{
			"comment_id": 12,
			"body": "А чего хорошего то?",
			"post_uri": "1AKzkqDBZeXWgyudksDv6MekC9zbABNJ4r_1475236886",
			"date_added": 1475245093
		},
		{
			"comment_id": 13,
			"body": "Да, не значит. Дело в том что  IT само по себе не заставляет человека становиться лучше никак. Оно не требует кругозора, не требует задаваться социально-важными вопросами. Линус же тоже. Дело в том что среди линуксоидов далеко не все задумываются о лежащей в основе идеологии свободы программного обеспечения, либо воспринимают её крайне поверхностно. Возможно когда-то они и пришли в Linux за этим, но больше за поиском чего-то альтернативного винде. Теперь же  они просто привыкли. Либо могут быть ещё те, кто пришел в Linux из-за его набирающей популярности, относительной простоты и ради элитарности. Это так-же не сделает человека автоматически лучше.\n\nНо все же, в IT много и тех, кто пришел сюда за инструментами решения глобальных социальных проблем. Они в IT есть, но не так много. Но не только в IT, и не только в линуксе. Потому-то не нужно предвзято относиться к тем, кто в IT полный ноль. Разные люди ищут разные пути. Мне видится важным чтобы находить друг-друга и обмениваться знаниями и опытом. ",
			"post_uri": "156HySyXH37jFXXqKCwVq8HqsrZLZzy8Qx_1475384108",
			"date_added": 1475502564
		}
	]
}