{
	"next_post_id": 8,
	"next_comment_id": 3,
	"next_follow_id": 1,
	"avatar": "jpg",
	"user_name": "Philosophyking",
	"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
	"intro": "赵家人，极左，列宁主义。主管精神文明和统一战线。五毛的祖宗",
	"post": [
		{
			"post_id": 1,
			"date_added": 1478317910,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1478317977,
			"body": "文中有些指控是真實的，但是某些事實掩蓋了更廣泛的謊言。一個人當然不能亦不應相信西方強權對\"普世價值\"（自由、民主、人權）的頒佈 : 那種［西方］普世性是假的，隱藏著西方的意識形態偏見。但即使如此，以特殊替代方案，例如 儒學（\"中國的主流意識形態\"）來反對西方價值是否足夠呢？難道我們不是需要一個不同的普世主義，一個不同的普世解放性的計劃？在這裡，諷刺的是\"中國特色的社會主義\"實質上是指擁有資本主義特徵的社會主義［socialism with capitalist characteristics］，換言之將中國完全整合進全球市場的社會主義。全球資本主義的普世性獲得完整保留，悄悄地被接受為唯一可行的［社會］框架；而動員儒家的和諧運動只是為了在伴隨全球資本主義的社會對抗爆發時加上鍋蓋。今天，［中國共產主義］只剩下儒家式的\"民族色彩\"： 一個民族社會主義［national socialism］，在其中愛國主義成為社會願景和視野，而內在於資本主義發展的社會對抗則被投射到一個威脅社會和諧的外部敵人身上。中國共產黨在它的愛國宣傳中所推廣的----那個它稱之為\"中國特色的社會主義\"的----是\"另類現代性\"［\"alternative modernity\"］的又一個版本 : 沒有階級鬥爭的資本主義。",
			"date_added": 1478317975
		},
		{
			"post_id": 1478318858,
			"body": "親愛的香港學生和民眾,　\n\n我全力支持你們實現那 \"不可能\"的夢－－普選－－（失敗的）歷史不斷告訴我們一個教訓：必須而且只有堅持那些成年人視為\"不可能\"的事情才能成功改變現實/命運(\"reality\")，千萬不要中他們的圈套、不要跟隨他們的遊戲規則：Be realistic, demand the impossible! (現實一點，要求實現不可能之事！）\n\n其次，正如我對佔領華爾街的呼吁：你們的夢不應脫離生活，換言之，不應脫離你們自己每天呼吸的經濟環境－－極不人道的樓價、對公共事業的瘋狂私有化或掠奪、北方[富豪]資本家的大舉入侵－－，因為，一張剝除了經濟權利的選票最終只是一張空頭支票、一個騙局。\n\n好了，現在你們馬上就領悟到追夢過程中最關鍵的一點：受盡壓迫的草根民眾必將和你們手牵手地團結起來－－只有當草根民眾站在你們身邊的時候，滿嘴謊言的政客和手持槍炮的權貴才真的會乖乖讓步，你們的夢想才真的會實現！\n\n衷心祝福並總是與你們一起奮鬥的\n斯拉沃熱。齊澤克 （Slavoj Zizek）\n\n\nDear Hong Kong students and people,\n\nyou have my full support in your pursuit of your \"impossible\" dream. History has repeatedly taught us the lesson that only by insisting what our society considers \"impossible\" that fate has ever been changed. And to play the adult's game of opportunistic compromises is to fail -so be REALISTIC, demand the impossible!\n\nAnd remember that your dream is not only about the voting system. It concerns also your everyday life,  your economy: the inhuman property price, ruthless privatization, capitalists from the North joining your own ones. Without economic rights, without social justice and solidarity, a ballot is merely a fetish.\n\nBy now you have, I hope, realized that what's crucial in  any emancipatory movement is your solidarity with and support from the oppressed grass root people. Only when they stand by you, those equipped with guns and lies would reluctantly compromise and that's when your \"impossible\" dream will be more than a dream.\n\nMy utmost blessing and always with you in our emancipatory struggle, Slavoj Zizek ",
			"date_added": 1478318855
		},
		{
			"post_id": 1478318977,
			"body": "簡言之，真正深信的共產黨員對今天的中國的共產黨領導構成最嚴重的反對，這些反對者包括那些感到被資本主義肆意的腐蝕所背叛的、年老的、絕大多數是已退休的黨幹部，以及那些受\"中國奇蹟\"迫害的無產者［proletarians］ : 失去自己土地的農夫、失去工作及為了尋找生存意義而四處遊蕩的人，或是被富士康一類公司所剝削的工人。他們經常帶著寫有毛澤東的經典語句的標語牌參與大型抗議。這個由富經驗的幹部及沒有東西可失去的窮人所組成的組合是潛在的危機。中國不是一個擁有獨裁政權［authoritarian regime］的穩定國家，能夠保證和諧及使資本動力受到控制 : 每年有幾千起由工人、農夫及少數民族發動的叛亂需要被鎮壓。無怪乎官方宣傳無休止地談論和諧社會。這個堅持見證了相反的東西——隨時陷入混沌及混亂的威脅。人們應該在這裡應用史大林的詮釋學 : 由於官方媒體沒有公開地報告任何問題，所以探測它們的最可信方法是在國家宣傳中尋找過剩［excesses］——愈多和諧被慶祝，就代表愈多混沌及對抗存在。中國充滿社會對抗［antagonisms］和一直威脅要爆發的、勉強受控的不穩定事件。",
			"date_added": 1478318973
		},
		{
			"post_id": 1478564818,
			"body": "「小丑召喚了形式上最純粹的無政府主義、批判地強調了既存的資產階級文明的偽善，但小丑的觀點不能被翻譯成集体行動[mass action]。相反，班恩成為壓迫性[社會]系統的一個存在性威脅。／。。。／他的力量不單來自他的体格，同時來自他指揮民眾和動員民眾去達成政治目標的能力。他是先驅人物，以被壓迫者的名義展開政治鬥爭，他是那些採取行動改變[社會]結構的被壓迫者的有組織代表。系統無法容忍這種力量－－它具有最大的顛覆潛能。它必須被消滅。」[註9]\n\n\n\n\n「世上存在兩種『恐怖統治』，假如我們還願意記得和思考恐怖統治的話；其中一種產生於激情之中，另一種產生於無良的冷血之中。。。我們全部都因為那種較小的恐怖統治[法國大革命]－－可以說是短暫的恐怖－－而顫抖，然而，被斧頭斷頭的迅速死亡的恐怖，和長達一生地陷於飢餓、寒冷、侮辱、殘暴和心碎的死亡相比，哪一種更恐怖？一個城市墳場被短暫恐怖統治中的棺木填滿了，我們早已被教導不知疲倦地害怕和哀悼這種[短暫]恐怖；但是，即使整個法國那麼大的土地也擠不下那種較古老和真正的恐怖統治下的棺材－－那種難以言喻的苦難和極大的恐怖，我們從未被教育去觀看[taught to see]它的浩瀚或對它感到憐憫。」 －－馬克吐溫",
			"date_added": 1478564813
		},
		{
			"post_id": 1478564975,
			"body": "然後，一個人應該去神秘化暴力問題[demystify the problem of violence]、否定一種簡單化的宣稱－－二十世紀共產主義動用了太多過度的兇殘暴力，而我們應該小心不要再次跌進這個[共產殺勠的]陷阱之中。作為一個事實，共產殺勠毫無疑問是嚇人地真實的－－但對暴力的這種聚焦窒息了深層問題[的發掘]：二十世紀共產主義社會計劃本身出了甚麼問題？[即撇除它的暴力手段，共產主義的目的出了甚麼問題？]是甚麼內在弱點迫使共產主義者向（不只是）那些掌權的共產黨人施加無限制的暴力？換言之，指責共產主義者「忽視了暴力問題」是不夠的：[其實]是一個更深層的政治失敗將他們推向了暴力。（同一個道理可以用來回應共產主義者「忽視民主」的指責：他們的整体社會改變計劃強迫他們「忽視」）因此不單只諾蘭的電影沒有能力想像真正的人民自治權力－－「真正」激進－解放運動自身也缺乏這種想像力，這些運動仍停留在舊社會的想像座標[或框架]的陷阱之中，而這就是為甚麼真實的「人民權力」[people’s power]常常變成類似的暴力恐怖。\n",
			"date_added": 1478564969
		},
		{
			"post_id": 1478565029,
			"body": "政府不懂得如何回應這種溫和抗議，但却認定存在一個反民主共謀，于是迅速將這個政治運動標簽爲 “純粹、十足的恐怖主義”， 幷宣布國家進入緊急狀態，容許政府中止所有憲法保障及采取一連串越趨激烈的步驟：公民被隨意逮捕然後人間蒸發、被囚禁于秘密審問地點、從首都撤走警察和政府機構、封鎖城內所有出入口、以及最終自己親手製造出恐怖主義元凶。 這個城市却一直繼續近乎正常地運作，民衆以無法理解的和諧和真正甘地水平的非暴力扺抗阻擋了政府每一波攻擊。。。這個例子，選民的棄權票，正是一個真正激進的「神的暴力」的例子[譯註5]，它激起當權者殘暴的恐荒反應。\n",
			"date_added": 1478565022
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "@猫叉酱: 斯大林辩证法",
			"post_uri": "1JVtiH7RA45sc7efV5Xdpai4gwUvHm18fm_1478317977",
			"date_added": 1478318124
		},
		{
			"comment_id": 2,
			"body": "@HelloArch: maybe",
			"post_uri": "1JVtiH7RA45sc7efV5Xdpai4gwUvHm18fm_1478317977",
			"date_added": 1478318743
		}
	],
	"follow": []
}