{
	"next_comment_id": 8,
	"user_name": "Gallium",
	"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
	"post_like": {
		"17Cs2auSHSVjKaYMXqbNMApRQrgXcwJUpL_6": 1471318977,
		"16nArdxrSaNThNp83kL8E6NLL9WD98iUne_14": 1471549123
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "So far it seems kinda like twitter but without the 140 limit and other dumb stuff they added.\n\nI like it.",
			"post_uri": "1FVgXvt6d7AciuXYYeHwFcPfUyRqRDhZxV_2",
			"date_added": 1471054391
		},
		{
			"comment_id": 2,
			"body": "Me too. It's still in the early days as far as I'm concerned, which is kind of the more exciting part since stuff happens and changes and from what I've seen so far, improves.",
			"post_uri": "17Cs2auSHSVjKaYMXqbNMApRQrgXcwJUpL_4",
			"date_added": 1471317388
		},
		{
			"comment_id": 3,
			"body": "@Method-X: I've seen a few posts/comments here about trying to get KAT on ZeroNet and there's some progress being made, I think.",
			"post_uri": "17Cs2auSHSVjKaYMXqbNMApRQrgXcwJUpL_4",
			"date_added": 1471317522
		},
		{
			"comment_id": 4,
			"body": "Sent you something",
			"post_uri": "17Cs2auSHSVjKaYMXqbNMApRQrgXcwJUpL_5",
			"date_added": 1471317986
		},
		{
			"comment_id": 5,
			"body": "I was on a flaky connection earlier (3G, but bad enough to be 2G speeds, and through a VPN because my carrier don't like odd ports being used) and ZeroNet was working as normal. Much slower obviously, but no other noticeable difference that I saw.\n\nNot now (going to sleep soon) but I could tether my laptop through my phone's connection and that I can limit to 2G and use ZeroNet and report how it goes.\n\nIf you want.",
			"post_uri": "1FVgXvt6d7AciuXYYeHwFcPfUyRqRDhZxV_8",
			"date_added": 1471403880
		},
		{
			"comment_id": 6,
			"body": "Absolutely. A general keyword filter would be ideal. That way you can both filter out users and posts with words you don't want to see.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474398564",
			"date_added": 1474414744
		},
		{
			"comment_id": 7,
			"body": "I don't think it's fair to call it a bad sci-fi series when it isn't even that. Look at it closely and you'll see it's a fairly traditional fantasy story, dressed up in spaceships and aliens and fanciful tech. There's not much sci-fi in it really except aesthetically.\n\nThat said idk a thing about the fandom but they can range from friendly to nightmarish dumpster fires that should be avoided at all costs.",
			"post_uri": "1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY_1475438580",
			"date_added": 1475486778
		}
	]
}