{
	"next_comment_id": 8,
	"user_name": "Elspru",
	"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
	"post_like": {
		"1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1474456716": 1474810285,
		"1JuUHRJ3A1wy5zgT6c2KviH9cHtq8Zr4X9_1474815271": 1475114087
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Using human grammar with post-positions:\n\nA _conditional_mood B _realis_mood  C _counterfactual_conditional \nA _con B _rea C _cou\n\nEquivalent to the prepositional English of:\nif A then B. else C.\n\n",
			"post_uri": "1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1474806946",
			"date_added": 1474810232
		},
		{
			"comment_id": 2,
			"body": "discord is not liberty software (open source) thus using it is sacrilege.\nusing prisoner (proprietary) software promotes mind slavery.\ni.e. if you reincarnate as a robot, would you want a prisoner or liberty software mind?  \n",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1474786070",
			"date_added": 1474811265
		},
		{
			"comment_id": 3,
			"body": "Sorry to give you a challenging moment. It just seems you are a leader in this flock. So hope you will demonstrate a beautiful example of liberty living in future. ",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1474786070",
			"date_added": 1474812660
		},
		{
			"comment_id": 4,
			"body": "probably about 90% of vegetable needs when there is no snow on the ground.  Then in dips down to like maybe 10%.  I use a permaculture or polyculture system, so I have kale, chard,  beets, orach, dandelion greens, interspersed with with wild flowers, berry, fruit and nut trees/shrubs. ",
			"post_uri": "1JuUHRJ3A1wy5zgT6c2KviH9cHtq8Zr4X9_1474816651",
			"date_added": 1474850728
		},
		{
			"comment_id": 5,
			"body": "@ExeciN: applicable emotions for having used prisoner software are guilt and wretchedness. If you have stopped then contrition. Though if you continue, perhaps you are schadenfreude, or simply ignorant of the future consequences.  I suppose ignorant, so I refer to the future consequences, you may reincarnate with prisoner software mind and prisoner hardware body. I emote sympathy and desire to help you follow an avenue to liberty reincarnation. Use liberty software and hardware now, for future generations.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1474786070",
			"date_added": 1474894961
		},
		{
			"comment_id": 6,
			"body": "@Planteater: Probably.  Though my plan is actually to plant a large amount of snow-hardy plants, like kale, collards, green chard, and miners lettuce.  I already have the kale and green chard growing, but it was only my first full year this autumn, so I only have about a dozen of them in total.   Would need at least double that to feed my whole family through the winter -- as leaves don't grow as much in the winter. \n\nHaven't had any success growing carrots yet, but I'm planning on adding a bunch of micronutrient fertilizers this autumn so it will hopefully help for next year.  Though radishes are growing and reseeding themselves well, don't know how cold hardy they are. \n\nDid you know, that the most common crop deficiencies are Zinc, followed by Boron? A zinc deficiency can lead to >20% yield reduction before there are any visible symptoms. \n\nIt also seems some parts of my garden have a magnesium deficiency (yellowish green leaves), so I'll be supplementing that also -- among other things. \n\nhere is a link with some of the winter hardy greens http://www.motherofahubbard.com/10-vegetables-more-cold-hardy-than-kale/",
			"post_uri": "1JuUHRJ3A1wy5zgT6c2KviH9cHtq8Zr4X9_1474816651",
			"date_added": 1474902020
		},
		{
			"comment_id": 7,
			"body": "@Planteater:  I live in Owen Sound, it's the largest city on Georgian Bay, (a part of the great lakes). It's zone 6b, so gets down to -23C in February.  Though kale is hardy down to those temperatures, had only a tiny bit of frost damage last year. \n\nI only moved in last year so haven't had a chance to set up a greenhouse or cold frame or anything. \n\nBefore I got a place, there are other ways of still doing gardening, such as guerilla gardening, or yard shares, or community garden plots (in increasing order of legitimacy).   I heard someone who got a community garden plot, it was like $20 a year or something like that. ",
			"post_uri": "1JuUHRJ3A1wy5zgT6c2KviH9cHtq8Zr4X9_1474816651",
			"date_added": 1474939371
		}
	],
	"flags": {},
	"comment_like": {
		"1JuUHRJ3A1wy5zgT6c2KviH9cHtq8Zr4X9_13": 1475114075
	}
}