{
	"next_comment_id": 12,
	"user_name": "Userzero",
	"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "o peers (Tor, Slimjet, Firefox) : (",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1472524500",
			"date_added": 1472549368
		},
		{
			"comment_id": 2,
			"body": "Es el día de la Fiesta Nacional, lo del descubrimiento de América es secundario. 70 millones de personas en el 1492??? ¿Tú sabes lo que és eso? Veo que no tienes ni idea ni de historia, ni de demografia. Nadie niega la responsabilidad en la conquista de territorios, se sabe, hay libros, documentales y lo saben todos. Ni más ni menos que lo que habrían hecho otros conquistadores de la época, o es que te piensas que si hubiesen llegado antes los holandeses, ingleses, franceses, turcos, árabes os hubiesen echado flores. No se puede hablar de sucesos de hace 500 años con los conceptos culturales y humanos de ahora. No me hagas reir, dejad de llorar que ya han pasado más de 500 años, dejad de ir de victimas y tomar las riendas de vuestros países.\n\nSí hubiesen llegado antes los rusos, árabes e ingleses, por poner unos ejemplos, sí que os ibaís a cagar. Lee libros de historia y descubre de dónde eran los colonos que exterminaron a las tribus indias en los actuales EE.UU y quien fué de los primeros países en promulgar leyes para prohibir la esclavitud.\nY luego llevareís camisetas de los genocidas Hitler, Mussolini, Stalin, Lenin, Pol Pot...y de la nación que en más conflictos bélicos ha participado, EE.UU.",
			"post_uri": "1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_4",
			"date_added": 1476179701
		},
		{
			"comment_id": 3,
			"body": "¿LLamas genocida a una nación, pones las cuatro chorradas demagógicas de siempre y encima te sientes atacado?. ¿Qué esperabas? Tú lo que buscabas era polémica para publicitar tu blog. En España se quiere y respeta a todas las naciones latinoamericanas, se hace crítica de lo malo del pasado y se fomenta lo que nos une, pero siempre hay algún mediocre que echa las culpas de todo a un suceso de hace ¡¡¡más de 500 años!!! para no asumir su responsabilidad y la de sus gobernantes actuales. Seamos realistas si tu país hubiese tenido los medios tecnológicos, humanos y militares hace + de 500 años habría echo lo mismo. Ahora es tiempo de unión no de remover las partes oscuras de la historia que la saben hasta los niños.\n Cada semana se pierde una lengua en el mundo, más de 3500 están actualmente en vías de extinción ¿te piensas que en Europa se conservan los mismos estados, pueblos, culturas e idiomas que hace + de 500 años? . ¿te piensas que en Asia, Africa y resto del mundo no existia la esclavitud hace + de 500 años?\n¿Vas a llamar también genocidas a todas las naciones actuales que hace siglos conquistaron otros pueblos? (rusos, macedonios, romanos, ingleses, turcos, hunos, hutus, mongoles,....) ¿Cómo conquistaba Túpac Yupanqui hijo de inca y coya? Era famosa su crueldad salvaje con los pueblos y tribus conquistadas que incluía el canivalismo, sacrificios humanos y las violaciones.",
			"post_uri": "1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_6",
			"date_added": 1476228963
		},
		{
			"comment_id": 11,
			"body": "El ídolo de Cer-da Johnny Depp el maltratador de mujeres. Las imágenes publicadas por TMZ muestran al actor actuando con agresividad y violencia mientras discute con Amber Heard.\n\nhttps://youtu.be/Nhz9PCbnkkQ\n\nhttp://elpais.com/elpais/2016/08/15/estilo/1471253774_357483.html\n\n(Cada vez que tu metas spam en mis webs yo lo meteré en la tuyas, te ha quedado claro señorita)",
			"post_uri": "1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_1476466473",
			"date_added": 1476472902
		}
	],
	"flags": {
		"post-1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_6": 3,
		"post-1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_5": 0,
		"post-1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_4": 2,
		"post-1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_1476466473": 3,
		"post-1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_1476355494": 3
	},
	"comment_like": {}
}