{
	"next_comment_id": 16,
	"user_name": "Zerro",
	"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
	"post_like": {
		"1D242AyQghFqqQTwo1f1csP5kRQe588BUm_2": 1471016812,
		"1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t_10": 1471191381,
		"1889tLMuZze7YMshhe8u5h4NT4SSiA4PVB_1472819139": 1472826549,
		"1M29UgKTUcDsSHafheTS2W8Ec9RZiNMvRk_1473443056": 1473448073,
		"16it6qRi6MnCQ9JcqE1WBqNDU14qyXkExX_1473541119": 1473592338,
		"1BidCEzNjETypKRCaRFQ6myvDo71o6FDyC_1475496066": 1475501515
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Ubuntu is Ubuntu of Ubuntu-based distros.",
			"post_uri": "1EgXzBYn2GkL1xcXBzQioyYDjCW5nLpqyR_2",
			"date_added": 1471185693
		},
		{
			"comment_id": 2,
			"body": "The verified YouTube account. Is they true anon?",
			"post_uri": "164W1rFVD9Bm7poGJWvjVUjvkbhhFC5nnt_7",
			"date_added": 1471272646
		},
		{
			"comment_id": 3,
			"body": "Нетъ.",
			"post_uri": "15jaNgmjoKnxPXsmZntqHUmGuuUd9xosym_3",
			"date_added": 1471272790
		},
		{
			"comment_id": 4,
			"body": "@0dvar: ну запили. Вообще я ненавижу всю эту эзотерику и людей с ней связанных. Одна из тех вещей, кои я считаю наибольшим злом. Но сайт запили, посидирую.",
			"post_uri": "15jaNgmjoKnxPXsmZntqHUmGuuUd9xosym_3",
			"date_added": 1471277317
		},
		{
			"comment_id": 5,
			"body": "я то что читаю",
			"post_uri": "1HNzyvTnQ7pxsn2ypY3rDw9rJ578thajzJ_2",
			"date_added": 1471339622
		},
		{
			"comment_id": 6,
			"body": "Всегда был в некоторой степени. Соцсети не люблю не за то что соцсети, а за то что администрация навязывает свои нормы поведения достаточно большой группе лиц. А они все пишутся в угоду конформному большинству. С 2010 где-то года наблюдаю эту зачистку вкшки от неугодных маргинальных сообществ. Иногда выбивая прям по тематике, например группы про психоактивные вещества одно время прям изничтожались.",
			"post_uri": "1CPSoWx6aczUZdsPesjgVkLPsDuEYqDSBk_1",
			"date_added": 1472674270
		},
		{
			"comment_id": 7,
			"body": "А ты — нет.",
			"post_uri": "1HNzyvTnQ7pxsn2ypY3rDw9rJ578thajzJ_2",
			"date_added": 1472729971
		},
		{
			"comment_id": 8,
			"body": "bu'oi",
			"post_uri": "1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM_1472850577",
			"date_added": 1472850748
		},
		{
			"comment_id": 9,
			"body": "nani?",
			"post_uri": "1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM_1472850577",
			"date_added": 1472855121
		},
		{
			"comment_id": 10,
			"body": "> @Durand: epub is actually a very standardised format for ebooks. Much better than pdfs for most books because the text reflows automatically.\n\nfb2 is better. I had some problems with epub but I can read fb2 even on a cellphone with j2me. ",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474534231",
			"date_added": 1475069121
		},
		{
			"comment_id": 11,
			"body": "Не нужно говорить так, будто в P2P люди чем-то хуже тех, что предпочитают централизованные сервисы типа гугла. Да, есть свои различия в аудитории, но в целом среди пользователей распределенных и федеративных сервисов достаточно много хороших людей. Во многом это наоборот более гибкие люди. Тут смотря ты что понимаешь под гибкостью. Если в значении прогибаемости под правила, то да, тут действительно таких меньше. Если в знании того чтобы пойти против привычного и приспосабливаться к новому с нуля, то наоборот больше. ",
			"post_uri": "1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw_1475474775",
			"date_added": 1475498069
		},
		{
			"comment_id": 12,
			"body": "По причине того что P2P привлекает анонимусов, то сюда так же стекается аудитория и с имиджбордов. Там, то что вы называете \"хамством\", троллинг и хейтерство - это часть культуры общения. Конечно при этом такие пользователи не видят в этом чего-то сверхужасного. Такое \"хамство\" чаще всего безобидно. В соцсетях же наоборот процветает лицемерная вежливость. Где все друг-другу улыбаются, не одобряют оскорблений, но за какое-нибудь неосторожное слово вполне могут в суд подать. Так что я не могу подтвердить того, что культура общения анонимусов хуже.\n\nСам же я разделяю и ориентируюсь по тому, где я что пишу. Ориентируюсь на принятый стиль общения на ресурсе. Для меня всегда было за правило \"в чужой храм со своим уставом не лезут\" и всегда этого стараюсь придерживаться. ",
			"post_uri": "1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw_1475474775",
			"date_added": 1475501205
		},
		{
			"comment_id": 13,
			"body": "На самом деле в последнее время я с худшей культурой общения сталкиваюсь на YouTube, соцсетях и других ресурсах где затрагиваются политические темы. Вот там действительно сплошные безсодержательные оскорбления друг-друга. Стиль \"вежливости\" может различаться, подстраиваясь под правила ресурса, в том числе, но значения это не имеет.",
			"post_uri": "1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw_1475474775",
			"date_added": 1475501762
		},
		{
			"comment_id": 14,
			"body": "@Renha: ZeroNet это альтернативный интерфейс для данной соцсети, Это фича такая в Merger Sites. Можно хоть полностью свой сделать и так же общаться со всеми пользователями.",
			"post_uri": "1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw_1475474775",
			"date_added": 1475501873
		},
		{
			"comment_id": 15,
			"body": "Хм, жуйк. Зашел глянуть, а там пол лора, в том числе бывшего. Когда-то пытался туда пойти, но там нормально зарегистрироваться даже нельзя было. А я слишком вниманиеблядь, чтобы сидеть ридонли.",
			"post_uri": "1BidCEzNjETypKRCaRFQ6myvDo71o6FDyC_1475496066",
			"date_added": 1475513449
		}
	]
}