{
	"next_post_id": 261,
	"next_comment_id": 396,
	"next_follow_id": 27,
	"avatar": "generate",
	"user_name": "Musickiller",
	"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
	"intro": "[blog.musickiller.bit](http://127.0.0.1:43110/blog.musickiller.bit)",
	"post": [
		{
			"post_id": 8,
			"body": "@kaffie A decrypting clone... I have not thought of that((",
			"date_added": 1470904898
		},
		{
			"post_id": 9,
			"body": "Damn, I need an analog of retweets. Or an ability to reply to comments...",
			"date_added": 1470904995
		},
		{
			"post_id": 10,
			"body": "Yup, I use ZNet in underground trains without the need of Moscow Metro spy Wi-Fi hotspots =D\n\nViva Free Software, Viva Free Internet, Viva Freedom!",
			"date_added": 1470905836
		},
		{
			"post_id": 11,
			"body": "But I wish firechat was open though... Or opengarden had a tor-like routing, so that to a spy hotspot al the traffic was like it came from a single device... and open. I'm not sure that \"open\" in the name means anything. I have not seen those apps in F-Droid...",
			"date_added": 1470906186
		},
		{
			"post_id": 12,
			"body": "Nofish is like a rock star here ^_^",
			"date_added": 1470913733
		},
		{
			"post_id": 13,
			"body": "Sorry about typos. I'm at work, from a tabled, and too excited about this new feature! =D",
			"date_added": 1470914267
		},
		{
			"post_id": 14,
			"body": "Also a button to go to the top of the page is not a bad idea -_-\nOn IceCat it's a headache to return to the top any other way =(",
			"date_added": 1470917010
		},
		{
			"post_id": 15,
			"body": "Microblog is a great way to find people here. Good job. For real =)))",
			"date_added": 1470917077
		},
		{
			"post_id": 16,
			"body": "meow! =^_^=",
			"date_added": 1470932764
		},
		{
			"post_id": 17,
			"body": "darn, I've missed this feeling. Just write \"meow\" and send into the void of internet.",
			"date_added": 1470932874
		},
		{
			"post_id": 18,
			"body": "Is there a way to encode a file on a flash drive in a way that would be readable both on windows and linux and remain secure on both?",
			"date_added": 1470998254
		},
		{
			"post_id": 20,
			"body": "sadly HTML tags aren't working. Could've been a way to post images here...\n\nInsecure way, but still a way...",
			"date_added": 1470998444
		},
		{
			"post_id": 21,
			"body": "OK, I'm reinstalling an OS, and wanna try Parabola (like Arch, but GNU).\n\nI want to encrypt a partition. At first, I wanted it to be protected from an internet attacker even after I've decrypted the file for myself, but after reading some guides, I'm not sure I can do that.......\n\nAnd I'm not sure I need any other way of encryption, since I don't expect anyone to tamper with my drives... And if they do, it most surely will be a government, so there is no point in that =( They can just make me tell them the password.\n\nMay be some of you have an advice for me here?.. I feel a bit lost xD\n\nAlso the problem is that it's the first time I install anyting Arch-like, so thinking about \"how to do a thing I have not done on an OS I have not used before\" - is a bit troublesome alone.\n\nHELP!!!!111 >.<",
			"date_added": 1471014724
		},
		{
			"post_id": 22,
			"body": "OK. A better question: I'm goind to use a GNU version of Arch. DO I NEED TO ENCRYPT MY DRIVE AT ALL???\n\nI mean... It's not like guys from GNU are installing backdoors in their OS.. Do they?\n\nI'm not expecting anyone to steal my HDD while I'm away.",
			"date_added": 1471017294
		},
		{
			"post_id": 23,
			"body": "Trouble: I bought YOTA SIM-card yesterday. It sucks. They forbid tethering and torrent usage. But I think I found a way to bypass their security. Mesh network. Like open garden!\n\nThey surely check Wi-Fi/USB/bluetooth hotspot, but I'm not so sure about Wi-Fi/Bluetooth Direct! =D So I wanna try this one. I think that if they would prohibit those, no one would even consider buying their shit, since you can't directly switch Direct connection on/off.\n\nDo you know any opensource mesh network apps? Ones that share raw internet, not messages.",
			"date_added": 1471075152
		},
		{
			"post_id": 24,
			"body": "Damn yota... They spot whatever Open Garden does and block it.\n\nMy next idea is to use Wi-Fi Direct like OG did, but do that by hand with Ubuntu tools. May be I will be able to spot where and what have OG done wrong.\n\nThe thing I really need is to hide devices that connect to my phone or tablet and make them look like the tablet itself. But without rooting that's most surely impossible.\n\n// yes, I've lost the whole day to a futile attemp to use Open Garden to bypass Yota limitations...",
			"date_added": 1471108744
		},
		{
			"post_id": 25,
			"body": "AHA! I see the difference in wether I follow myself or not: by following myself, I can see my own posts on Activity feed! Useful!))",
			"date_added": 1471109572
		},
		{
			"post_id": 27,
			"body": "@nofish, I have a bug for you. Somebody, who he reads, tell him to pay a attention, OK?\n\nhttps://ipfs.pics/QmaAk5UwVGC42xMwgMkP4NsPNAwdf9y84miY61UnzGS8gy\n\nLink to the post:\n\nhttp://127.0.0.1:43110/1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ/26",
			"date_added": 1471276022
		},
		{
			"post_id": 28,
			"body": "https://www.qubes-os.org/doc/verifying-signatures/\nan interesting article. But why would I **ultimately** trust Cubes key?",
			"date_added": 1471279848
		},
		{
			"post_id": 29,
			"body": "...that I got from an internet... AHA! now I see what the keybase is for! =D",
			"date_added": 1471279873
		},
		{
			"post_id": 30,
			"body": "I think I broke the internet =\\\n\nMy Wi-Fi router is saying something really terrible this time. And the funny part is that I didn't do anything. Besides installing Qubes OS (yea, I finally got that it's not cubes, it's qubes)... I knew I should not trust them \"ultimately\" xDDDD\n\nIt was a provider's problem. Fixed now.",
			"date_added": 1471302806
		},
		{
			"post_id": 31,
			"body": "@nofish Man, I've got an idea, and I think, mlst people will agree with me: Like in other social networks, here people should see posts starting with their nickname in activity feed (since there are no other notifications) even if they don't follow the person writing to them. (see \"Mentions\" on Twitter/Twister).\n\nWithout it I have just had to go to my profile and check my old posts to see if anyone who I don't follow wrote anything.\n\nAnother problem is for this reason that I start following people that are not very interesting for me (but I still want to see when they answer me).",
			"date_added": 1471327955
		},
		{
			"post_id": 32,
			"body": "Cool... I had an unchanging amount of NXT for a month or so and still I can't forge. Cool. Very fucking cool.\n\nI don't really want to forge very much, but it's PoS system, and what's the point if I can't proove my stake?? And what's more importantly is wether or not I will be given Ardor after all this?..\n\n@ks, could you please check my account? Do you also see zeros on the amount that is needed for forging? It just can't be so!",
			"date_added": 1471328917
		},
		{
			"post_id": 33,
			"body": "Security error with keybase.io\n\nhttps://ipfs.pics/QmenE9Uw7TwrJuiZn3Bayz9FVYNnd8yTj1FFrtY8x5oWes",
			"date_added": 1471334695
		},
		{
			"post_id": 34,
			"body": "IceCat obviously could use a bit higher priority. Lags...",
			"date_added": 1471334752
		},
		{
			"post_id": 35,
			"body": "Darn.. No Keybase for android =(\n\nAnd when I thought to compile it for debian armhf, I found too many unknown languages. I don't wanna install a gigabyte of languages for a single app, even if that's keybase. And most surely I'll need to compile compilers (on android tablet) and I'm done with that.",
			"date_added": 1471336022
		},
		{
			"post_id": 36,
			"body": "Copy files between VMs in Qubes OS: https://www.qubes-os.org/doc/copying-files/",
			"date_added": 1471346780
		},
		{
			"post_id": 37,
			"body": "I've began to write about Qubes OS in my blog. Comment and help me make it better. Ask questions and I (or someone else who reads me) will try to find an answer.\n\nblog.musickiller.bit",
			"date_added": 1471464563
		},
		{
			"post_id": 38,
			"body": "Sorry for tons of typos I make. In a hurry. Have not slept enough and won't have much time to sleep today. But still wanted to tell you what I've discovered about Qubes today.",
			"date_added": 1471465651
		},
		{
			"post_id": 39,
			"body": "Sorry, but I will take a pause with Qubes. This night we are rooting an sm-t531 with Ubuntu-like OS.\n\nInteresting ClearNet links:\nhttp://www.rojtberg.net/668/how-to-root-android-using-ubuntu/\nhttp://glassechidna.com.au/heimdall/",
			"date_added": 1471560992
		},
		{
			"post_id": 40,
			"body": "Comment and ask questions and may be I'll post it in my blog.",
			"date_added": 1471561015
		},
		{
			"post_id": 41,
			"body": "OK. I've decided that I need at least one device alive. The phone is lost (again), so I can't risk killing my tablet.",
			"date_added": 1471566325
		},
		{
			"post_id": 43,
			"body": "I **love** secure browsers that don't use Flash. Right untill I want to watch porn.",
			"date_added": 1471566450
		},
		{
			"post_id": 44,
			"body": "The most usefull tool for ZeroMe is browser's search option. I just press \"highlight all\" on \"musickiller\" and browse Activity feed with ease =D",
			"date_added": 1471609581
		},
		{
			"post_id": 45,
			"body": "GNU IceCat ~~strikes~~ sucks again!\n\nhttps://ipfs.pics/QmdJwDP1QoXUZJ9bBze5BVDnJnsg1V2QT7NPRtkRk5s3iV",
			"date_added": 1471609693
		},
		{
			"post_id": 46,
			"body": "The sky is green and throwing bolts of silver.\nA good representation of what's happening with me last couple of weeks...",
			"date_added": 1471615266
		},
		{
			"post_id": 47,
			"body": "OK, guys: a big question! KingRoot: yes, or no? True solution or a trojan, like avast told me?",
			"date_added": 1471624787
		},
		{
			"post_id": 48,
			"body": "I want to root my devices and it seems easier with KingRoot... But I think I'll use Odin for sm-t531 and may be try Heimdall for HTC Desire 310 (I hope Heimdall does not only support Samsung...)",
			"date_added": 1471631880
		},
		{
			"post_id": 49,
			"body": "Windows is like a drug.. I can't stop using it =(",
			"date_added": 1471631990
		},
		{
			"post_id": 50,
			"body": "Damn... ZeroMe still does not have ctrl+enter support...",
			"date_added": 1471632025
		},
		{
			"post_id": 51,
			"body": "Bad news: I have to decrypt the device before I install SuperSu there... Stupid TWRP can't decrypt the fs itself...",
			"date_added": 1471633993
		},
		{
			"post_id": 52,
			"body": "I want to sleep. AND I want to decrypt my tablet and install supersu, normal terminals and a multiwindo mode...",
			"date_added": 1471643090
		},
		{
			"post_id": 53,
			"body": "OK, no, actually I want to install ubuntu there... Compile stuff I usually use... And have a normal linux on a device that I use outdoors... But it's a long term project.",
			"date_added": 1471643176
		},
		{
			"post_id": 54,
			"body": "Damn... people, you scare me. Read my blog before writing like that in my comments... Or at least ZeroME.. A guy that plans to install Ubuntu on an Android tablet can't be a windows lover...",
			"date_added": 1471645540
		},
		{
			"post_id": 55,
			"body": "Sorry for not answering, guys... I have to search through all my messages, since there are no Mentions yet.\n\nAnd sorry for being quite agressive... I have trouble being around new people. It appears that it's true even for social networks.\n\nAnd please read my profile first, before writing all those bizzare suggestions...",
			"date_added": 1471646321
		},
		{
			"post_id": 56,
			"body": "My phone is almost charged enough for decryption. I'll go to bed soon (at last).\n\nGood night, ZeroMe.",
			"date_added": 1471646362
		},
		{
			"post_id": 57,
			"body": "A smart idea: RT @Jayofthezero: ... Only alternative I can think of would be to use something like Tasker to send a secure email, or similar, the location of your phone at either defined intervals or when you send a trigger to your phone, like an SMS.\n\n-----\n\nQ: So Tasker is an app for android?\nA: Yup, but it's priprietary, so I won't trust it.\n\nQ: Something else?\nA: Yup! [LibreTasks (clearnet)](https://f-droid.org/repository/browse/?fdfilter=task&fdid=libretasks.app)",
			"date_added": 1471676713
		},
		{
			"post_id": 58,
			"body": "@Andrewm: You've got an awesome site =D Is the background run on JS?",
			"date_added": 1471677354
		},
		{
			"post_id": 59,
			"body": "When I edit my profile info, at first ZeroMe says \"published\", then, after a brief pause, it says \"failed\". WTF?\n\nNow it says it about everything!",
			"date_added": 1471677748
		},
		{
			"post_id": 60,
			"body": "https://ipfs.pics/QmXvkiaw7Um8D1b39wJQLzRxbQUKAb5g9TBxHh4U3Q4a4x\n\nNow the question: whas it worth rooting for?\n\nOfcourse it was! =D Now I can say \"OH JUST LOOK AT MY AWESOME MULTIWINDOW ANDROID SUCK IT U APPLE SUCKERZ!\"",
			"date_added": 1471682489
		},
		{
			"post_id": 61,
			"body": "Don't ask me, why have I not added an avatar yet. Don't. (Cuz I don't know! xD)",
			"date_added": 1471682534
		},
		{
			"post_id": 64,
			"body": "Emm... Has anyone flashed some non-android linux to an android device? I didn't find any info for my tablet.. sm-t531.\n\nBiggest problem for me - is that I don't understand how it should happen... Should I just put everything from a root folder of an installed linux into a .zip file and flash it? Or it's not that easy?",
			"date_added": 1471695923
		},
		{
			"post_id": 65,
			"body": "I'm gonna try using Lil' Debi onstead of GNURoot Debian. May be this way I'm gonna save a few MBs\n\n523 MB free now.",
			"date_added": 1471697743
		},
		{
			"post_id": 66,
			"body": "Din't work... For some reason I don't understand.\n\nLog:\n\n```\n# cd /data/data/info.guardianproject.lildebi/app_bin\n# ./create-debian-setup.sh  /data/data/info.guardianproject.lildebi/app_bin /storage/emulated/legacy /storage/extSdCard/Android/data/info.guardianproject.lildebi/debian.img /data/debian \\\n&& ./stop-debian.sh  /data/data/info.guardianproject.lildebi/app_bin /storage/emulated/legacy /storage/extSdCard/Android/data/info.guardianproject.lildebi/debian.img /data/debian \\\n&& ./unmounted-install-tweaks.sh  /data/data/info.guardianproject.lildebi/app_bin /storage/emulated/legacy /storage/extSdCard/Android/data/info.guardianproject.lildebi/debian.img /data/debian \\\n&& ./start-debian.sh  /data/data/info.guardianproject.lildebi/app_bin /storage/emulated/legacy /storage/extSdCard/Android/data/info.guardianproject.lildebi/debian.img /data/debian \\\n&& /data/data/info.guardianproject.lildebi/app_bin/chroot /data/debian /data/data/info.guardianproject.lildebi/app_bin/complete-debian-setup.sh  /data/data/info.guardianproject.lildebi/app_bin /storage/emulated/legacy /storage/extSdCard/Android/data/info.guardianproject.lildebi/debian.img /data/debian `\n# ./stop-debian.sh  /data/data/info.guardianproject.lildebi/app_bin /storage/emulated/legacy /storage/extSdCard/Android/data/info.guardianproject.lildebi/debian.img /data/debian \n# exit\ntmp-mksh: <stdin>[6]: ./create-debian-setup.sh: No such file or directory\ntmp-mksh: <stdin>[7]: ./stop-debian.sh: No such file or directory\n```",
			"date_added": 1471698907
		},
		{
			"post_id": 67,
			"body": "@nofish https://ipfs.pics/Qmcpjz7XR572kdGZ1vMjPEB4uB4iYizonbB3cQvPmXcFvX\n\nyou see?",
			"date_added": 1471699263
		},
		{
			"post_id": 68,
			"body": "By the way, NameID works well!",
			"date_added": 1471703267
		},
		{
			"post_id": 69,
			"body": "I've decided to kill Qubes and install Parabola.\n\nWhy? . . . . . . .\n\nHow the hell I'd know?)\n\nNot many people were interested in Qubes, so I've stopped testing and was playing with windows half a day...",
			"date_added": 1471717180
		},
		{
			"post_id": 70,
			"body": "Damn... Steam is not officially supported on Arch. But [Arch Wiki](https://wiki.archlinux.org/index.php/Steam) really is great O_O",
			"date_added": 1471717404
		},
		{
			"post_id": 71,
			"body": "By the way, look: I use GitHub and Password Store (on Android) to store my passwords!\n\nhttps://github.com/Musickiller/passwords",
			"date_added": 1471717517
		},
		{
			"post_id": 72,
			"body": "The next thing I'll do will be the reinstallation of ZeroNet. I'm getting tired of \"Content publish failed.\" errors.",
			"date_added": 1471717638
		},
		{
			"post_id": 73,
			"body": "You all would do a good thing by telling me how to encrypt my disk an easy way. I will have a live version of ~~Arch~~ Parabola with gparted and some other apps...\n\nQubes OS surprised me when it had encrypted my drive by default. It was cool. All I had to do was to input a passphase.",
			"date_added": 1471718274
		},
		{
			"post_id": 74,
			"body": "And again: Parabola have their open key on their site. Fine. But how do I check the key?\n\nI like Keybase more and more.",
			"date_added": 1471719156
		},
		{
			"post_id": 75,
			"body": "@nofish need more space =(\n\nBy the way, when I delete old posts that have likes/comments, are comments deleted, or saved forever? Sooner or later that is going to be a big problem, if they are kept, I think.",
			"date_added": 1471719720
		},
		{
			"post_id": 76,
			"body": "Bu trusting **ultimately** to some file I made by copying text from some site I never been before, I was able to verify Parabola's .iso >.< Oh, how I hate this.\n\nBut I still need to encrypt my drive. HOW??",
			"date_added": 1471721463
		},
		{
			"post_id": 77,
			"body": "Hey.. I've got a crazy idea.\nWhat if I use this method on android?? =D\nhttps://ipfs.pics/QmaiRXPnC2TTHKdwwPzPqQUzmeNMwt4FjLybcJAbGu91oP\n\nLil' Debi is using chroot just fine!\n\nI just need to compile an armhf image of Arch. f u c k . . .",
			"date_added": 1471722171
		},
		{
			"post_id": 78,
			"body": "I see the problem now: even if I successfully install Arch-arm to my tablet, I'll most surely will still have lots of troubles. One of major problems: will I be able to call?",
			"date_added": 1471724009
		},
		{
			"post_id": 79,
			"body": "Need help:\n\nIf I want to use LVM, what partitions should I leave outside of it?\nGentoo Wiki said /boot, grub, and swap. Do I really need to put swap out of LVM, or OS will read it just fine?",
			"date_added": 1471730643
		},
		{
			"post_id": 80,
			"body": "For quite a long time I was trying to understand, what should I do in order to boot Arch from LVM volume...\n\nBut now most of the time I can't construct even a simple sentence and when I can, it takes me time to put a right finger on a right button.\n\nAnd when I can do both, it's all about those crazy ideas like \"spend a month to find a way to boot both linux and windows from an LVM volume\" (even though they say that windows doesn't support LVM... so it's windows core modifications I am talking about,,,)\n\nOr write to a couple emotionally unstable girls that I know. And I'm not sure which idea is worse.. Windows can't kill me. At least not as easily as a woman awoken at 3:00 only to discuss some crazy idea of loading windows from an LVM...\n\nI need to sleep. NOW.\n\nGood night, people. MK out.",
			"date_added": 1471736247
		},
		{
			"post_id": 81,
			"body": "Everyone! Say hello to my new imaginary friend! I'll call her Sanity!",
			"date_added": 1471737129
		},
		{
			"post_id": 82,
			"body": "I think, I'll drop the idea of installing parabola and will use Arch instead.\n\nMain reasons for trying Parabola were:\n- installer. It really helps. I haven't seen Arch yet, but installation process, described in wiki gives me chills...\n- GNU. Safety, Freedom, and other crap...\n\nReasons to go Arch:\n- installer stopped working. It just says \"can't launch this app\". Miracle.\n- None of my Wi-Fi sticks seem to be supported by the live OS. And no one said that they will be supported after installation is over.\n- You use Arch, not Parabola (at least those of you who use Arch-like OS). And when I ask you \"why doesn't this work?\", you'll say \"it works on Arch, but parabola is... totally GNU\".\n- Arch wiki is Arch wiki, not Parabola wiki. Some stuff may be different.\n- I will use Steam anyway. It's the opposite of Free. So why would I try to look like a free man?",
			"date_added": 1471778371
		},
		{
			"post_id": 83,
			"body": "So I'm going to try installing Arch on LVM. If anyone is interested, comment.",
			"date_added": 1471778689
		},
		{
			"post_id": 84,
			"body": "http://127.0.0.1:43110/blog.musickiller.bit/?Post:233:Arch+on+LVM",
			"date_added": 1471782963
		},
		{
			"post_id": 85,
			"body": "@ks Ugh... \"I'll check out the script when I install Arch!\" Funny. Now it seems to be a synonym of \"never\" =(\n\nI'm tired and bored, but I've only managed to make partitions.\n\nI'll continue of reading the wiki, since I still have both time and desire to see Arch on my machine (I'm VERY stubborn at times), but I'm not sure for how long will this be so.",
			"date_added": 1471803996
		},
		{
			"post_id": 86,
			"body": "https://ipfs.pics/Qme65cddPCa7QKSwh3cRhCCHXDSJh7LKdk1yJiEkCH7gei",
			"date_added": 1471804708
		},
		{
			"post_id": 87,
			"body": "@ks now I see why don't you use windows.. It requires just as much attention as Arch, but Arch seem to be easier to maintain. I can't spend a month on windows without a BSOD...\n\nThe problem is that many apps work ~~better~~ only on windows. At least those that require .Net =(",
			"date_added": 1471805229
		},
		{
			"post_id": 88,
			"body": "Got a trouble with Arch Wiki. See blog.",
			"date_added": 1471817505
		},
		{
			"post_id": 89,
			"body": "Sadly, I can't read neither my blog, nor my ZeroMe in Elinks =((",
			"date_added": 1471818087
		},
		{
			"post_id": 90,
			"body": "My LVM partition was showing as 8300 (linux partition) instead of 8e00 (LVM), so I've decided to start from scratch.",
			"date_added": 1471820673
		},
		{
			"post_id": 91,
			"body": "Anyone can tell me fast how to hybernate or put to sleep Arch Linux loaded from live? Suspend... I dunno what word is right...\n\nI'm a lazy ass and I don't wanna setup wi-fi again and open browser...\n\n..which is about 1-5 minutes.\n\nOK, forget it. I can spend those minutes =D",
			"date_added": 1471825015
		},
		{
			"post_id": 92,
			"body": "G'night!",
			"date_added": 1471825023
		},
		{
			"post_id": 93,
			"body": "`systemctl suspend`",
			"date_added": 1471825112
		},
		{
			"post_id": 94,
			"body": "Arch Live ISO > `cat /etc/localtime` after `ln -s /usr/share/zoneinfo/Europe/Moscow /etc/localtime`\n\nhttps://ipfs.pics/QmYaMfMj8UCQU79YnG6J5YJZ2M1Ea7QXxcVMjjqZNHq7fw\n\nQ: Can anyone reproduce it? Should I report it? =D\nA: It's not an error.\n\nMy tty1 is completely inoperable now xD\n\nGood news is that I have 5 more terminals to corrupt >=D\n\nQ: How to fix it?\nA: `reset`\n\n##interesting thing:\nIt works anywhere (not in X). Just press ctrl+alt+f1.",
			"date_added": 1471865649
		},
		{
			"post_id": 95,
			"body": "Things I've learned today:\n1. How to crush a font on a terminal.\n\nThe day have began with FUN...",
			"date_added": 1471866673
		},
		{
			"post_id": 96,
			"body": "Interesting...\nFrom mkinitcpio.conf:\n`Note: if you have /usr on a separate partition, you MUST include the usr, fsck and shutdown hooks.`\n\nI have /usr on /dev/sda2, just an everything else. But it's all separated into different logical volumes.\n\nQ: Should I enable those hooks?\nA: No harm doing it.",
			"date_added": 1471868873
		},
		{
			"post_id": 97,
			"body": "Where (and when??!) do I setup [kernel options](https://wiki.archlinux.org/index.php/LVM#Kernel_options)??\n\nAs far as I got it, I should specify root parameter in GRUB...",
			"date_added": 1471870622
		},
		{
			"post_id": 98,
			"body": "Ouch... I've got an ancient problem:\nwhen regenerating initramfs-linux-fallback.img, it can't find firmware for aic99xx and wd719x.\n\nForums say that 3 years ago almost **everyone** had this problem. I **will** ignore it... But I don't think it's 100% OK.\n\naic error is 3 years and wd is more than 10 yrs old\n\nMay be the Machine Spirit wants to tell me something?",
			"date_added": 1471871506
		},
		{
			"post_id": 99,
			"body": "@ks by the way, GRUB seem to be able to boot the system from almost any FS.",
			"date_added": 1471872034
		},
		{
			"post_id": 100,
			"body": "GRUB settings:\nin /etc/default/grub:\n```\nGRUB_CMDLINE_LINUX_DEFAULT=\"[...] root=\"/dev/mapper/lol-root\"\n\nGRUB_PRELOAD_MODULES=\"[...] lvm\"\n```\n\n_searching for other settings needed to load my OS_\n\n###Quesions:\n1. should I use --target=i386-pc, as it is in the manual, or there is an option for x64?\n\n###Warnings:\n1. Failed to connect to lvmetad. Falling back to device scanning. (no error reported)",
			"date_added": 1471876666
		},
		{
			"post_id": 101,
			"body": "A-a-and it's not booting.\n\nwith 2 errors. 1 obviously not critical: `ERROR: resume: no device specified for hibernation`, and one is the reason for the trouble: `ERROR: Root device mounted successfuly, but /sbin/init doesn't exist`\n\nInteresting fact is that `ls /new_root` shows sbin, but `ls /new_root/sbin` shows `No such file or directory`\n\nI'm **this** close to formatting it all into ext4 and covering the whole idea of LVM with a giant dick.\n\nOne forum says that I should add `init=/bin/systemd` to my kernel line.\nIs it \"kernel parameters\"?\n\n... which should mean\n1. boot to live USB\n2. mount all partitions as they were\n3. edit grub configuration\n4. regenerate grub .conf\n5. profit\n\nIf it fails again, I'll write a script for it...\n\nIt appears that I've not created boot logical volume.. fuck. I can just copy files from old boot, can't I?",
			"date_added": 1471879379
		},
		{
			"post_id": 102,
			"body": "I already love Arch - I've learned so much by trying to install it!\n\nHowever, it would be nice to actually do that -_-\n\nBut.. I still want LVM. A bit. A very small bit. The last bit of my patience...",
			"date_added": 1471887742
		},
		{
			"post_id": 103,
			"body": "Am I a masochist if I like the fact that I am to stupid to just install Arch, and I want more?",
			"date_added": 1471887822
		},
		{
			"post_id": 104,
			"body": "@fav\n```\nmk@mk-K50IJ:~/Desktop/here$ keybase sign -i test -d -o test.sig\nmk@mk-K50IJ:~/Desktop/here$ keybase verify -d test.sig -i test\nSignature verified. Signed by musickiller (you).\nmk@mk-K50IJ:~/Desktop/here$ ls\ntest  test.sig\n```\n\nBut it creates a keybase saltpack signature, not pgp. Is it good enough for you?\n\nThe solution I see is to create a pgp signature separately, if you need that.",
			"date_added": 1471889986
		},
		{
			"post_id": 106,
			"body": "OK, I'm back at GRUB configuration... let's see where have we managed to fuck up..",
			"date_added": 1471892437
		},
		{
			"post_id": 107,
			"body": "duh... now my GRUB loads into command line. -_-\nAnd I don't know what exactly caused this =(((",
			"date_added": 1471896318
		},
		{
			"post_id": 108,
			"body": "OK. Fuck LVM.\n\nThanks for trying to help me guys, but I want to remember Arch not as \"a system that I could not install because I wanted more than I needed\".\n\nI have decided to format my drive as 1 ext4 partition and 1 ntfs partition, one for Arch, one for windows games.\n\nSimple.\n\nThat and 5G swap. (you may already see why I liked the idea of LVM so much - I always forget something. Like make a partition for this or that...)",
			"date_added": 1471898964
		},
		{
			"post_id": 110,
			"body": "I knew that the right password to Arch install would be \"fuck lvm\". I've just wanted to try.",
			"date_added": 1471903606
		},
		{
			"post_id": 112,
			"body": "By the way, without tweaks and stuff like that, GRUB is the easiest to install. But it also seems to be very customisable and supports almost any system.",
			"date_added": 1471907348
		},
		{
			"post_id": 1471951382,
			"body": "and now it's not about memory anymore: GPU lockup - switching to software fbcon\n\nand after this one I can't get back into suspend. systemctl suspend makes my PC tick and clack...",
			"date_added": 1471951266
		},
		{
			"post_id": 1471951847,
			"body": "Damn.. I've set suspend to POS (which I think is Power On Suspend, or smth like that.. Without RAM and with all fans working) and it still gives some errors. Different this time\n\nata2.00 revalidation failed (errno=-5)\nata1.00 revalidation failed (errno=-5)\n\nBut I does not seem to have any impact on the system... And I have a surplus of hard drives so even if one burns, it's OK.\n\nI'm more worried about memory - I only have 2 spares for my 2G DDR2 and 2 1G DDR2 (which is not enough with 2 slots)\n\nAnd I am REALLY worried about my video card! She's not new, but it's the only one I have!",
			"date_added": 1471951730
		},
		{
			"post_id": 1471985010,
			"body": "is it possible to shutdown X for some time and then just run it again? It takes some memory and CPU and I don't always need it on my notebook. I mainly need to start/stop transmission and qbittorrent here, and too lazy to setup web interface. Plus I use browser from time to time...",
			"date_added": 1471984887
		},
		{
			"post_id": 1471991667,
			"body": "I want to take a baseball bat and suspend my PC a couple of times...\n\nI would write \"Suspender\" on a bat. No. \"Hibernator\" - much cooler.",
			"date_added": 1471991538
		},
		{
			"post_id": 1472037284,
			"body": "@Shellbound tiling is a great idea. I'm already switched to terminator on Ubuntu, coz it's so cool to have terminals tiled.\n\nI'll definitely look into tiled window managers! (When I will be able to boot my Arch at all...)",
			"date_added": 1472037154
		},
		{
			"post_id": 1472079968,
			"body": "This day was a day of shell coding.\nhttps://github.com/kseistrup/kbmsgr\nAdded (un)install scripts for the app.\nNow with installation and configuration data folders customization! Awesome xD",
			"date_added": 1472079837
		},
		{
			"post_id": 1472125170,
			"body": "@nofish: Can you please do something about Zero Sites design??\n\nhttps://ipfs.pics/QmZeSAhCE699bL492brHD1spqnTnq4uWxV8P7xYpssGbGh\n\nThis problem happens every time I switch to a dark theme .\n\nIt does not happen on other sites. Comments  on ZeroMe work fine, but on blog - the same.",
			"date_added": 1472125037
		},
		{
			"post_id": 1472125276,
			"body": "Made my desktop look amazing...\nhttps://ipfs.pics/Qmc6iTgUynrDzSfE6yJsha1zdh9QpTMcykVeBR9VyyzvUJ\nBut in ZeroNet I can only write by editing posts, since there is some problem with ZeroNet sites design (however I like the desig itself very much).\n\nP.S. OK, I know it's not the best thing one could imagine, but it's the best stock theme I saw through any Linux distribution. +1 point to Ubuntu Mate.",
			"date_added": 1472125142
		},
		{
			"post_id": 1472132590,
			"body": "commands in command line sometimes look like some tribal speech.. `mkdir aa && mount /dev/sdd3 aa && cd aa`\n\nespecially the  aa && cd aa part... I bet, ls, cd, &&, dir - were first words man spoke, when came out of the cave...",
			"date_added": 1472132453
		},
		{
			"post_id": 1472133459,
			"body": "May be there are any people among my followers who have Nvidia and Arch????",
			"date_added": 1472133320
		},
		{
			"post_id": 1472140024,
			"body": "ZFS is even harder than LVM, even though it seems to be much better. If I use all 3 drives in RAID-Z ZFS, it's better than mirroring in LVM. However, I can install home folder on LVM by\n```\npacman -Syu lvm2\npvcreate /dev/sda3\nlgcreate /dev/sda3 lg1\nlvcreate -n home -L 500G lg1\nmount /dev/mapper/lg1-home /home\n```\nand with ZFS it will be much more complicated. There are scripts, and I need to use AUR, and smth else... pff... too much, I think. It would take me another week to do so. And I don't have a week already. University is coming =(",
			"date_added": 1472139884
		},
		{
			"post_id": 1472145196,
			"body": "step 1: installing Ubuntu\nstep 2: installing Ubuntu while playing some game on a tablet\nstep 3: installing Fedora\nstep 4: installing Android\nstep 5: installing Ubuntu on the phone alongside Android\nstep 6: installing Arch from beginner's guide\nstep 7: installing Arch, looking at installation guide and kittens, talking to friends and eating, using scripts to automate parts of the process.\nstep 8: installing Arch with hundreds of scripts, written during precious installations.\nstep 9: starting \"The One Script to Install Arch\" that was made of all previous scripts and going outside to see the sunrise.\nstep 0: The Machine Spirit installs the OS.",
			"date_added": 1472145054
		},
		{
			"post_id": 1472148130,
			"body": "Damn... Installation guide does not say when I should install grub. I know when, but\n1) I forget things, especially when i read the guide and almost everything is in the guide but this thing\n2) new people won't know it.\n\nOK, it is there. My fault. But the first guide was better. Why would they delete it?",
			"date_added": 1472147986
		},
		{
			"post_id": 1472149066,
			"body": "YAY, I have logged in to my Arch once again!! ^_^",
			"date_added": 1472148921
		},
		{
			"post_id": 1472150475,
			"body": "AHA!!! I've installer a driver and then logged in again!\n\nHowever, I have not configured xserver... should I? not like I'm using it already... But Nvidia Guide in Arch Wiki specifies me to do that.\n\nMay be I should follow those steps before they delete that guide too?",
			"date_added": 1472150329
		},
		{
			"post_id": 1472151813,
			"body": "How do you check the time with a cat?\n\nIf the cat howls like a dog, tiger, lion, or a cock, or if it's running around the house like a race car - then it's evening and time to go to bed!",
			"date_added": 1472151665
		},
		{
			"post_id": 1472156092,
			"body": "@GomZik: I'm reading manuals. I'm quite a newbie. Plus it's not enough for me to open \"users and groups\" page and just find the command to add a new user - I need to read \"why to use users at all\", \"groups\" and all the stuff that might be useful. So it takes time.\n\n30-40 minutes ago I was ready to add a new user, but I wanted zsh instead of sh. And when I read /etc/shells, I saw /bin/zsh and /usr/bin/zsh. I got interested in why there are two files. So I read about basic FS folder structure and chose /usr/bin/zsh, because that's where files for users are.\n\nI'm was ready to type it, but  my PC showed my black screen again when I exited suspend mode. So I've searched the reason - it's a video driver. nvidia-340xx causes black screen when some PC exit suspend mode. So I've found a workaround in AskUbuntu. And since it included working with blacklist.conf, I came back here to see what modules are blacklisted in @ks's file, wether or not should I do the same.\n\nAnd a couple of minutes ago I was ready to do that, but I've decided to write an answer to you. I think that should explain my 4-5-day installation of Arch =)",
			"date_added": 1472155943
		},
		{
			"post_id": 1472156415,
			"body": "@ks currently, htop is showing 0-0.7% load on my CPU and average load of 0.08, 0.03, 0.01.\n\nMay be the bug in those modules is patched, or it's not affecting me?\n\nHowever my fans work at maximum =(\n\nIs there a way to autocontrol them? I'ts quite cold to sit near my PC this days =(",
			"date_added": 1472156265
		},
		{
			"post_id": 1472160050,
			"body": "So Ubuntu Wiki did not help with the black screen problem.\n\nSo it's either a big glitch without a driver, or a black screen with it.\n\nWhy... Why do I always get all the FUN???\n\nBy the way, I'd better check the new Dwarf Fortress while I still have some time...",
			"date_added": 1472159899
		},
		{
			"post_id": 1472292296,
			"body": "@ks sorry, hard day.\nI've updated kbmsgr and got\n```\nkbmsgr-post: cannot obtain lock: /dev/shm/kbmsgr-musickiller.txt..LCK\n```\n// posfix was waiting for setup, didn't see it.\n//however I don't see why would I turn my PC into a post-machine only to write a line to a file. I think it's against the KISS.\n\nAnd another bug: if I write a bit more than one line and delete a couple of symbols, instead of returning the previous line, msgr shows an empty line (invisible symbols).\n\nI'm gonna test the other script in a couple of minutes.\n\nBy the way, uninstall.sh uses rmdir by default to delete config directory only if it's empty, and rm -rf if you launch it with --full parameter (no -f, as a precaution). I'm a smart monkey =D",
			"date_added": 1472292144
		},
		{
			"post_id": 1472301444,
			"body": "It appears that to install Arch on my Android with chroot, I will have to install Cyanogen first. Stock soft does not support even ext2. \n\nI'm not sure if linux can even work without symlinks o_O\n\n(obviously it can somehow, but I made arch install folder at least 5 times bigger already simply by following symlinks, and it's not over yet!)\n\nMy bad: I've misused cp command and copied some extra files. But no. Without symlinks it won't work. So I'm gonna flash Cyanogen beta to my sm-t531.\n\nWish me luck.",
			"date_added": 1472301291
		},
		{
			"post_id": 1472302230,
			"body": "no.. it's stupid, but I've even checked \"may be with procmail, I've for some unknown reason wrote postfix - a package I don't even know\". For some reason I did't do that...\n\nSO WHY? APT, WHY?? Is it a part of that cow magic?\n\n```\nThe following additional packages will be installed:\n  postfix\nПредлагаемые пакеты:\n  postfix-mysql postfix-pgsql postfix-ldap postfix-pcre sasl2-bin dovecot-common postfix-cdb postfix-doc\nНОВЫЕ пакеты, которые будут установлены:\n  postfix procmail\n```\nwhat the... how the... why????\n\nit can remove postfix with no harm to procmail - so it's not a dependency!\n\nok.. I said fuck it, then fuck it.",
			"date_added": 1472302075
		},
		{
			"post_id": 1472306285,
			"body": "a small secret for you guys: Arch Wiki's Beginners Guide is left untouched in arch-wiki-lite.\n...and in my heart! =D",
			"date_added": 1472306129
		},
		{
			"post_id": 1472313702,
			"body": "I wanna repeat @Shellbound's comment in a separate post - too hard to find it...\n\n@Musickiller: It is really good to get a first feel and to see it's capabilities.. i3wm a beginner friendly alternative which many starts with and then Bspwm as it is a bit more advanced to set up. The difference of tiling wm's are as big as with normal desktop environments like Gnome and KDE. One tiler might suite while another one wont.",
			"date_added": 1472313545
		},
		{
			"post_id": 1472323691,
			"body": "ok. After several attempts of not doing it, I've tried to install the whole \"xorg\" meta-package.\n\nProblems:\n1. I still don't have /usr/bin/xorg or /bin/xorg.\n2. I can't delete the meta-package, since my drivers need it.\n\n##IT'S TOTALLY NOT MY DAY.\n1. Of course I have not tried to run initx as root!\n2. The ROM for my tablet was superglitchy (even though it had ext4 support)\n2. Of course I have started flashing my tablet back (the last device I have) before charging it! (hope it finishes..) It has started with 1% charge, but 30 minutes passed and it's still on 1%, so there is a chance.\n3. Now I have the whole xorg package as a reminder of my stupidity today.\n\nGood news: I've started an example session of xorg, and gonna try i3 and gnome very soon!\n\n##GREAT!\n\nI have a display manager (gdm) and a window manager (i3wm)!",
			"date_added": 1472323533
		},
		{
			"post_id": 1472328192,
			"body": "##Quesioning!\n\nWhat terminal do you use? I hate xterm. And tired of tty.",
			"date_added": 1472328033
		},
		{
			"post_id": 1472329014,
			"body": "##Qusetioning continues!!\n- music player\n- synch app. Do you know unison? btsync? some Free/Libre app (preferably)? And I need android compatibility.",
			"date_added": 1472328854
		},
		{
			"post_id": 1472335441,
			"body": "@nofish: I've just installed ZeroNet on my PC and the only thing I copied was my users.json. And look: the same very problem!\n\nhttps://ipfs.pics/QmRxBv6NPi1hkBC7WeNak6aU9Ttd1dHrCEqdynz2Z3PUGh\n\nI have not changed hubs or anything. Just using. Hey! I have a theory: you've rissen my limit on 1 hub, yes? The Red Hub. What if I've overcame my limit somewhere else??? Somehow...\n\nI will provide you the log if you remind me what exactly you need and where to send it.",
			"date_added": 1472335280
		},
		{
			"post_id": 1472336851,
			"body": "OK. It's trully not my day. The D-Menu of i3 is not working so I'm going to bed. Good night. Don't let bugs into your code!",
			"date_added": 1472336689
		},
		{
			"post_id": 1472387559,
			"body": "this day smells better: the Machine Spirit blessed my Gnome and I am now using it.\nPC fans work even more silent than usually.\nI've learned to use & after a command to start everyting from one terminal (imagine what happened before). So the absence of the \"D-menu\" is not a big problem.\n\nSo, I can call it a successful (more or less) install of Arch. A bit messy - with all that metapackages, but with 5.5TB I can't really be sad about that problem for a long time.\n\nBig thanks to everyone who helped. Every comment counts, really. Arch Wiki is good, but I could not do that without you, people.\n\nGood day to every one.",
			"date_added": 1472387396
		},
		{
			"post_id": 1472387670,
			"body": "testing\n<img src=\"https://ipfs.pics/QmdGbqRXppoo9K1zeRFKt7LdPNRjQL2dLCtR8SgodPH8qd\">\n\n@nofish: why there is no pictures support in here? we wanna post pictures! =D Make turn on/off option for paranoids and limited connection guys if you want, but what's wrong with crypto kittens? =^_^=",
			"date_added": 1472387506
		},
		{
			"post_id": 1472389387,
			"body": "##Sync apps\nOK, I've reviewed several options. The closest thing I got to what I needed was syncthing, but the Droid app was not working with my SD card and console client tried to make /.config folder and / us read-only on Droids.\n\nSo I'll stick to BTSync for now, and with a comfortable for me speed (extra slow) learn about rsync.\n\nAlso I'll try to undetstand how can I send files through ssh.",
			"date_added": 1472389222
		},
		{
			"post_id": 1472389587,
			"body": "About my super ability to be super slow: the reason I have GUI now is that I got tired to read stuff and just did some stuff. It cost me some possible trouble in the future (with all those extra packages and \"forget console, let's just make it run somehow\"), but I think it's good that I actually am where I am.",
			"date_added": 1472389421
		},
		{
			"post_id": 1472389698,
			"body": "##Lost keys\nBy the way, I've lost my blog's key so I think I'll make another one. I'll keep the link (blog.musickiller.bit) and a couple of guides. Comments will be deleted. And I don't know WHEN that happens.",
			"date_added": 1472389531
		},
		{
			"post_id": 1472389994,
			"body": "Terminology also wants the whole Elimintary? ok.. 100 MB is 100 MB...",
			"date_added": 1472389826
		},
		{
			"post_id": 1472390294,
			"body": "from anon: https://www.youtube.com/watch?v=UoUEQYjYgf4",
			"date_added": 1472390125
		},
		{
			"post_id": 1472392802,
			"body": "##Audio!\nQuod Libet. Coz [here](https://en.wikipedia.org/wiki/Comparison_of_audio_player_software) (clear net) it's the last updated of free/libre and not depandant on tonns of other software",
			"date_added": 1472392632
		},
		{
			"post_id": 1472393061,
			"body": "Repost @Shellbound:\n>\"@Musickiller: You sure can and should.. as it will be more verbose than a comment here... but you simply use 'scp' and then the path depending on you want to fetch or send from client or server. Scp is part of the openssh package.\n>\n>scp -P 12345 /path/to/file user@192.168.1.10:\"/path\"\n>\n>scp -P 12345 user@192.168.1.10:\"/path/to/file\" /path/to/store/\n>\n>The utility is pretty much borderless.. you can do almost anything.\"\n\n(ZeroMe needs another button. Guess what now!) =D",
			"date_added": 1472392890
		},
		{
			"post_id": 1472393155,
			"body": "but I'm sure @nofish is working \"day and night\", so I'm not complaining. Just writing my thoughts.",
			"date_added": 1472392983
		},
		{
			"post_id": 1472393498,
			"body": "By the way, may be now when I have intalled Arch, I don't need GNURoot Debian and can look into other GNURoot?\n\nI've tried to use other options like chroot, but it seems impossible to do that with stock software (that does not support ext FS)",
			"date_added": 1472393325
		},
		{
			"post_id": 1472393638,
			"body": "look through later:\n[tiling wms](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ/1472313702)\n[sync](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ/1472329014)\n[terminals](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ/1472328192)\nby the way, terminology lags for some reason o_O\n[sailfish OS](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV/1472250516)\n\napps:\nAUR/pachist-git\nsmartmontools",
			"date_added": 1472393464
		},
		{
			"post_id": 1472394291,
			"body": "@Shellbound: my fan speeds became normal when I run wm (Gnome or i3) (or dm? may be gnome's dm is doing something?).",
			"date_added": 1472394116
		},
		{
			"post_id": 1472394492,
			"body": "@Jayofthezero · jayofthezero@zeroid.bit Reply:\n>You know, when I look at my Followed users page and see that 95% of the posts are by you, I'm starting to think you're having too much \"FUN\" \n>XD\n\nSorry. You don't have to follow me. I know I write **WAY TOO MUCH**. But writing my thoughts down helps me to process them and some of them really are interesting, so I'm sharing them here. I also with auto-deleltion was made soon, coz I don't want Red Hub to become Musickiller's Hub =(",
			"date_added": 1472394316
		},
		{
			"post_id": 1472394689,
			"body": "@Johnhamelink · johnhamelink@zeroid.bit Reply:\n> 3 days ago: I don't believe you! Hahaha. I've never got hibernation/suspension working on any linux machine so I just pretend it's impossible :D\n\nIt was not working for me on windows too. Linux shown me why. It's a DAMN Nvidia card. And Free driver was working at least somehow. The one from nvidia package just shows me a black screen.",
			"date_added": 1472394512
		},
		{
			"post_id": 1472394984,
			"body": "Me: Hi, nvidia! Your driver package seem to be corrupted. I can't extract it on my Windows x64. Can you help?\n\nNvidia Support (in 4 days): Hi, try downloading it with other software or on another system. Cheers!\n\nMe: Sorry, I could not wait for so long, and installed Arch. But lucky you! I have a problem there too! Your driver crased my newly installed OS! Can you help me now? =D\n\nN.S.: *hangs up*",
			"date_added": 1472394806
		},
		{
			"post_id": 1472400613,
			"body": "@ks https://github.com/Musickiller/kbmsgr-install-scripts\n\nI'll write a better readme later. You can experiment with the repo connection now! =D",
			"date_added": 1472400434
		},
		{
			"post_id": 1472404068,
			"body": "I don't get it... can I just run `makepkg -sric`?? instead of\n```\nmakepkg -sr\nmakepkg -i\nmakepkg -c\n```\n,as wiki proposes",
			"date_added": 1472403884
		},
		{
			"post_id": 1472405412,
			"body": "that's cute =D\nhttps://youtu.be/Aw9B7AL7Lvc\nBy the way,\nhttps://youtu.be/3TQbDz6-4eM",
			"date_added": 1472405227
		},
		{
			"post_id": 1472407060,
			"body": "808 songs (1 day, 23 hours)\n\nso it's kinda like I can just play this stuff for 2 days non-stop? o_O\n\nAnd that's only what I have on my phone.",
			"date_added": 1472406874
		},
		{
			"post_id": 1472417211,
			"body": "@ks: please describe, how did you install keybase.\n\nDid you install it with pacman or from AUR?",
			"date_added": 1472417020
		},
		{
			"post_id": 1472426302,
			"body": "GREAT! All my LTC was sold on the distributed exchange of SuperNet! ^_^",
			"date_added": 1472426110
		},
		{
			"post_id": 1472472151,
			"body": "To @Talnicrom: (and anyone else interested)\n\n##How SuperNET's distributed exchange work:\n\nCC1 = Crypto Currency 1 (the one you want to sell)\nCC2 = the one you want to get\nhttps://nxt.org/\nhttp://www.supernet.org/index.php\n\n1. You make NXT wallet and register it in SuperNET app.\n2. SuperNET app generates wallets for your SuperCurrecies.\n3. You send CC1 from your normal wallet to SuperNET's.\n4. SuperNET gives you the same amount of SuperCC1 in NXT's Asset Exchange.\n5. You sell your SuperCC1 at the exchange and get NXT.\n6. You buy SuperCC2 for NXT.\n7. The amount you bought appears in your SuperNET app.\n8. You specify a wallet to receive CC2 and SuperNET sends you CC2 there.\n\nYou can experiment by buying some LTC that I sell. I set it at the current price at non-distributed exchange, so it should be fine.\n\nSadly, SuperNET does not support NMC.\n\nQuestions?\n",
			"date_added": 1472471958
		},
		{
			"post_id": 1472472328,
			"body": "@ks NXT said \"your passphrase will be sent to the server\" when I've started forging. What server? NXT uses servers?",
			"date_added": 1472472134
		},
		{
			"post_id": 1472493337,
			"body": "Found a nice free game on Steam that works on Arch without a problem:\n\nIstrolid.",
			"date_added": 1472493142
		},
		{
			"post_id": 1472556744,
			"body": "@Talnicrom: you ZeroMeMentions needs 2 things:\n1. make posts/comments open in a new tab of the browser.\n2. (optionally) a .bit name.\n\nI can help you with 2.",
			"date_added": 1472556548
		},
		{
			"post_id": 1472557054,
			"body": "I wanted to setup a gamepad.\n**Problem solved!!!**\nhttps://wiki.archlinux.org/index.php/Gamepad\nNow I don't want to setup a gamepad! =)",
			"date_added": 1472556857
		},
		{
			"post_id": 1472557179,
			"body": "Google Tech Support:\n\ngoogle: it will be raining the whole week!\nweather: dry monday, no rain for half of tuesday\nme: google, you are a liar!!!\n*rain starts*",
			"date_added": 1472556981
		},
		{
			"post_id": 1472682159,
			"body": "@shellbound I still can't install cower for pacaur.\nsomething wrong with an unknown open key 1EB2638FF56C0C53",
			"date_added": 1472681960
		},
		{
			"post_id": 1472682350,
			"body": "I would like to repost a message by @ks.\n\n>I just had a minimal chat on IRC with Erkan Yılmaz, the guy behind all things ZeroVerse (e.g., ZeroVerse Mail and ID), and he told me that he is not using ZeroNet anymore. Around three months ago Erkan became very silent, but I hoped he had just gone to spend the summer in Turkey, or something. Instead it turns out he dropped out of ZeroNet. It's somewhat unfortunate, partly because some people were/are using his ZeroVerse ID+Mail services, partly because Erkan has squatted a lot of zero*.bit domains, and of course also because Erkan had many good intentions for ZeroNet.\n>\n>Well, we can't force people how to spend their energy, so instead of moaning the fact that Erkan has left ZeroNet, let's try to be practical. I, for one, will stop seeding all of Erkan's zites and stop using ZeroVerse Mail+ID. I suggest you guys do the same. Erkan might donate his lot of .bit domains to someone, but I'm not going to hold my breath. If he doesn't (and if he doesn't choose to renew the registration) they'll expire in about 84 days and will be up for the grabs.\n>\n>Please spread the word.\n>\n>/me hops off soapbox\n\nI agree with an idea.",
			"date_added": 1472682150
		},
		{
			"post_id": 1472682651,
			"body": "University.. No time for anything. So I've had to install Arch on my notebook, while playing Borderlands2 and some other games on my PC. Not to mention that I've also managed to eat and talk to my brotherling while I was doing that..\n\nBad news is that steam doesn't want to run there. And it's a very bad news. I will tinker with it for a bit more.\n\nLet's see, what I usually use my notebook for and how I can do that on Arch.\n\nAs a desktop enviroment I chose Gnome. No time for anything else now.",
			"date_added": 1472682450
		},
		{
			"post_id": 1472683247,
			"body": "By the way, I've got an interesting problem: a touchpad thinks that it's a touchscreen =D Very strange...\n\nAlso a problem with 2-3 games on steam that behave as if I had a joypad/joystick and pulled on it a bit all the time. Only one game offered me a choice to switch off joystick support completely and I could play normaly (Borderlands 2).\n\nAlso a picture on the screen freezes sometimes and I have to use my shamanism abilities to unfreeze it. Like hammering alt+tab. The problem occures in fullscreen. In windowed mode, the screen freezes only for a second or two, but more often.\n\nThere were other problems, but since bugs love me always, I don't try to remember everything.\n\nMy be you had some of that?",
			"date_added": 1472683045
		},
		{
			"post_id": 1472685110,
			"body": "It took me **that** long to understand that it's stupid to change RUR to USD only to change USD to LTC then. Damn... I wish I could just change RUR to NXT. **LEGALY**",
			"date_added": 1472684907
		},
		{
			"post_id": 1472686360,
			"body": "Good night, people!",
			"date_added": 1472686156
		},
		{
			"post_id": 1472686429,
			"body": "@ks I have installed Arch on my notebook, so until I install a proper version of keybase, I can forget about kbmsgr. Sorry. I hope I'll do that soon.",
			"date_added": 1472686224
		},
		{
			"post_id": 1472734560,
			"body": "shit.. can't forge nxt again. hope I can win the lottery without it.\n\nDoes anyone need Litecoin? I have some (~1 LTC now, but gonna be a bit more) at SuperNET. I keep prices quite low, but I can go even lower if you ask - I want more NXT...",
			"date_added": 1472734354
		},
		{
			"post_id": 1472734948,
			"body": "@ks your bitmessage works?",
			"date_added": 1472734741
		},
		{
			"post_id": 1472759313,
			"body": "Sorry guys, I've got a headache. Can't do stuff now. My maximum now is \"kill some psycho in borderlands and go to bed\"...",
			"date_added": 1472759105
		},
		{
			"post_id": 1472808477,
			"body": "Python as a calculator... Coz it's faster to launch.. Mama, I'ma hackssler...",
			"date_added": 1472808268
		},
		{
			"post_id": 1472854489,
			"body": "Day ~~wasted~~ __spent as a tribute to the god of computer games...__\n\nGood night, people.",
			"date_added": 1472854279
		},
		{
			"post_id": 1472989099,
			"body": "Good morning guys!\n\nWho wants to help Russian government to conquer the world? =D\n\n...\n\nJust as I thought, unanimous silent agreement!\n\nAnyway, I've got an interesting quest for you. My good friend is ~~taken by KGB~~ ~~eaten by a dragon~~ need to write an app to read, erace and write data to a secret piece of hardware (secret means no documentation) which is sort-of-a PC Card ATA 2 with a controller that supports ONLY what I've written and does it by a block of 512 bytes. It has no FS so when you plug it into Ubuntu, kernel says that it can't read first 8 sectors. More to the trouble - the piece of metal seem to not support reading/writing by more that 1 sector at a time... So there seems to be NO way to interact with it through a standart driver.\n\nThere is more info I can provide and some of it is sort of interesting. But I don't wanna spam it all here now, so please comment if you want to help / or just wanna talk.\n\nMy questions: Can standart driver (udev?) on Ubuntu/Debian be set up to read/write only by 1 sector and not to expect ANY file system?? My friend doesn't want to write a driver..\n\nMay be she just does it wrong? Anyone knows how to read/write data to a device with no filesystem? Just a stream of encoded data.",
			"date_added": 1472988888
		},
		{
			"post_id": 1473003914,
			"body": "###Pokrovskoe - Streshnevo\nhttps://yadi.sk/d/7gNv-2fzumBfF\n\n-----\n\nSometimes there are no trains when I come to Leningradskaya and I walk to Pokrovskoe - Streshnevo on foot. It's not far. But it takes me quite long to get there, since there is a lot to see, hear, smell, touch. I usually get just in time to a first train after the pause.\n\nI'm not a fotographer and HATE to edit photos. Usually I take a photo when I want to see something and can't on my own.",
			"date_added": 1473003702
		},
		{
			"post_id": 1473004839,
			"body": "###Rain\nhttps://yadi.sk/d/Puz0EqdIumDhK\n\n---\n\nI do love rain. Even though it makes me sleepy, tired, sad, birng headaches and ilnesses (one I fought for 3 weeks)... But I do love the way it looks and smells. Especially when the sky turns green and the wind tears umbrellas from hands of people.\n\nThis time I made photos because wanted to show the green sky, but automagic of the camera made it all grey. Thanks, dumbass...",
			"date_added": 1473004626
		},
		{
			"post_id": 1473005113,
			"body": "### My Hometown\nhttps://yadi.sk/d/Gj_oqUrLumEWH\n\n---\nLook at the Sun!",
			"date_added": 1473004899
		},
		{
			"post_id": 1473005619,
			"body": "### Memories (mix)\nhttps://yadi.sk/d/pqpOWx_sumFMT\n\n---\nno comment",
			"date_added": 1473005404
		},
		{
			"post_id": 1473008395,
			"body": "the funniest thing I saw in a long time =D\n\nhttp://xkcd.com/730/",
			"date_added": 1473008179
		},
		{
			"post_id": 1473009985,
			"body": "About that piece of metal:\n\nполный объем памяти\t8 000 Мбайт\nконструктив\tPCMCIA тип 2\nпротокол работы\tв соответствии со стандартом PCMCIA (спецификация PC Card ATA)\nминимальная адресуемая единица\tсектор 512 Байт (чтение, запись);\nблок 128 кБайт (стирание)\nмаксимальная скорость передачи информации по шине PCMCIA\t20 Мбайт/с\nколичество стыковок-расстыковок\tне менее 5 000\nколичество циклов перезаписи\tне менее 100 000\nтип Flash памяти\tNAND SLC\n\n---\n\nIn English (what I can):\n\nMemory: 8GB\n??: PCMCIA type 2\nProtocol: standard PCMCIA (specs of PC Card ATA)\nMinimal adderssing sector: 512 bytes (RW), 128 kBytes (erace)\nMaximum speed: 20 MB\n??\nread-write cycles (min): 100 000\ntype of Flash memory: NAND SLC",
			"date_added": 1473009768
		},
		{
			"post_id": 1473010066,
			"body": "@Shellbound: could you see [this](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ/1472989099) post? Pretty-please? =D",
			"date_added": 1473009848
		},
		{
			"post_id": 1473011018,
			"body": "https://yadi.sk/d/L4jYU412umTto\n\nIt's actually my hand, but it looks like a GREAT wallpaper! O_O",
			"date_added": 1473010799
		},
		{
			"post_id": 1473014316,
			"body": "I told you I'll make it a wallpaper?\nhttps://ipfs.pics/QmWHa9hNYN9YtsHCXEjNQasc3h6Ti8hURgbriauumaBvS7",
			"date_added": 1473014096
		},
		{
			"post_id": 1473024033,
			"body": "I thank everyone who had a word to say in [secret hardware problem](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ/1472989099). It will continue for some time, may be we'll even get somewhere.\n\nAnd certainly I'll write how the problem will be solved (if that won't be too secret))).\n\nThanks again and good night!",
			"date_added": 1473023812
		},
		{
			"post_id": 1473075614,
			"body": "@Shellbound: (about your comment) There is no point in mounting that thing at all. It has no FS. The app my friend is writing will do all write/read with a raw data.\n\n// Don't ask me what idiot decided that a file transfer device should not use any FS. I know it's stupid. But my friend answered that it's good already that the device is built arount standard interfaces, with no Russian Mumboo-Jumboo included.",
			"date_added": 1473075392
		},
		{
			"post_id": 1473369677,
			"body": "So, no one else had time to think about that \"secret russian device\" problem? We have tried to run it on a freshly downloaded Ubuntu LTS and the result was the same. Frezing terminal and errors in system log.\n\nGosh.. I wish someone told those ppl that there are USB flash sticks in early 21'st century already... As far as I understand (and ofcourse it's from not secret parts of the job she is doing, so I may be wrong) a simple USB stick could be used there instead of all this work.",
			"date_added": 1473369454
		},
		{
			"post_id": 1473796064,
			"body": "For those who wandered where I am, University started _(last year, pretty hard for a lazy ass like me)_, I'm working _(I was told that money does not grow on trees, so I'm planting money trees for sale)_, and ill _(stress, virus, unwillingness to live this stupid life, or whatever shit my body succumbed to this time...)_\n\nI really miss u ppl, but if I write any kind of blog in this mood, it's gonna be whining. Even if I write about [Arch on Android](https://github.com/meefik/linuxdeploy), good weather or anything.. it's still going to be wrote \"whining inside (c)\"\n\nSo just listen to some [good old Jazz](https://radio.yandex.ru/genre/tradjazz) and let me rest. I'm gonna be fine... sooner or later.\n\nP.S. my eyes burn and the whole body is in pain. So if you find any typos... I don't care.",
			"date_added": 1473795840
		},
		{
			"post_id": 1473955399,
			"body": "..and remember, [loosing is FUN!](http://dwarffortresswiki.org/images/4/40/FunComic.png)",
			"date_added": 1473955174
		},
		{
			"post_id": 1473959578,
			"body": "[Twinkle in Your Eye\nLouis Prima, Keely Smith, Sam Butera](https://music.yandex.ru/album/606153/track/5504736)",
			"date_added": 1473959352
		},
		{
			"post_id": 1473960102,
			"body": "There is only one problem with Jazz: you can't stop it even if there is a need to do that. Buttons on the player become like \"play\", \"play next\", \"play again\", \"play more\", \"play, baby, play!\"",
			"date_added": 1473959875
		},
		{
			"post_id": 1474145125,
			"body": "meow.",
			"date_added": 1474144897
		},
		{
			"post_id": 1474147828,
			"body": ": tried to write \"good night\" to a girl\n: could not switch keyboard layout.\n: figured how to do that and set up i3blocks to display it properly. also added volume and other stuff\n: wrote \"good night\"\n: it was past 12.\n: fuck.",
			"date_added": 1474147599
		},
		{
			"post_id": 1474147922,
			"body": "good night, by the way =)",
			"date_added": 1474147692
		},
		{
			"post_id": 1474524193,
			"body": "meow",
			"date_added": 1474523962
		},
		{
			"post_id": 1474524274,
			"body": "I think that to fix this posting problem, I should belete my ZeroMe profile and create it again.\n\n@Nofish is it possible to do that with some button, or do I need to do it manually?",
			"date_added": 1474524042
		},
		{
			"post_id": 1474540755,
			"body": "I've spent an hour of the time I needed for so many other tasks on an attempt to open my ext4 and LVM partitions on windows 10...\nExt2explore does not work.\n\nI've stopped when I've realised that I was doing that because I had porn on that partition. Why the hell don't I think BEFORE I do?\n\nBecause it's not fun, and I would never try to install Arch on Android if I would think this stupid thoughts...\n\nover and out",
			"date_added": 1474540522
		},
		{
			"post_id": 1474581509,
			"body": "good night to you all.",
			"date_added": 1474581275
		},
		{
			"post_id": 1474727485,
			"body": "I consider buying some extra small one-card PC and making it a torrent downloader and sync server. What do you think? (I mainly want to know why is this a bad idea, I can see lots of good sides here)",
			"date_added": 1474727250
		},
		{
			"post_id": 1475342537,
			"body": "I like NXT for everything besides the fact that it's written on Java. JAVA SUCK. KILL JAVA!\n\nI've pressed \"Forge\" button on my notebook and it froze with load average = 14\nNot enough memory.",
			"date_added": 1475342301
		},
		{
			"post_id": 1475493768,
			"body": "Ext and LVM for Windows!!!!!!!\n\nhttp://www.paragon-drivers.com/extfs-windows/",
			"date_added": 1475493529
		},
		{
			"post_id": 1475512390,
			"body": "Setup HP Printer in Arch (or other Linux) if there are no Free/Libre drivers:\nhttps://wiki.archlinux.org/index.php/CUPS/Printer-specific_problems#HP",
			"date_added": 1475512150
		},
		{
			"post_id": 1475528832,
			"body": "Say what you want, but `echo $RANDOM` is faster than\n```\npython\nimport random\nrandom.random() or random.randrange(...)\n```\nAt least when you just need a random number fast =D\n",
			"date_added": 1475528591
		},
		{
			"post_id": 1475531968,
			"body": "by the way, I still could not fugure out how to play video in console -_-",
			"date_added": 1475531726
		},
		{
			"post_id": 1475532013,
			"body": "And the latest news: I have made my IP static so I can ssh my PC from the internet! ^_^\n\nIt's the first time my bitmessge has more than 8 connections! (9)",
			"date_added": 1475531770
		},
		{
			"post_id": 1475532299,
			"body": "Nofish: I've solved that damn problem! I made my IP static and I don't have \"content publish faild\" anymore! Now it's \"Content published to 1 peer!\"\n\nMay be it was trying to use incoming connections?\n\n*damn... again failed.\n\nbut it was the FIRST TIME when it had published to at least one peer -_- And I can't reppeat it.\n\nSorry for spam",
			"date_added": 1475532055
		},
		{
			"post_id": 1475532673,
			"body": "I feel as if it's my 18'th birthday! Now someone can hack me over internet! ^_^ So cool and awsome!)))",
			"date_added": 1475532428
		},
		{
			"post_id": 1475532740,
			"body": "good news! I can use IPFS once again! >=D",
			"date_added": 1475532494
		},
		{
			"post_id": 1475532894,
			"body": "**NOW** I totally need C.H.I.P. or Rasberry!!! ^_^",
			"date_added": 1475532647
		},
		{
			"post_id": 1476118332,
			"body": "> Militaryriotlab · militaryriotlab@zeroid.bit ― 1 day ago\n>depends what you do with it, I own rpi zero, rpi 2 to host ownCloud and playing music, while Orange pi has SATA port and built-in storage which is faster than SD card, AFAIK\n\nReply:\n@Militaryriotlab: I need 1 for fast video stream decoding (simple web camera, up to 4 streams) and 1 for bittorrent/ZeroNet hosting. Also possibly for NXT hosting, but it's Java, so I suppose that option will rise the price a lot =(\n\nIf I have enough money, I'd also like to get 1 miniPC for a videogame server, but it's not a job for ARM processor, so I suppose that doubles the price =(\n\n\n// it's an important topic now...\n\nThe one for videostream decoding is important - In our priject we're gonna use Pi (or smth) to calculate positions of objects with several web cameras and work with them.. (OpenCV for now.) And I don't know what Raspberry (or other PCs) to select.\n\nAny ideas?",
			"date_added": 1476118084
		},
		{
			"post_id": 1476118456,
			"body": "**What's faster QT or GTK2??**\n\nI was installing doublecmd and think what version to use. Let's geek it out =D\n\n// Let's = do that if you have time. I'll have the pleasure of reading the result. Don't have time(((( ='(",
			"date_added": 1476118207
		},
		{
			"post_id": 1476125491,
			"body": "I'VE FOUND THIS:\nhttps://ipfs.pics/QmWtDpw1mYXtZWhDtA3fCULM27fBJcgut6dDAM6uMGDu79\n\ncool-retro-term\n\nIT'S FUCKING AWESOME!!  I   L O V E   I T ! ! !",
			"date_added": 1476125241
		},
		{
			"post_id": 1476133522,
			"body": "hate Brasero.... It does to my discs what Brazzers never would >.<",
			"date_added": 1476133271
		},
		{
			"post_id": 1476220188,
			"body": "I hate this day.\n\nFirst, I didn't call my sister.. At first because I thought she could be busy, then because I was busy, and then because I was at home and didn't want anyone hear me talking... Bullshit. I could call her anytime. But I didn't. Idiot.\n\nThen I've wasted 1/5 of all the money I had left. I hope that shop will return it to me. I won't give it up that easy.\n\nThen I didn't pass an exam and wasted the whole day on it.\n\nThen Arch didn't work as it should - had to delete gdm, reinstall xorg and switch to lxdm. Also I hate LXDE even more now. (even though I would not be able to write this post without it)\n\nThen I've payed for my phone twice and even though I can't say it's a total waste of money, still I need it now for other stuff.\n\nThe only good thing that happened - pacaur compiled IceCat for me and it's CRAZYFAST... Why did I never compile browsers before? Ah yes, coz it took an hour!\n\nAnd yesterday I'll waste another day, coz I could not prepare my answer for an exam question.\n\n\nFuck it... I'll go to sleep. The hell with tomorrow.",
			"date_added": 1476219936
		},
		{
			"post_id": 1476532363,
			"body": "So, we'll start with Raspberry Pi 3+, Waveshare 10 DOF, and screen 3.5' TFT\n\nLet's see where it takes us.",
			"date_added": 1476532110
		},
		{
			"post_id": 1477144943,
			"body": "as a continuation of [that post](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ/1476220188)\n\nNow I'm thinking of choosing a different dm than gdm. Gdm was easiest to install, so when I've only started with Arch, it was only logical to use it. Now, however, when I can handle a bit of stuff on my own, I can move to something else. Not like I'm dissatisfied with gdm, it worked fine. But since gnome is such a big fat thing, I start to worry that I can waste some extra MB of my precious memory on gdm.\n\nI've already switched to lxdm on my PC (coz gdm stopped working after another update) and now I think of a lighter dm for my notebook.\n\nNo time for googling and reading everything about everything, so just as usually, I just write about it here, so I could just read your advice on this topic.",
			"date_added": 1477144689
		},
		{
			"post_id": 1477145292,
			"body": "Also I've switched to netctl from networkmanager on my PC (for the same reason - it has stopped working). And it's working nice. The setup was easy, since I've used wifi-menu.\n\nP.S. Looks like I can do anything if only it takes me away from tasks I should really do.\n\nBy the way, is anyone interested to read how I try to fit WaveShare 10 DOW IMU Sensor on Raspberry? I will write an article about it in Russian anyway =D I can also add some photos =)",
			"date_added": 1477145037
		},
		{
			"post_id": 1477146259,
			"body": "I always try to write stuff in a teenager's language so that this blog would not look like an engineer's log book or something very official (which was the way I wrote when I actually was a teenager)). I think it's a good idea. Helps me to keep my mind fresh, light and creative, while when I write serious stuff, my mind is trying to emulate a computer-like thinking (efficient, but totally non-creative).\n\nBut this time, adding several extra emoji to my text, I've accidently looked a bit down and saw my mustache. And I thought: \"Damn! I'm a bearded 23 y.o. man, who's trying to write like a teenager. That should look creepy!\" Good news, I'm not fat or 43.. Or both.. Fat bearded 43 y.o. man who's trying to write as a teenager is not totally OK. Currently it should still be OK, but I feel depressed.\n\nAnd they ask me where do I find stress.. My head generates so much of it, that if I could collect those electrical impulses, I would be able to light my way to the toilet during night every day! At least with a weak luminodiode, I think... (I'm not good at biology, so it's just a guess)))\n\n/me imagining how it would look like to have a luminodiode and a capacitor plugged in my brain... not nice.",
			"date_added": 1477146003
		},
		{
			"post_id": 1477152505,
			"body": "No IPFS for me =(\n\n19:01:15.900 ERROR core/serve: Path Resolve error: Failed to get block for QmU3o9bvfenhTKhxUakbYrLDnZU7HezAVxPM6Ehjw9Xjqy: context canceled gateway_handler.go:538",
			"date_added": 1477152248
		},
		{
			"post_id": 1478454497,
			"body": "Whow.. I'm back. At least for a minute. I have 2 questions for you all:\n1) What's up? =D\n2) What do you recommend if I need to transfer an XML file (with data from sensors) from Raspberry to PC?\n\nYea, by the way, the project (now called Onyx) is accepted and if we do a great presentation (AND VERY LUCKY), may be we're gonna get some money ^_^",
			"date_added": 1478454239
		},
		{
			"post_id": 1478475406,
			"body": "Another day is lost.\n\nGood night.",
			"date_added": 1478475147
		},
		{
			"post_id": 1481660193,
			"body": "meow",
			"date_added": 1481659933
		}
	],
	"post_like": {
		"1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_3": 1470899130,
		"1PCPuVtFv8apVpXYbc46wHugNhFUVQ6KCv_6": 1470906866,
		"1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_4": 1470913684,
		"1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ_6": 1470916884,
		"12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_2": 1470916891,
		"12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_3": 1470932654,
		"1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_2": 1470999870,
		"1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_7": 1471013711,
		"1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R_8": 1471016601,
		"1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_6": 1471204677,
		"1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV_1472345808": 1472388632,
		"1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_1476019022": 1476117616,
		"12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478436568": 1478475057
	},
	"comment": [
		{
			"comment_id": 2,
			"body": "Thank U man, U R awesome =D",
			"post_uri": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_3",
			"date_added": 1470875575
		},
		{
			"comment_id": 4,
			"body": "Would not the post remain under all my new posts? You have a high chance of never finding that comment at all! (In case someone writes a post or 2 and my comment goes down in your Activity Feed)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_9",
			"date_added": 1470905551
		},
		{
			"comment_id": 5,
			"body": "And since I don't usually use ZeroNet on a reliable internet connection, you can get my reply hours after the initial posting.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_9",
			"date_added": 1470905634
		},
		{
			"comment_id": 6,
			"body": "@kaffie yup. It's exactly what I was thinking about. Just said the wrong thought =(",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_9",
			"date_added": 1470905968
		},
		{
			"comment_id": 7,
			"body": "It's like seeing a complete picture in the mind, but focusing on wrong features...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_9",
			"date_added": 1470906071
		},
		{
			"comment_id": 8,
			"body": "An \"erase old...\" button would be most welcome. //thx, 123",
			"post_uri": "1PCPuVtFv8apVpXYbc46wHugNhFUVQ6KCv_6",
			"date_added": 1470906492
		},
		{
			"comment_id": 9,
			"body": "I've heared that ZID is a reliable way of tracking.. One of reasons why ZeroVerse was made, was not it? Unless your ZID account was made with bitmessage address.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_8",
			"date_added": 1470907163
		},
		{
			"comment_id": 10,
			"body": "yea, it's cool. And I miss ReTweets again =(((",
			"post_uri": "1PCPuVtFv8apVpXYbc46wHugNhFUVQ6KCv_7",
			"date_added": 1470913456
		},
		{
			"comment_id": 11,
			"body": "Hulk repost!",
			"post_uri": "1PCPuVtFv8apVpXYbc46wHugNhFUVQ6KCv_7",
			"date_added": 1470913474
		},
		{
			"comment_id": 12,
			"body": "Cool! Features needed so far: Reposts, Reply notifications, Delete old posts button (or an automated deletion system), and image sharing.",
			"post_uri": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_4",
			"date_added": 1470913648
		},
		{
			"comment_id": 13,
			"body": "@kaffie darn.. Hawk Eye does not work when there are so many \"A followed B\" and \"A liked C\" type notifications... But I'm still glad nofish released this site =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_9",
			"date_added": 1470913931
		},
		{
			"comment_id": 14,
			"body": "GNU Root Debian does the job well for me.",
			"post_uri": "1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ_10",
			"date_added": 1470916770
		},
		{
			"comment_id": 15,
			"body": ";)",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_2",
			"date_added": 1470916821
		},
		{
			"comment_id": 17,
			"body": "Oh, that I can see xD https://ipfs.pics/QmbcH6RGHXceGYvk7se9wMF9ifUHWC33BPK6T4ArAh2bTb",
			"post_uri": "1PCPuVtFv8apVpXYbc46wHugNhFUVQ6KCv_10",
			"date_added": 1470919478
		},
		{
			"comment_id": 18,
			"body": "hey! I've found a way to send 2 messages!) Just press \"Enter\" twice",
			"post_uri": "1PCPuVtFv8apVpXYbc46wHugNhFUVQ6KCv_10",
			"date_added": 1470919600
		},
		{
			"comment_id": 19,
			"body": "May be that's caused by a lag.. My droid is pretty laggy now((",
			"post_uri": "1PCPuVtFv8apVpXYbc46wHugNhFUVQ6KCv_10",
			"date_added": 1470919766
		},
		{
			"comment_id": 20,
			"body": "Do you think unfollowing is important? I've only followed your new hub, and I can see messages from both red hub and your hub. Cool.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_12",
			"date_added": 1470986460
		},
		{
			"comment_id": 21,
			"body": "@zalex preferably with explanation. I mean, I know, what's GPG.. I just don't get how to use it... **preferably** with no administrative rights. I have them, but it's a trouble.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_18",
			"date_added": 1470999336
		},
		{
			"comment_id": 22,
			"body": "A fine way would be to have some password-protected folder that remains open for a single user after the password is typed. I wanna put bitmessage inside. A passowrd would remain inside my head, so it will be a rather reliable protection.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_18",
			"date_added": 1470999722
		},
		{
			"comment_id": 23,
			"body": "3.8 - я не пишу по-русски обычно",
			"post_uri": "1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ_11",
			"date_added": 1470999993
		},
		{
			"comment_id": 24,
			"body": "@Jayofthezero: I need to encrypt a bitmessage key.dat. I thought it would be possible to keep it safe from attacks after it was decrypted for me, but it seems that any encryption only works until I decrypt the key. Ofcourse, in that case, I'll most surely just use 7z... But it's sad. What's the point in such encryption if the most expected way of attack is from the internet?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_18",
			"date_added": 1471014030
		},
		{
			"comment_id": 25,
			"body": "@Zerro: But a keys.dat file will be stored anyway, won't it? Unecrypted! THAT's a security hole...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_18",
			"date_added": 1471016236
		},
		{
			"comment_id": 26,
			"body": "@Quadrangle: Yea, I'm already reading about VeraCrypt. Seem to be smth cool. But.. Damn!.. I still don't get wether some guy that can access my PC from the internet while I'm actively use the file (keys.dat of BM for example) will or will not be able to get access to it. =(",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_21",
			"date_added": 1471016427
		},
		{
			"comment_id": 27,
			"body": "I feel dumb...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_21",
			"date_added": 1471016437
		},
		{
			"comment_id": 28,
			"body": "I think that the user data cap makes your username length cap. You won't be able to save anything longer than your data cap, and if you want 100% of it to be your username - I don't care =D",
			"post_uri": "1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R_8",
			"date_added": 1471016728
		},
		{
			"comment_id": 29,
			"body": "There are other ways to make someone cry: just make 1000 profiles, each holding maximum allowed data. TA-DA...\n\nProblems: you'll need 1000 BM accounts that register 1000 ZID accounts... and a lot of free time =))\n\nGood news: if ZID does not have capcha, you can automate the process.. I think.",
			"post_uri": "1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R_8",
			"date_added": 1471016867
		},
		{
			"comment_id": 30,
			"body": "@ks: Well, that's the problem. I'm not worried about the death squad. I'm worried about spyware. I don't want my data to be (easily) collected and analysed.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_22",
			"date_added": 1471017608
		},
		{
			"comment_id": 31,
			"body": "2 lines is not enough. It was a useful thing to see contents of the message. 3-4 lines seem to be fine. Is there a way for me to set up this thing for myself?",
			"post_uri": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_7",
			"date_added": 1471017705
		},
		{
			"comment_id": 32,
			"body": "@ks: it would be nice, if the file could be decrypted for a single process, not user... Ah.. I'm a dreamer =(",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_21",
			"date_added": 1471017798
		},
		{
			"comment_id": 33,
			"body": "Like Windows? Ok. Can do that. But what about backdoors? They present in almost any OS. So if some agency wanna have me, they will just use that secret hole in my firewall and steal whatever they want..",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_22",
			"date_added": 1471017921
		},
		{
			"comment_id": 34,
			"body": "@Nofish: Hmm... That's really cool =D So everyone can make their own viewer? Cool))",
			"post_uri": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_7",
			"date_added": 1471021442
		},
		{
			"comment_id": 35,
			"body": "@Zerro: Flatpak... I need to read more about it.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_18",
			"date_added": 1471021654
		},
		{
			"comment_id": 36,
			"body": "@Zerro: ..and no need to wipe the drive if I ever want to sell it. Yes. But I'm speaking about encrypting a drive on an OS I've never used before...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_22",
			"date_added": 1471021731
		},
		{
			"comment_id": 37,
			"body": "I'll read Arch Wiki.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_22",
			"date_added": 1471021753
		},
		{
			"comment_id": 38,
			"body": "@Zerro: 1) no, I ment OS: I don't belive Microsoft installs no backdoors into their OS. But yes, you are right that Canonical (most surely) does not do that and software is the cause of all evil...\n\n2) What's security by comparmentalization?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_22",
			"date_added": 1471074706
		},
		{
			"comment_id": 39,
			"body": "@ImUrX: Serval Mesh is only for messaging, is it not? I'll check that thing as soon as will be able to.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_23",
			"date_added": 1471108415
		},
		{
			"comment_id": 40,
			"body": "@ImUrX: https://github.com/pirate/mesh-networking seem to be cool, but I don't see how it could solve my problem. It creates a network. But I have not seen any \"internet sharing\" features in the descryption =(",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_23",
			"date_added": 1471109412
		},
		{
			"comment_id": 41,
			"body": "Tor Tethering.... Need to research it. Seem to require rooting..",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_24",
			"date_added": 1471115002
		},
		{
			"comment_id": 42,
			"body": "@ImUrX: Time... Well.. It's a really great SDK. Some day I'll try it. Sadly, not now.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_23",
			"date_added": 1471273057
		},
		{
			"comment_id": 43,
			"body": "@megfault: thanks. No, I don't have any child porn to store it like that.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_22",
			"date_added": 1471273202
		},
		{
			"comment_id": 44,
			"body": "@megfault: My point was (and is) to answer the question \"Is it possible to be secure?\" CubesOS seem to be an answer.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_22",
			"date_added": 1471273262
		},
		{
			"comment_id": 45,
			"body": "@weakish: haha)) cool) what's LUKS? I don't think I'll need that, but just in case, it would be an interesting idea =)\n\nBut I think, that a little home-made bomb is better. Just make some if-then logic and when somebody touches your computer, it is blown to bits!) (Yea, I got this idea from Mr. Robot =D)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_21",
			"date_added": 1471273395
		},
		{
			"comment_id": 46,
			"body": "@Nofish: sorry, missed the message. don't you see? My post from an hour ago has comments from 2 days ago. Don't you think that's a bot strange?) Or the fact that comments are unrelated to the post...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_27",
			"date_added": 1471279753
		},
		{
			"comment_id": 47,
			"body": "@Zerro: ???",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_28",
			"date_added": 1471282221
		},
		{
			"comment_id": 48,
			"body": "@Nofish: I haven't done anything like that. I would mention such a thing. I have written a post and got this comments.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_27",
			"date_added": 1471282286
		},
		{
			"comment_id": 49,
			"body": "@Zerro: funny part is that the code is also signed with the same key =D\n\nBut yea... I sure could read all the code if I really wanted...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_28",
			"date_added": 1471282402
		},
		{
			"comment_id": 50,
			"body": "But my question is a bit different: how can I trust if \"just like that\"? What if it also was corrupted? Keybase solves the problem, I suppose...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_28",
			"date_added": 1471282497
		},
		{
			"comment_id": 51,
			"body": "@Mynameislegion: exactly what I wanna know, pal... Installing it now. Most surely, I won't be able to give it a good test today.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_28",
			"date_added": 1471290091
		},
		{
			"comment_id": 52,
			"body": "@Nofish: nice... I'm a bug magnet. OK. Ignore this one, and I hope none like it will ever emerge. Good night!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_27",
			"date_added": 1471290273
		},
		{
			"comment_id": 53,
			"body": "@Mynameislegion: just follow me. I'll write a post here or in my blog, when I'm ready.\n\nCurrently I could launch several preinstalled apps on several VMs. And I can say, it was good. A browser, software center, 2 terminals (all in a separate VM) + 2 default VMs were about 1.5GB RAM and 0% CPU when loaded and left alone. Supercool if to comtare to what I saw on VirtualBox.\n\nBUT all those machines were linux, 1 Ubuntu and several Fedoras, so it did not impress me much. If I could launch MacOS and Windows the same way - that would be really impressive. Would I be able to play games on it - would be super-super-cool. But I don't expect that to happen =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_28",
			"date_added": 1471302011
		},
		{
			"comment_id": 54,
			"body": "@Mynameislegion: I forgot to check about files, so I'll do exactly that now, I think. VPN I can't check, but I don't see why would it not.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_28",
			"date_added": 1471302608
		},
		{
			"comment_id": 55,
			"body": "@Mynameislegion: Ugh... I have NO idea how to share files there =( It's totally non-intuitive. Sure they did all they could to protect apps from getting anything from one VM to another, but they also did't leave a clue inside the OS on how do I do that.\n\nI'll read Qubes wiki, or some other documentation yesterday. It took me a bit more than I've expected to just see the thing with my own eyes =(\n\nBut I also reached 2 GB on memory. Just by running several file managers, terminals and software centers. Approx. 5-7 VMs total. 7, I think.\n\nSo it's not the best OS for my notebook xD On the bright side, they have combined the beauty of KDE Plasma desktop with new Nautilus from Gnome. I like the GUI very much.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_28",
			"date_added": 1471305058
		},
		{
			"comment_id": 56,
			"body": "@Astzor: But it actually feels empty: I'm used to having tonns of preinstalled apps (like Ubuntu has). After that, Qubes is like a cold desert...\n\nEDIT: a cold multidimetional desert x)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_30",
			"date_added": 1471305711
		},
		{
			"comment_id": 57,
			"body": "I don't think GTA V was a bad idea =D\n\nI mean, I spent 40 minutes figuring out how can I transfer data between VMs in Qubes OS..... While I could just Google it xD\n\nBad news: I didn't figure that out and had only 5 hours of sleep left =(",
			"post_uri": "1NZ4LvZqg61LxtRfEr5Y46KRhYCzWRnqck_3",
			"date_added": 1471328108
		},
		{
			"comment_id": 58,
			"body": "@ks: huh... At least it says that I'll \"most probably\" will get my Ardors =)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_32",
			"date_added": 1471334648
		},
		{
			"comment_id": 59,
			"body": "@ks: you got it right anyway =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_33",
			"date_added": 1471344071
		},
		{
			"comment_id": 60,
			"body": "Another option - a filter for Act. Feed.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_31",
			"date_added": 1471344232
		},
		{
			"comment_id": 61,
			"body": "By the way, if you like the idea, tell @nofish to read it. He's ignoring me again =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_31",
			"date_added": 1471344262
		},
		{
			"comment_id": 62,
			"body": "@Mynameislegion: It's awesome when you have a need of all this. If I was working on something that was important to me, I would do that in Qubes. That's for sure =)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_36",
			"date_added": 1471463255
		},
		{
			"comment_id": 63,
			"body": "@Gallium: It does what it claims to do. And that's great. I'll write more about it in my blog later.",
			"post_uri": "1NZ4LvZqg61LxtRfEr5Y46KRhYCzWRnqck_3",
			"date_added": 1471463373
		},
		{
			"comment_id": 64,
			"body": "@ImUrX: It was a provider's problem. Fixed now.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_30",
			"date_added": 1471464717
		},
		{
			"comment_id": 65,
			"body": "@Mynameislegion: I've given it a try already =D Check out my blog. Don't have much time now, but I'll add more stuff later!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_28",
			"date_added": 1471465302
		},
		{
			"comment_id": 67,
			"body": "@ImUrX: almost always...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_30",
			"date_added": 1471503047
		},
		{
			"comment_id": 68,
			"body": "As I see, many had to overcome this problem xD",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_43",
			"date_added": 1471609398
		},
		{
			"comment_id": 69,
			"body": "@Jayofthezero: What's that?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_41",
			"date_added": 1471609421
		},
		{
			"comment_id": 70,
			"body": "@Andrewm: yup. qBittorrent could not handle some site backup with OVER 9K small pics, like avatars and other crap, so I had to start using transmission. But qBT I like more and it still has my old torrents running...\n\nAnyway, they work just fine together =)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_45",
			"date_added": 1471612068
		},
		{
			"comment_id": 71,
			"body": "@Andrewm: You know, it's quite interesting that I can't read your profile, but I can read your replys o_O\n\nZeroMe is something...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_45",
			"date_added": 1471612155
		},
		{
			"comment_id": 72,
			"body": "@ks: I don't care. Whatever it takes. I just don't want to press the button with my mouse.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_50",
			"date_added": 1471633243
		},
		{
			"comment_id": 73,
			"body": "I don't belive you =P",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_49",
			"date_added": 1471633328
		},
		{
			"comment_id": 74,
			"body": "@Nofish: you should write it somewhere =D It's not an abvious thing...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_50",
			"date_added": 1471633976
		},
		{
			"comment_id": 75,
			"body": "@Dxtjgxz: tab+enter",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_50",
			"date_added": 1471642789
		},
		{
			"comment_id": 76,
			"body": "@Truth: ugh... a list:\n1) Games\n2) Games\n...\n98) Games\n99) MS Access (need for University)\n100) some other crap I currently don't remember.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_49",
			"date_added": 1471644900
		},
		{
			"comment_id": 77,
			"body": "@Truth: But when you write like that, I feel like a victim to Ubuntual harrasment. Man, I don't like Unity. I don't trust Canonical. I still use non-GNU OS (Unutnu MATE) on my notebook only because I'm a lazy ass and scared to be left without at least one fully working machine. (My PC is not feeling well now...)\n\nI said I can't stop using it. I didn't say I don't use linux as my main OS.\n\nTreat me like some stupid MS lover...\n\nNext time they gonna offer me an apple...\n\nWorld's gone crazy...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_49",
			"date_added": 1471645192
		},
		{
			"comment_id": 78,
			"body": "@Mcgoo: O_O\n\nguys...\n\nstop it.\n\nRead me before suggesting all that...\n\nI feel like I'm in a bad dream where I've never tried to install LXDE desktop in a futile attempt to free some memory for my notbook...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_49",
			"date_added": 1471645375
		},
		{
			"comment_id": 79,
			"body": "@Mynameislegion: I've liked Qubes =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_49",
			"date_added": 1471645446
		},
		{
			"comment_id": 80,
			"body": "Damn... people, you scare me. Read my blog before writing like that... Or at least ZeroME.. A guy that plans to install Ubuntu on an Android tablet can't be a windows lover...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_49",
			"date_added": 1471645516
		},
		{
			"comment_id": 81,
			"body": "@Dxtjgxz: Where's fun in that? =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_53",
			"date_added": 1471645566
		},
		{
			"comment_id": 82,
			"body": "@Nutomic: only [that one](https://www.youtube.com/watch?v=aGxIS0JWiUA)\n\nNo. My aim is to install it without android. That should be fun.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_53",
			"date_added": 1471645758
		},
		{
			"comment_id": 83,
			"body": "@Antyhrabia: Ubuntu MATE. But.. I think I'll change that sooner or later. To Parabola, may be...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_45",
			"date_added": 1471645883
		},
		{
			"comment_id": 84,
			"body": "@Antyhrabia: By the way, I've downloaded Kaffie hub the first day it was alive, but still this profile was not readable..",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_45",
			"date_added": 1471645940
		},
		{
			"comment_id": 85,
			"body": "@Jayofthezero: And why the hell I want to do that? I'm pretty paranoid about both Google AND third parties!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_41",
			"date_added": 1471646064
		},
		{
			"comment_id": 86,
			"body": "@Jayofthezero: cool idea, actually.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_41",
			"date_added": 1471676671
		},
		{
			"comment_id": 87,
			"body": "@Andrewm: I've found a Free replacement: https://f-droid.org/repository/browse/?fdfilter=task&fdid=libretasks.app",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_57",
			"date_added": 1471677073
		},
		{
			"comment_id": 88,
			"body": "@Kaffie: thank you!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_59",
			"date_added": 1471678527
		},
		{
			"comment_id": 90,
			"body": "@Nofish: didn't help.\n\nand it always sends to 2 sites.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_59",
			"date_added": 1471682375
		},
		{
			"comment_id": 91,
			"body": "@Nofish: I don't really undearstand most things that this log is saying, but no errors arise because of the publish failure.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_59",
			"date_added": 1471695639
		},
		{
			"comment_id": 92,
			"body": "closest thing to an error:\n```[2016-08-20 15:20:46,857] DEBUG    FileServer 183.63.215.55 Connect error: error: [Errno 111] Connection refused in ConnectionServer.py line 139 > Connection.py line 94 > _socket2.py line 228```",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_59",
			"date_added": 1471695738
		},
		{
			"comment_id": 93,
			"body": "@Nofish: I have deleted all of them. It appears that I had Red, Blue, and Kaffie hubs + UserDB. May be I should just redownload them?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_59",
			"date_added": 1471696290
		},
		{
			"comment_id": 96,
			"body": "@megfault: GREAT! >=D\n\nAs soon as I get my phone back, I'll try this thing.\n\nThank you very much!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_64",
			"date_added": 1471696744
		},
		{
			"comment_id": 97,
			"body": "@Nofish: nope... the problem is still there =(",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_59",
			"date_added": 1471697809
		},
		{
			"comment_id": 98,
			"body": "@Antyhrabia: Why not to use GNU when it's out there? =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_45",
			"date_added": 1471700582
		},
		{
			"comment_id": 99,
			"body": "@Jayofthezero: true",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_68",
			"date_added": 1471709799
		},
		{
			"comment_id": 100,
			"body": "@Nofish: sorry, I've typed ```code``` instead =(",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_66",
			"date_added": 1471709881
		},
		{
			"comment_id": 101,
			"body": "@Jayofthezero: =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_61",
			"date_added": 1471709949
		},
		{
			"comment_id": 102,
			"body": "@Jayofthezero: if you know Russian, you can find lot's of good things here!\nhttp://4pda.ru/forum/index.php?showtopic=597536\n\nThe thing you've been asking for is here\nhttp://4pda.ru/forum/index.php?showtopic=597536&st=280#entry37058371",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_60",
			"date_added": 1471710153
		},
		{
			"comment_id": 103,
			"body": "@Fav: Bitcoin is too fat for me. My devices need almost a week do download the blockchain. My favourites are NXT, Litecoin and Namecoin.\n\nNXT - for technology, LTC - because it's the same as BTC, but faster and lighter, and NMC - like NXT, but actually used =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_68",
			"date_added": 1471716735
		},
		{
			"comment_id": 104,
			"body": "@Icf20: I agree. But it's not like they can make a Windows or MacOS template =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_69",
			"date_added": 1471717358
		},
		{
			"comment_id": 105,
			"body": "@Nofish: I'll consider that offer, thanks.\n\nBut still.. What file do I have to keep, so that my site list remained? I won't remember all sites I had...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_72",
			"date_added": 1471718020
		},
		{
			"comment_id": 106,
			"body": "@Icf20: =D\n\na kindred spirit...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_69",
			"date_added": 1471718060
		},
		{
			"comment_id": 107,
			"body": "@Fav: btsfav on Twitter?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_74",
			"date_added": 1471719345
		},
		{
			"comment_id": 108,
			"body": "ZeroMe is fast O_O",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_74",
			"date_added": 1471719388
		},
		{
			"comment_id": 109,
			"body": "@Tkarita: yup. ZeroMedia rule =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_74",
			"date_added": 1471719652
		},
		{
			"comment_id": 110,
			"body": "@Aizen123: It had worked for me.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_8",
			"date_added": 1471720628
		},
		{
			"comment_id": 111,
			"body": "@Nutomic: it's longer than \"pass\" =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_71",
			"date_added": 1471721904
		},
		{
			"comment_id": 112,
			"body": "@ks: do you really know everything? that should be boring =D\nthanks again. I'll check it.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_77",
			"date_added": 1471722638
		},
		{
			"comment_id": 113,
			"body": "@Nofish: yea, but if there is a post with comments under it, and I delete the post, are comments deleted, or they have to be deleted separately?\n\nthx",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_75",
			"date_added": 1471728115
		},
		{
			"comment_id": 114,
			"body": "@Nofish: ...so before you implement autodeletion, old comments are going to be a problem. OK.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_75",
			"date_added": 1471736014
		},
		{
			"comment_id": 115,
			"body": "@Dergatt: I've decided to use LVM not because I have many drives (which I actually have), but because it's easier, faster and safer to work with drives on LVM.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_83",
			"date_added": 1471788975
		},
		{
			"comment_id": 116,
			"body": "@megfault: I'm getting tired of this phrase.. \"Arch wiki is amazing.\"\n\nDo they pay you every time you type it? Like some AWIA crypto currency?\n\nOr it's some hypnotoad thing? \"Everyone loves arch wiki!\"",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_83",
			"date_added": 1471789113
		},
		{
			"comment_id": 117,
			"body": "@megfault: just kidding. I know it's great. I've learned that my windows (!) won't load from GPT if I have BIOS from there.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_83",
			"date_added": 1471789162
		},
		{
			"comment_id": 118,
			"body": "@Andrewm: ???",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_71",
			"date_added": 1471803797
		},
		{
			"comment_id": 119,
			"body": "@Andrewm: ahahah))) And then I'll forget what \"p\" means)) no, thank you)\n\n\"pass\" is optimal here!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_71",
			"date_added": 1471804885
		},
		{
			"comment_id": 120,
			"body": "@Antyhrabia: so many options you provide!! Don't know what to choose =D\n\nWhy don't you partition your disk with Arch iso?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_85",
			"date_added": 1471805006
		},
		{
			"comment_id": 121,
			"body": "@Shellbound: OK, I'll have that in mind. But I'm having fun right now. Never installed a system like that. It's an interesting experience.\n\n//and in the end I will be able to say \"yo, look bro, I've installed Arch! Achievement completed!\"",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_85",
			"date_added": 1471808338
		},
		{
			"comment_id": 122,
			"body": "@ks: that's cool. really. but as I said, some people don't have a choice now...\n\nMy university requires me to study MS Access from office 2007 (which is now 9 years old?), and write programs on .Net C++ (which is just stupid).",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_87",
			"date_added": 1471808619
		},
		{
			"comment_id": 123,
			"body": "@Jayofthezero: I haven't heard that they ported .net o_O Did they???",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_87",
			"date_added": 1471808707
		},
		{
			"comment_id": 124,
			"body": "@ks: I've heard only about PowerShell. Mono doesn't **always** work.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_87",
			"date_added": 1471814174
		},
		{
			"comment_id": 125,
			"body": "@Shellbound: True Archer...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_85",
			"date_added": 1471814272
		},
		{
			"comment_id": 126,
			"body": "@Shellbound: wait-wait... did you say that your wife is using Arch????",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_85",
			"date_added": 1471814324
		},
		{
			"comment_id": 127,
			"body": "@ks: cool! This may be the end of 'em =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_87",
			"date_added": 1471815943
		},
		{
			"comment_id": 128,
			"body": "no peers",
			"post_uri": "1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV_12",
			"date_added": 1471816109
		},
		{
			"comment_id": 129,
			"body": "@Jayofthezero: it's not that, I suppose.. It's the first non-GUI OS installtion that I do, so my FUN level is OVER9K!!!!!111\n\nLvm is fine. It was my mistake to do pvcreate on an ext4 partition... I should have used gdisk to make a linux LVM partition...\n\nAnd I've spent most of this day reading manuals, so all the progress I made I've repeated in about 30 minutes. That also included wifi connection making and reading some wiki in elinks..",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_90",
			"date_added": 1471824880
		},
		{
			"comment_id": 130,
			"body": "@Shellbound: whow.. cool. thanks! so it will be like\nHOOKS=\"base udev ... block lvm2 resume filesystems\"\n??\n\nIt seem to be a stupid question after you have just wrote it, but still I would like to avoid misunderstanding here...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_93",
			"date_added": 1471865423
		},
		{
			"comment_id": 131,
			"body": "@Andrewm: thanks!!!\n\nhowever, on my Ubuntu Mate Tilda terminal that command worked fine. Should Arch developers be notified or it's not worth wasting anyone's time?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_94",
			"date_added": 1471865898
		},
		{
			"comment_id": 132,
			"body": "@ks: binary blob??\n\n*found\nhttps://ru.wikipedia.org/wiki/BLOB\n\nso what???\n\ncat should not crash terminal's font even if it's a big and beautiful cat! :3",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_94",
			"date_added": 1471865924
		},
		{
			"comment_id": 133,
			"body": "@ks: you don't get it. I understand that the file is binary, but the problem is not in it.\n\nlook at the screenshot. The font is broken, and I can reproduce the error on another terminal.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_94",
			"date_added": 1471866102
		},
		{
			"comment_id": 134,
			"body": "@ks: ok.\n\nthe strange thing is that it does not happen on tilda... wait a sec\n\nyup. it only happens outside of X. tilda and mate terminal are fine, but when I do that on a terminal that loads on ctrl+alt+f1, the font crashes just fine ^_^",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_94",
			"date_added": 1471866217
		},
		{
			"comment_id": 135,
			"body": "@Tkarita: thx. that partially explains it =D\n\nI still don't understand why tilda and mate terminal are unaffected =\\",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_94",
			"date_added": 1471866446
		},
		{
			"comment_id": 136,
			"body": "@ks: funny... I might even need this thing. thanks =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_94",
			"date_added": 1471866889
		},
		{
			"comment_id": 137,
			"body": "@ks: that's why I did it =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_96",
			"date_added": 1471870334
		},
		{
			"comment_id": 138,
			"body": "@ks: why? I ask because may be I should use it?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_99",
			"date_added": 1471876494
		},
		{
			"comment_id": 139,
			"body": "@ks: it's a default for Debian, Fedora and all OS made out of them... So I've never seen anything else =D\n\nBut when it comes to setup, both are new to me...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_99",
			"date_added": 1471879859
		},
		{
			"comment_id": 140,
			"body": "@GomZik: I'll think about that later. Not so important now. I can't even boot my OS - that's a problem.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_101",
			"date_added": 1471884186
		},
		{
			"comment_id": 141,
			"body": "@GomZik: GPT with BIOS",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_100",
			"date_added": 1471892572
		},
		{
			"comment_id": 142,
			"body": "@ks: @Shellbound: @Antyhrabia: @Talnicrom: So it's a tradition? =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_98",
			"date_added": 1471892655
		},
		{
			"comment_id": 143,
			"body": "@Shellbound: yup, that I've done, thanks =)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_100",
			"date_added": 1471893674
		},
		{
			"comment_id": 144,
			"body": "@Shellbound: still it fails to connect to lvmetad... no errors though",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_100",
			"date_added": 1471893856
		},
		{
			"comment_id": 145,
			"body": "@Shellbound: yup. added. and the post was old, so I guess you are right.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_101",
			"date_added": 1471895696
		},
		{
			"comment_id": 146,
			"body": "@Talnicrom: ^_^",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_98",
			"date_added": 1471895789
		},
		{
			"comment_id": 147,
			"body": "@Blacksquad: it's python. nothing is hardcoded =D  in emergency, you can search 15441 with a text editor and find where it is \"hardcoded\". But I think, Nofish has a better option...",
			"post_uri": "1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV_13",
			"date_added": 1471904990
		},
		{
			"comment_id": 148,
			"body": "@Mynameislegion: can't access. finds 17 peers, but does not download",
			"post_uri": "1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV_13",
			"date_added": 1471906952
		},
		{
			"comment_id": 149,
			"body": "@Shellbound: Gnome 3. Never used it before.\n\nOr you can tell me about bspwm))",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_110",
			"date_added": 1471907001
		},
		{
			"comment_id": 150,
			"body": "@Shellbound: I'll try to install both. Not sure what when.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_110",
			"date_added": 1471908721
		},
		{
			"comment_id": 151,
			"body": "@Shellbound: for a default configuration (no encryption, no lvm, /usr in not a partition) - it's 2 commands.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_112",
			"date_added": 1471908807
		},
		{
			"comment_id": 154,
			"body": "don't like videos, don't like youtube, but I'll search. May be. Or may be I'll just install and see for myself =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_110",
			"date_added": 1471910865
		},
		{
			"comment_id": 155,
			"body": "@ks: well.. I **have** python 3 and I launch the app with kbmsgr, not python3 kbmsgr...\n\nNo time now, will try when get back home",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_113",
			"date_added": 1471950520
		},
		{
			"comment_id": 158,
			"body": "@ks: by the way, this happens when I run it as python3 kbmsgr ...\n\n File \"kbmsgr\", line 23\n    kbmsgr/${MY_VERSION}\n                       ^\nSyntaxError: EOL while scanning string literal",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_113",
			"date_added": 1471951075
		},
		{
			"comment_id": 159,
			"body": "tried without and got an old error.\n\nmay be there is a dependency you forgot to mention?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_113",
			"date_added": 1471951142
		},
		{
			"comment_id": 161,
			"body": "@ks: may be they are not all executable? I'll check it.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_113",
			"date_added": 1471968348
		},
		{
			"comment_id": 162,
			"body": "@Shellbound: Thank you for all those choices. I hope I'll get enough time to check everything xD",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_110",
			"date_added": 1471968587
		},
		{
			"comment_id": 163,
			"body": "@Shellbound: I disagree. LVM adds convenience (if you manage to set it up... I was too harsh when I chose not to use it at all. Simply placing /home there would be both easy and useful.)\n\nYou don't have to use it often, but it adds much needed agility when it comes to partitioning. Plus making backups with LVM should also be easier.\n\nIt may be not needed sometimes - on a notebook, for example. But when it comes to PC, LVM seems a very nice idea. For example, I would make a raid-like volume for my data (may be 3 HDD for important things - LVM is very agile), and spread the rest of the data between 3 HDD without mirroring. And the great part is that it would be only 1 LVM partition on each LVM - and I would NEVER need to change their sizes with any parted or gdisk, I would never be afraid to loose my data - LVM promise that they handle it with care.\n\nIt is not the most important thing one could imagine - yes.. But it is a cool thing non the less.\n\nToo bad it's so hard for me to set it up on Arch and that Windows does not have native support of it (but then windows also does not support ext4...).\n\n(Sorry, too much text, to few things I actually wrote about... It's raining here.. And I can barely think.)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_108",
			"date_added": 1471969377
		},
		{
			"comment_id": 164,
			"body": "@狗蛋: =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_92",
			"date_added": 1471969457
		},
		{
			"comment_id": 165,
			"body": "@Execin: cat for internet? Ahhh. No. I meant proxy. Then I was on Live ISO and installing ZeroNet would not be the best idea =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_89",
			"date_added": 1471969563
		},
		{
			"comment_id": 166,
			"body": "@Shellbound: wow... cool.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_85",
			"date_added": 1471969775
		},
		{
			"comment_id": 167,
			"body": "@Testset: yup, but I can do that on Arch, not Parabola.\n\nThe duck? I can be a glorious pirate on windows, if I brake all spy tools it has =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_82",
			"date_added": 1471969920
		},
		{
			"comment_id": 168,
			"body": "@weakish: there is, because they will not appear! They will be a waste of space! Over time it may become a bit trouble.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_75",
			"date_added": 1471970140
		},
		{
			"comment_id": 169,
			"body": "@nofish: @weakish: The solution I see is to implement a time based autodeletion. As I see it, it should be semi-auto - a user should request it.\n\nUser A has no space left and can't post. Instead of asking @nofish (or any other admin, like @kaffie) he pushed a button \"delete...\" and he is asked to choose a date. Messages and (or) comments before that date are deleted.\n\nJust a concept, but I think it should not be very hard... Sites are linked, database is searchable (is it not?).",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_75",
			"date_added": 1471970408
		},
		{
			"comment_id": 170,
			"body": "@weakish: =\\ OK... If it won't help, I'll delete it too.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_72",
			"date_added": 1471970492
		},
		{
			"comment_id": 171,
			"body": "@Jayofthezero: I can't even install xposed =( (but I think I haven't tried hard enough)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_60",
			"date_added": 1471970583
		},
		{
			"comment_id": 172,
			"body": "@Nofish: it's easier to delete and download again, than search for logs, send last 1000 and send you. I'll do that if there is no other option. Thanks again for the offer.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_59",
			"date_added": 1471970669
		},
		{
			"comment_id": 173,
			"body": "@weakish: I dunno.. How do I know that your site won't bite?)))",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_55",
			"date_added": 1471970779
		},
		{
			"comment_id": 174,
			"body": "@Shellbound: @Nofish: the problem, as I see it, is that comments are sent by enter and posts and edits are tab, enter. From time to time anyone can make a mistake of pressing tab while writing a comment. (thus selecting a profile and opening the page.)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_50",
			"date_added": 1471971038
		},
		{
			"comment_id": 175,
			"body": "@Antyhrabia: Arch wiki says that Arch is an OS for those who *want* to tinker with the OS, and not just close their eyes. Be careful. What if some day you close your eyes like that and when you open there will be nothing but kernel panic there? o_o\n\n</scary-story>",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_45",
			"date_added": 1471971257
		},
		{
			"comment_id": 176,
			"body": "@Shellbound: what exactly does this option?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1471951382",
			"date_added": 1471971501
		},
		{
			"comment_id": 178,
			"body": "@ks: executable. OK. Git time!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_113",
			"date_added": 1471971664
		},
		{
			"comment_id": 179,
			"body": "@ks: OK. Clone, copy files to /usr/local/bin/, execute. on it.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_113",
			"date_added": 1471971840
		},
		{
			"comment_id": 180,
			"body": "@ks: The is *alpha* > This is *alpha*",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_113",
			"date_added": 1471972001
		},
		{
			"comment_id": 181,
			"body": "@ks: I mean I'm doing it. Don't be in a hurry =))",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_113",
			"date_added": 1471972020
		},
		{
			"comment_id": 182,
			"body": "duh... where do I type? xD",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_113",
			"date_added": 1471972164
		},
		{
			"comment_id": 183,
			"body": "@ks: any key I have to press? coz it get's replaced with a black/white circle",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_113",
			"date_added": 1471972271
		},
		{
			"comment_id": 195,
			"body": "@Shellbound: >Ohh.. and I have it running with 'abduco' which means I can ssh in and check it over my phone (or any device really). \n\nI can only ssh from my local network. Either my modem or my provider don't allow incoming connections. And I don't have a static IP.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1471985010",
			"date_added": 1471985968
		},
		{
			"comment_id": 196,
			"body": "@Shellbound: > ohh.. and you have 'mpv -vo drm --profile=pseudo-gui <path/to/video/>' if you want to watch videos from the TTY.\n\nnow I can watch porn on a terminal. hacked.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1471985010",
			"date_added": 1471986015
		},
		{
			"comment_id": 198,
			"body": "@Shellbound: I have tried all sorts of ports. None of my apps show incoming connections. pBittorrent uses random ports - the same effect. upnp does not help.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1471985010",
			"date_added": 1471987270
		},
		{
			"comment_id": 199,
			"body": "@Shellbound: I guess I should read arch wiki before I ask any quesions?)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1471985010",
			"date_added": 1471988618
		},
		{
			"comment_id": 200,
			"body": "@Shellbound: nmap should be there... wireshark I never could understand =(",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1471985010",
			"date_added": 1471990621
		},
		{
			"comment_id": 201,
			"body": "@Shellbound: I don't. I have the same picture with mobile networks, so I would not be surprised if that's just another stupid law in Russia...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1471985010",
			"date_added": 1472034020
		},
		{
			"comment_id": 202,
			"body": "@Shellbound: all the fun that comes with LVM =P",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_108",
			"date_added": 1472037011
		},
		{
			"comment_id": 203,
			"body": "@Shellbound: I'll read about zfs though.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_108",
			"date_added": 1472037033
		},
		{
			"comment_id": 204,
			"body": "@Shellbound: I can access all ports. But no incoming connections from any port, AFAIK.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1471985010",
			"date_added": 1472050852
		},
		{
			"comment_id": 206,
			"body": "@Antyhrabia: > +1 point to Ubuntu Mate.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472125276",
			"date_added": 1472130776
		},
		{
			"comment_id": 207,
			"body": "@ks: do you have nvidia package installed? may be nvidia-*xx ? Or nvidia-legacy?\n\nOr do you use free driver?\n\nCan you please check this out carefully?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472133459",
			"date_added": 1472134716
		},
		{
			"comment_id": 208,
			"body": "@ks: can you check your mkinitcpio.conf for all stuff you enabled for nvidia? May be any kernel options?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472133459",
			"date_added": 1472135007
		},
		{
			"comment_id": 209,
			"body": "@ks: hmm.. so you have installed nvidia parts without nvidia pachage itself? interesting. may be that would work for me..",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472133459",
			"date_added": 1472135073
		},
		{
			"comment_id": 210,
			"body": "@ks: ok... I should try your configuration then. But I think I'll use a different driver. The site says that I should use 340xx version.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472133459",
			"date_added": 1472135327
		},
		{
			"comment_id": 211,
			"body": "thanks for the info.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472133459",
			"date_added": 1472135341
		},
		{
			"comment_id": 212,
			"body": "@ks: what's that for??",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472133459",
			"date_added": 1472139869
		},
		{
			"comment_id": 213,
			"body": "@ks: I would ask \"why care about such things as numeration?\", but I know that you are an Archer... =)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472133459",
			"date_added": 1472143006
		},
		{
			"comment_id": 214,
			"body": "@ks: hm.. I should read what they are doing, may be I don't need them too. (I only have 2 CPU cores)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472133459",
			"date_added": 1472143842
		},
		{
			"comment_id": 215,
			"body": "@Shellbound: that's hot =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472132590",
			"date_added": 1472145315
		},
		{
			"comment_id": 216,
			"body": "@Shellbound: I know. It's just that I got tired. Nothing cheers me up in this situations better than \"o\" option of gdisk =D\n\nPURGE THE UNCLEAN packages!!!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472133459",
			"date_added": 1472146561
		},
		{
			"comment_id": 217,
			"body": "@Shellbound: After your hard drives start ticking, with 1.5 TB of data, you start taking precautions...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472140024",
			"date_added": 1472147777
		},
		{
			"comment_id": 219,
			"body": "@ks: by the way, nvidia-dkms - is a source code, r u sure you need that one?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472133459",
			"date_added": 1472150138
		},
		{
			"comment_id": 220,
			"body": "@ks: great! and I don't even need to configure it! xD",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472133459",
			"date_added": 1472151143
		},
		{
			"comment_id": 222,
			"body": "@Execin: the fat beast's hunger can't be satisfied, hence no sense in feeding beyond the norm.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472151813",
			"date_added": 1472155378
		},
		{
			"comment_id": 223,
			"body": "@Shellbound: May be they are not on full, but still obviously too strong.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472156415",
			"date_added": 1472158567
		},
		{
			"comment_id": 224,
			"body": "@Shellbound: aha. I was only able to install it now. Thanks!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472156092",
			"date_added": 1472159685
		},
		{
			"comment_id": 225,
			"body": "@Shellbound: I can if that's needed. But I think I remember well the sounds they can make. Plus when it's cold - it's cold. And when it's cold, fans can slow down or stop.\nHowever I'm not sure that all my fans have auto control.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472156415",
			"date_added": 1472159746
		},
		{
			"comment_id": 226,
			"body": "@ks: And procmail depends on postfix (at least in Ubuntu).\n\nfine. I'll create a couple of issues on github.. But I need to finish eating first. Barely ate anything yesterday...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472292296",
			"date_added": 1472294029
		},
		{
			"comment_id": 227,
			"body": "interesting... the why did apt-get install procmail for me? o_O\n\nI like pacman more and more every day",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472292296",
			"date_added": 1472301069
		},
		{
			"comment_id": 228,
			"body": "@ks: no. it's stupid.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472292296",
			"date_added": 1472301530
		},
		{
			"comment_id": 229,
			"body": "nice... I can delete both postfix and procmail separately.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472292296",
			"date_added": 1472301590
		},
		{
			"comment_id": 230,
			"body": "WHY ON EARTH DID YOU INSTALL POSTFIX AT ALL?!!!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472292296",
			"date_added": 1472301610
		},
		{
			"comment_id": 231,
			"body": "Can it install the package as a part of `upgrade`? can it do that while I run `install`? Coz I haven't run `upgrade` at least for a month... (no security upgrades, so why bother)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472292296",
			"date_added": 1472301697
		},
		{
			"comment_id": 232,
			"body": "@ks: I know. I try to understand, how postfix appeared in my system.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472292296",
			"date_added": 1472302186
		},
		{
			"comment_id": 233,
			"body": "@Nofish: thanks!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472125170",
			"date_added": 1472313319
		},
		{
			"comment_id": 234,
			"body": "@Jayofthezero: what's that?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472125170",
			"date_added": 1472313324
		},
		{
			"comment_id": 235,
			"body": "@ks: what's special about it? Is it working on python somehow? o_O",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472313702",
			"date_added": 1472327901
		},
		{
			"comment_id": 236,
			"body": "@ks: yup, I've installed terminator already. I'll see what's Sakura.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472328192",
			"date_added": 1472328302
		},
		{
			"comment_id": 237,
			"body": "@Erneraude: thx!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472328192",
			"date_added": 1472328640
		},
		{
			"comment_id": 238,
			"body": "@ks: syncthing does not work well on my device (sm-t531) =(\n\nno I have not seen the page. But there is a lot of apps there... I'm asking what my peers use. So that I could start with a small list now. But I'll look through that list in spare time =)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472329014",
			"date_added": 1472331846
		},
		{
			"comment_id": 239,
			"body": "@Mynameislegion: yea, yea.. that's what I use now. I thought I could find something opensource",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472329014",
			"date_added": 1472334217
		},
		{
			"comment_id": 240,
			"body": "@Mynameislegion: doesn't support android, as it seems =(",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472329014",
			"date_added": 1472334820
		},
		{
			"comment_id": 241,
			"body": "@Shellbound: ssh... cool idea. But it doesn't work with closed ports, like mine...\nUnison is supposed to have android packages, but it doesn't.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472329014",
			"date_added": 1472334864
		},
		{
			"comment_id": 242,
			"body": "@Beelzebub: tsss... don't tell no one!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472387670",
			"date_added": 1472388581
		},
		{
			"comment_id": 243,
			"body": "@Dergatt: last time I've checked it, it was very early.. Barely launhed it. And I don't remember Android app. But yes, I've liked the idea.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472329014",
			"date_added": 1472388736
		},
		{
			"comment_id": 244,
			"body": "@GomZik: good app, but suck on my droid. No SD card compatibility. May be if I install some different OS - yes, but sm-t531 seem to be too well protected.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472329014",
			"date_added": 1472388799
		},
		{
			"comment_id": 245,
			"body": "@Shellbound: I want to say \"I don't know how to transfer files with ssh\", but a week ago I could not install OS with a command line, and here I am on Arch now.. So I can google it myself, I think xD",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472329014",
			"date_added": 1472388946
		},
		{
			"comment_id": 246,
			"body": "to console people: sorry, I want to rest from consoles for now. A couple of days at least. (liar)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472329014",
			"date_added": 1472389621
		},
		{
			"comment_id": 247,
			"body": "@Mynameislegion: I already have yandex, google, microsoft and dropbox cloud services xD",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472329014",
			"date_added": 1472389677
		},
		{
			"comment_id": 249,
			"body": "@Antyhrabia: yeeeeaaaa... kind'a... xD\n May be it was I who pressed \"delete site\" button? dunno... May be.\n\nBy the way, check your clock.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472389698",
			"date_added": 1472389970
		},
		{
			"comment_id": 250,
			"body": "@Beelzebub: the new face of anonimity...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472389698",
			"date_added": 1472390037
		},
		{
			"comment_id": 251,
			"body": "@Shellbound: I ment why is there no picture support here? I could write a script that will use an instance if IPFS to upload screens. It's better. But it most surely won't work here...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472387670",
			"date_added": 1472391664
		},
		{
			"comment_id": 252,
			"body": "@Shellbound: what's scp?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472389387",
			"date_added": 1472392715
		},
		{
			"comment_id": 253,
			"body": "@Shellbound: saw the comment.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472389387",
			"date_added": 1472392788
		},
		{
			"comment_id": 254,
			"body": "@Shellbound: I don't like to give keys to my PC or phones to an app with a closed source code =( Especially when it's ssh.\n\nIt's not hard to use GNURoot for the task.\n\nMay be in the future I'll learn how to create a DHT network and write an app for myself on Python...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472329014",
			"date_added": 1472393200
		},
		{
			"comment_id": 255,
			"body": "@Shellbound: FUCK. I thought dmenu was a part if i3wm. installed now. thx",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472313702",
			"date_added": 1472393429
		},
		{
			"comment_id": 256,
			"body": "@Shellbound: yup. saw your earlier comment. I thought it was a part of i3 package, or inside i3wm",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472387559",
			"date_added": 1472393514
		},
		{
			"comment_id": 257,
			"body": "@weakish: =( that's stupid. If I want to install recommeds, I do that by hand!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472302230",
			"date_added": 1472393727
		},
		{
			"comment_id": 258,
			"body": "@Shellbound: follow symlink (while copying) means to copy contents of the file that symlinc is pointing at. (I'ma smart monkey)\n\nFat does not support symlinks, so I've tried to do `cp -L`",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472301444",
			"date_added": 1472393852
		},
		{
			"comment_id": 259,
			"body": "@ks: =\\ interesting xD",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472156092",
			"date_added": 1472394412
		},
		{
			"comment_id": 260,
			"body": "@Shellbound: I ment \"repost' button that does what I did automagicly... But yea, code in comments could be also cool))",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472393061",
			"date_added": 1472401504
		},
		{
			"comment_id": 261,
			"body": "@Shellbound: And window manager. Both Gnome and i3 slow down fans.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472394291",
			"date_added": 1472401619
		},
		{
			"comment_id": 262,
			"body": "@Nofish: sent",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472335441",
			"date_added": 1472402071
		},
		{
			"comment_id": 263,
			"body": "@Shellbound: looking at how people answer to my posts, I don't have the \"fan problem\" =D\n</joke>\nin tty. Before I've launched dm. Thinking about that, when I login/logout fans are OK, so I guess it's the display manager that's also being the fan manager =)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472394291",
			"date_added": 1472403758
		},
		{
			"comment_id": 264,
			"body": "@ks: I will. I can't get this one done:\nMake sure sudo is configured properly for commands passed to pacman.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472404068",
			"date_added": 1472404654
		},
		{
			"comment_id": 265,
			"body": "@Nofish: looking at it. 736 bytes",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472335441",
			"date_added": 1472404902
		},
		{
			"comment_id": 266,
			"body": "@ks: yes! I can run as root, myself or Usain Bolt!\n\n...but I can't run makepkg =((",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472404068",
			"date_added": 1472404971
		},
		{
			"comment_id": 267,
			"body": "@Nofish: ok. does it have any info I'd like to keep secret?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472335441",
			"date_added": 1472405630
		},
		{
			"comment_id": 268,
			"body": "@ks: wiki says not to do that. (But I've tried, and terminal said not to do that ever again)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472404068",
			"date_added": 1472405987
		},
		{
			"comment_id": 269,
			"body": "@Nofish: OK, I'll just pack it. teargas",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472335441",
			"date_added": 1472406341
		},
		{
			"comment_id": 270,
			"body": "[mk@mkpcarch yaourt]$ makepkg -s         \n==> Making package: yaourt 1.8.1-1 (Sun Aug 28 20:57:21 MSK 2016)\n==> Checking runtime dependencies...\n==> Installing missing dependencies...\n[sudo] password for mk: \nerror: target not found: package-query>=1.8\n==> ERROR: 'pacman' failed to install missing dependencies.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472404068",
			"date_added": 1472406748
		},
		{
			"comment_id": 273,
			"body": "@Tkarita: no, thanks.. I'm a xenofobic, when it comes to music. To find new music is a big deal for me.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472407060",
			"date_added": 1472407836
		},
		{
			"comment_id": 274,
			"body": "@Shellbound: doesn't work for me. freezes sometimes.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472328192",
			"date_added": 1472408154
		},
		{
			"comment_id": 275,
			"body": "@Nofish: do I have to stop my existing zeronet instance?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472335441",
			"date_added": 1472408650
		},
		{
			"comment_id": 276,
			"body": "@Nofish: ok. I'll try that",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472335441",
			"date_added": 1472409793
		},
		{
			"comment_id": 278,
			"body": "@Nofish: didn't help when I stop.\n\nand desn't help when running.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472335441",
			"date_added": 1472410481
		},
		{
			"comment_id": 279,
			"body": "@ks: that's not interesting! =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472404068",
			"date_added": 1472412742
		},
		{
			"comment_id": 280,
			"body": "@ks: ah! now I see what's the problem. package-query is from AUR and it's trying to get it from pacman...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472404068",
			"date_added": 1472412889
		},
		{
			"comment_id": 281,
			"body": "@Shellbound: thanks, pacaur it is.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472404068",
			"date_added": 1472413709
		},
		{
			"comment_id": 282,
			"body": "@Shellbound: I have ~/git/AUR/${packagename}",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472404068",
			"date_added": 1472414446
		},
		{
			"comment_id": 283,
			"body": "@ks: wait.. I could just download keybase from AUR and use makepkg to install it??? ugh.. so much time wasted. (is it still in AUR too?)\n\nI mean that it's in official repo too.\n\nHow did you install it?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472404068",
			"date_added": 1472414541
		},
		{
			"comment_id": 284,
			"body": "@Shellbound: ugh.. why use pacman if I can do `makepkg -sric`?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472404068",
			"date_added": 1472414572
		},
		{
			"comment_id": 285,
			"body": "@Shellbound: thx\nand headers. right.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472404068",
			"date_added": 1472417159
		},
		{
			"comment_id": 286,
			"body": "@Shellbound: dpkg. mainly for nvidia.\n\nwhat's zen?\n\nI could not find any info on it. is it only different because it's using BFQ?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472404068",
			"date_added": 1472426006
		},
		{
			"comment_id": 287,
			"body": "#**AWESOME!!!!**",
			"post_uri": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_1472462658",
			"date_added": 1472469155
		},
		{
			"comment_id": 288,
			"body": "@Talnicrom: It takes your BTC/LTC... etc.. and gives you exactly that ammount of SuperBTC/SuperLTC... in NXT's asset exchange. Then you sell it for NXT. And then buy other Super[currency] with NXT.\n\nAfter that you can withdraw your new [currency] from your SuperNet.\n\nMuch easier than it sounds. Coz I've just woke up >.<\n\nwait. I'll refine this shit look for a post about it.\n",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472426302",
			"date_added": 1472469441
		},
		{
			"comment_id": 289,
			"body": "@ks: How do I delete it afterwards?\nCan I install any debian package like that? Only debian?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472417211",
			"date_added": 1472469554
		},
		{
			"comment_id": 290,
			"body": "@Shellbound: DKMS. sorry. I was very sleepy then. I need headers for DKMS and DKMS to put nvidia module into my kernel.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472404068",
			"date_added": 1472469734
		},
		{
			"comment_id": 291,
			"body": "@Antyhrabia: sorry, what?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472393638",
			"date_added": 1472469894
		},
		{
			"comment_id": 292,
			"body": "@Antyhrabia: no, no, it's my fault. I;ve pressed \"delete site\" button. And the key was deleted with it.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472389698",
			"date_added": 1472469958
		},
		{
			"comment_id": 293,
			"body": "@Wakelain: their soft for droids is crap. Can't deal with my sm-t531 SD card",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472329014",
			"date_added": 1472470056
		},
		{
			"comment_id": 294,
			"body": "@ks: how have you installed it?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472417211",
			"date_added": 1472472017
		},
		{
			"comment_id": 295,
			"body": "But I have downloaded all blocks! But I have updated NXT and saved only nxt_db folder. May be I've made some mistake there and it can't access db now? How do you update NXT?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472472328",
			"date_added": 1472473670
		},
		{
			"comment_id": 296,
			"body": "@ks: why?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472417211",
			"date_added": 1472473684
		},
		{
			"comment_id": 297,
			"body": "@ks: I understand =)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472417211",
			"date_added": 1472482690
		},
		{
			"comment_id": 298,
			"body": "@ks: It's suddenly OK now. But I have sent my passphrase to 2 random servers.. That I don't like. May be I should create a new account? (Will take time to get 1440 confirmations + I will loose ~10 NXT on transactions....)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472472328",
			"date_added": 1472483570
		},
		{
			"comment_id": 299,
			"body": "@Shellbound: agree =)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472328192",
			"date_added": 1472493197
		},
		{
			"comment_id": 300,
			"body": "@Shellbound: Nice. But I didn't know about the game at all. I just happened to find it on Steam. And it's fine that it's installed. That way I know where all the data is. And when you play through browser, data is stored \"somewhere in cache\".",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472493337",
			"date_added": 1472554742
		},
		{
			"comment_id": 301,
			"body": "@Shellbound: can you explain why is that lazy and not recommended? I don't have neither pacaur (coz one of sigs was wrong and pacman told me to duck off), nor pachist (never heared of it)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472417211",
			"date_added": 1472554930
		},
		{
			"comment_id": 302,
			"body": "@ks: I agree. That way you can't update it noramaly.\n\n@Shellbound: However I thought of writing a script that is saving output of cp to remember what files are copied from the package, and a script that can delete those files afterwards.\n\nBut I don't want to write *any* code now.. University is near and I want to play some Toribash today.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472417211",
			"date_added": 1472555107
		},
		{
			"comment_id": 303,
			"body": "@Shellbound: You've said you use a package from pacman? Does KBFS work for you?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472417211",
			"date_added": 1472555130
		},
		{
			"comment_id": 304,
			"body": "@Talnicrom: Never heared of \"atomic transfers\". As I see it, a couple of NXT is a very low comission. And I trust SuperNET.\n\nPlus it's more or less secure - all transfers are distributed (NXT) and all coin storages are decentralized and distributed, so even if something goes wrong with SuperNET servers, no damage will be done. All SuperCoins will be awailable as soon as they get server back online.\n\n...or at least that's much safer than anything else I saw. Personally, I would prefer if there were several main servers with distributed database, plus some cryptographical checks that servers are legit, but you won't find that features on any other exchange, so it's OK.\n\nPlus nowdays I just buy NXT, not selling it. And SuperNET seem to be the best way to do that.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472472151",
			"date_added": 1472555581
		},
		{
			"comment_id": 305,
			"body": "@weakish: good one.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472426302",
			"date_added": 1472555643
		},
		{
			"comment_id": 306,
			"body": "@weakish: duh.. I have Nvidia. And buying a videocard is too much for me.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472394689",
			"date_added": 1472555705
		},
		{
			"comment_id": 307,
			"body": "@weakish: how?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472389698",
			"date_added": 1472555739
		},
		{
			"comment_id": 308,
			"body": "@weakish: ah, those.. they suck. I need to play games and watch video sometimes.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472394689",
			"date_added": 1472555973
		},
		{
			"comment_id": 309,
			"body": "@weakish: has anyone done that?? I mean, if that would be possible would I not be able to make a site with a name \"1SiteOfMusickiller\" the same way?\n\nahh.. it's using \"address_index\".. ok.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472389698",
			"date_added": 1472559616
		},
		{
			"comment_id": 310,
			"body": "@Shellbound: yea. gotta do that sooner or later. Was just asking in case someone had the same stuff.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472683247",
			"date_added": 1472685046
		},
		{
			"comment_id": 311,
			"body": "@Shellbound: both -native and -libs are \"not found\". I had to get multilib to install Steam.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472682651",
			"date_added": 1472685160
		},
		{
			"comment_id": 312,
			"body": "@Shellbound: why not the official? It's the first package I see with a 3-rd party key =\\",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472682159",
			"date_added": 1472685244
		},
		{
			"comment_id": 313,
			"body": "@Erneraude: dirvers for touchpad? My God... Never had to do that o_O\nI hope I'll never have to write an email to a manufacturer of PC keyboards with an explanation of that my version of linux is so cool that it doesn't even come with keyboard driver!..\nI mean.. Come on! It's a touchpad! Every notebook has it!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472683247",
			"date_added": 1472685977
		},
		{
			"comment_id": 314,
			"body": "@Erneraude: thanks by the way.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472683247",
			"date_added": 1472686115
		},
		{
			"comment_id": 315,
			"body": "@ks: right. I'm on it. Busy now.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472686429",
			"date_added": 1472733766
		},
		{
			"comment_id": 316,
			"body": "@Shellbound: the duck knows... I have an ASUS notebook. that's all I know now.\n\nI'll work on that later. I'm quite tired now =(",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472683247",
			"date_added": 1472733867
		},
		{
			"comment_id": 317,
			"body": "@Shellbound: damn... I do need to solve that key problem..",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472682651",
			"date_added": 1472733897
		},
		{
			"comment_id": 318,
			"body": "@Shellbound: fine I do trust them, if you do, but I still need to find their key... A bit later may be.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472682159",
			"date_added": 1472733997
		},
		{
			"comment_id": 319,
			"body": "@Zerro: BTC is too hard to buy in low ammounts. I don't usually change more than a dollar and most echanges don't allow to change small sums of BTC. So it's LTC for me. I don't really see the big difference. LTC is also accepted in many places. Quite universal.\n\nNXT I just like as a platform and want to support it.\n\nWhat's ETC? Never heared of it!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472734560",
			"date_added": 1472759052
		},
		{
			"comment_id": 320,
			"body": "@Zerro: plus LTC is a bit faster. A reason to use it as good as any. Plus I don't think that RAM usage is a bad idea.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472734560",
			"date_added": 1472759207
		},
		{
			"comment_id": 321,
			"body": "@Shellbound: K501J, but relax man. I can read wiki myself =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472683247",
			"date_added": 1472807998
		},
		{
			"comment_id": 322,
			"body": "@Shellbound: which post? Use [this](http://127.0.0.1:43110/1JouSggdhsEZ9tWN5oiQArjdAA8wkCcxuR/) (ZNet). It helps. But it does not show everything, I think...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472417211",
			"date_added": 1472808084
		},
		{
			"comment_id": 323,
			"body": "@Shellbound: I always try to live without tablets... Not including vitamins.\n\nBut yea, I always drink a quite lot of water.. Since my head almost always aches =D High internal pressure, too narrow blood vessels, weather sensetive... You name it.\n\nTechnicly (and especially if you count pgoblems with my eyes, spine and chest), I should not use the computer at all. But, damn, it's the only thing I do understand at least a bit in this world....",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472759313",
			"date_added": 1472854180
		},
		{
			"comment_id": 324,
			"body": "It's fine. I don't like thins kind of music much, so I've only watched first 2 minutes. But I think the clip is fine. Quality is good.",
			"post_uri": "1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ_1472843816",
			"date_added": 1472854703
		},
		{
			"comment_id": 325,
			"body": "@Shellbound: on that page, you can click a mention to get to the post it is in. It's not obvious, so I've decided to write. Also, it's more comfortable to click with a right mouse and select to open in a separate tab. Middle mouse click and ctral+click are not working.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472417211",
			"date_added": 1472918729
		},
		{
			"comment_id": 326,
			"body": "@weakish: no",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472854489",
			"date_added": 1472985458
		},
		{
			"comment_id": 327,
			"body": "@Zerro: no",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472854489",
			"date_added": 1472985462
		},
		{
			"comment_id": 328,
			"body": "@Shellbound: \"Pain is in your head\"\n-- Sergeant Zim (Starship Troopers)\nor\n\"PAIN IZ EVERITHINGH!!!!\"\n-- Psycho (Borderlands 2)\n\nEither way, I can manage it. And I always have some pill my friend gave me, in case it grows too heavy. So as long as I'm scared enough to use that pill, I don't need pills. When the time comes when I say \"I don't care what's that.\" it means the time came to use it.\n\nHowever, don't worry it's just a painkiller. Not restricted or anything. It's only the fact that I did not ask that's holding me.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472759313",
			"date_added": 1472985874
		},
		{
			"comment_id": 329,
			"body": "@Shellbound: a great idea, actually! I'll do it right away =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472808477",
			"date_added": 1472986140
		},
		{
			"comment_id": 330,
			"body": "more to that: she was able to use standard driver's commands to do that on Windows, so it's possible.\n\nBoth windows and Ubuntu think it's a hard disk. Windows wants to format it (just cancel it and it's fine) and Ubuntu thinks it's **2** hard drives and tries to read first 8 sectors after which it throws timeouts and repeats the procedure every 20 seconds.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472989099",
			"date_added": 1472989133
		},
		{
			"comment_id": 331,
			"body": "A log: https://yadi.sk/i/ib5b9DCpukn4r",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472989099",
			"date_added": 1472990340
		},
		{
			"comment_id": 332,
			"body": "@ks: To transfer data between 2 computer systems. It has a name, but I doubt VERY much that it will be in google. And I'm not allowed to give it's name anyway.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472989099",
			"date_added": 1472995815
		},
		{
			"comment_id": 333,
			"body": "@Tkarita: ugh... I'll ask that. She's probably gonna try it tomorrow and then answer.\nTuesday. She's gonna try it on Tuesday. Had a horse trouble.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472989099",
			"date_added": 1472996027
		},
		{
			"comment_id": 334,
			"body": "By the way, it's a flash memory, not HDD. @Tkarita: @ks: ",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472989099",
			"date_added": 1472998540
		},
		{
			"comment_id": 335,
			"body": "@Tkarita: what's \"wrong multiple sector mode\"? Google does not help.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472989099",
			"date_added": 1472999459
		},
		{
			"comment_id": 336,
			"body": "@Tkarita: My friend says that in Windows she only could read and write by a single sector (that is 512B). When she attempted to write multiple sectors the effect was almost the same as it is on Linux (see log -> timeouts).\n\nThat is why I have asked \"how does one read/write a single sector of data in linux?\"\n\nAlso it's strange that linux thinks that it's 2 devices (sdb and sdc).",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472989099",
			"date_added": 1473001592
		},
		{
			"comment_id": 337,
			"body": "@Tkarita: I'm not sure there is any point in that. There is currently no data inside. The task is to read and write stuff there.\n\nWhat would imaging an empty device achieve? Plus the problem is that linux did not want to work with it at all!\n\nHowever, I'm not sure she tried something as simple as dd bs=512 =)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472989099",
			"date_added": 1473005680
		},
		{
			"comment_id": 338,
			"body": "@Tkarita: awww.. she's tried `dd bs=512` to write on it. The terminal freezes. That also happens whenever she's trying to read/write it with any app.\n\n---\n\nThat's why I wrote about driver.\n\n---\n\nBut I have asked her to try to make an image. Just to see what happens.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472989099",
			"date_added": 1473006025
		},
		{
			"comment_id": 339,
			"body": "@ks: right!)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472808477",
			"date_added": 1473007735
		},
		{
			"comment_id": 340,
			"body": "https://yadi.sk/d/L4jYU412umTto\n(the same link)\nEverybody, lick my fingers! ^_^\n\n// I wanted to write \"like\".. But I could not.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1473011018",
			"date_added": 1473013661
		},
		{
			"comment_id": 341,
			"body": "@Icf20: yup",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1473014316",
			"date_added": 1473016003
		},
		{
			"comment_id": 342,
			"body": "@ks: that's what I thought xD",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1473014316",
			"date_added": 1473016016
		},
		{
			"comment_id": 343,
			"body": "@Shellbound: ^_^",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1473010066",
			"date_added": 1473023449
		},
		{
			"comment_id": 344,
			"body": "@Shellbound: thanks",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1473009985",
			"date_added": 1473023466
		},
		{
			"comment_id": 345,
			"body": "thanks everyone.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1472989099",
			"date_added": 1473023535
		},
		{
			"comment_id": 346,
			"body": "@Shellbound: I don't see however, how a recovery can help... But I'll look into another article.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1473009985",
			"date_added": 1473075099
		},
		{
			"comment_id": 347,
			"body": "@Shellbound: it's not old. and it was tested on windows.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1473369677",
			"date_added": 1473794740
		},
		{
			"comment_id": 348,
			"body": "@Jayofthezero: yea... [df](http://dwarffortresswiki.org/images/4/40/FunComic.png) style.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1473796064",
			"date_added": 1473955149
		},
		{
			"comment_id": 349,
			"body": "@Dergatt: not much this days.. don't have enough time too.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1473955399",
			"date_added": 1474144876
		},
		{
			"comment_id": 350,
			"body": "good news: she did not wake up and I have a keyboard layout indication. victory, the way I see it.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1474147828",
			"date_added": 1474147663
		},
		{
			"comment_id": 351,
			"body": "@Shellbound: not good enough. But it works better than Gnome for my videocard. I have a very interesting problem: fullscreen games freeze from time to time. On i3 I can make them windowed with the same screen resolution and i3 make them look just like fullscreen.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1474147828",
			"date_added": 1474524249
		},
		{
			"comment_id": 352,
			"body": "meow like a heartbeat",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1474524193",
			"date_added": 1474524425
		},
		{
			"comment_id": 353,
			"body": "@Durand: \"Content publish failed\" every time I publish...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1474524274",
			"date_added": 1474538695
		},
		{
			"comment_id": 354,
			"body": "@Antyhrabia: tell @nofish, let's spam him xD",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1474524274",
			"date_added": 1474539667
		},
		{
			"comment_id": 355,
			"body": "@Shellbound: too much tinkering needed and I don't have time for that now.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1474147828",
			"date_added": 1474581160
		},
		{
			"comment_id": 356,
			"body": "gems?\n\nanyway, you can find some jazz here: https://radio.yandex.ru/genre/tradjazz",
			"post_uri": "1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV_1474671360",
			"date_added": 1474726773
		},
		{
			"comment_id": 357,
			"body": "@Mynameislegion: thanks. It won't happen very soon anyway.. I don't have much money.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1474727485",
			"date_added": 1474740100
		},
		{
			"comment_id": 358,
			"body": "@Mynameislegion: Are there any \"open\" analogs of rasberry? Or may be cheaper analogs? Something from china?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1474727485",
			"date_added": 1474740204
		},
		{
			"comment_id": 359,
			"body": "@Mynameislegion: for zeronet, the best idea seems to be \"to buy a super cheap and super small PC with 3G and Wi-Fi and use it as a portable server. However, I'm not sure it's possible to make this thing cheap =( Even with a slowest processor and smallest memory, there are still 3G and Wi-Fi chips, battery, case (best if at least a bit waterproof) etc...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1474727485",
			"date_added": 1474741095
		},
		{
			"comment_id": 360,
			"body": "@PaintNinja: so it's something like ZBOX? They still have active coolers. Means more power requirements and noise.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1474727485",
			"date_added": 1475342263
		},
		{
			"comment_id": 362,
			"body": "@Unanimous: cool =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1475532894",
			"date_added": 1475866931
		},
		{
			"comment_id": 363,
			"body": "@Sylex: just like in the blog. Read Markdown in Wikipedia or somewhere for more info if you don't have a blog.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1475528832",
			"date_added": 1475867098
		},
		{
			"comment_id": 364,
			"body": "@Planteater: no money now though... at all",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1474727485",
			"date_added": 1475867190
		},
		{
			"comment_id": 365,
			"body": "I've accidently registered ya.ru some time ago, it's almost over now, and I plan to let it go. So you're not the first =D",
			"post_uri": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_1475661545",
			"date_added": 1475867486
		},
		{
			"comment_id": 366,
			"body": "@Openuser: yes, it does =D\nhttp://www.jaguarboard.org/index.php/products/buy/jaguarboard.html",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1475532894",
			"date_added": 1475867863
		},
		{
			"comment_id": 367,
			"body": "@Nofish: why so cheap?? thanks for the link, too bad the sale is over =)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1474727485",
			"date_added": 1475868036
		},
		{
			"comment_id": 368,
			"body": "yup, tell me what you find out about them",
			"post_uri": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_1476019022",
			"date_added": 1476117656
		},
		{
			"comment_id": 369,
			"body": "@Militaryriotlab: I need 1 for fast video stream decoding (simple web camera, up to 4 streams) and 1 for bittorrent/ZeroNet hosting. Also possibly for NXT hosting, but it's Java, so I suppose that option will rise the price a lot =(\n\nIf I have enough money, I'd also like to get 1 miniPC for a videogame server, but it's not a job for ARM processor, so I suppose that doubles the price =(",
			"post_uri": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_1476019022",
			"date_added": 1476117861
		},
		{
			"comment_id": 370,
			"body": "sadly no one wants to chat about QT and GTK2 differences =(",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476118456",
			"date_added": 1476122911
		},
		{
			"comment_id": 371,
			"body": "@Militaryriotlab: my teacher/friend/mentor/boss is considering using parallel processor system with infrared cameras (since we want to track humans as a result of our work)... May be that's a better idea, but I don't have any idea on how to work with that stuf X((((",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476118332",
			"date_added": 1476123127
		},
		{
			"comment_id": 372,
			"body": "@Militaryriotlab: thanks",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476118332",
			"date_added": 1476123137
		},
		{
			"comment_id": 373,
			"body": "@Militaryriotlab: ugh... Don't worry. If I will be allowed, project sponsored, and we do the thing, I'll BLOW this ZeroMe page with results XD",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476118332",
			"date_added": 1476125146
		},
		{
			"comment_id": 374,
			"body": "@ulrichard: thanks for a reply =D I've heared that QT is a headache...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476118456",
			"date_added": 1476125188
		},
		{
			"comment_id": 375,
			"body": "@Antyhrabia: And why LXQT?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476220188",
			"date_added": 1476527666
		},
		{
			"comment_id": 376,
			"body": "@Antyhrabia: ok, [it looks better](http://lxqt.org/), but what else?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476220188",
			"date_added": 1476527793
		},
		{
			"comment_id": 377,
			"body": "@weakish: I don't have a hi-res screen, so GTK2 it is then =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476118456",
			"date_added": 1476531416
		},
		{
			"comment_id": 378,
			"body": "@Zerro: why is that?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476118456",
			"date_added": 1476531421
		},
		{
			"comment_id": 379,
			"body": "@Shellbound: Just a little bit too late xD\n\n> И вот у нас есть Raspberry Pi 3+, платка Waveshare 10 DOF (БИНС про запас), и экран 3.5' TFT",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476118332",
			"date_added": 1476531886
		},
		{
			"comment_id": 380,
			"body": "@Shellbound: are you sure you've commented in a right place?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476532363",
			"date_added": 1477143288
		},
		{
			"comment_id": 381,
			"body": "@Antyhrabia: sorry. That was a bit faster to type than \"Because it was the only thing I have tried and did not vomit (like with XFCE). What are the benefits of LXQT?\"\nNot intended to be rude.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476220188",
			"date_added": 1477143553
		},
		{
			"comment_id": 382,
			"body": "@Shellbound: \n> I don't really like any display manager though. \nWhat does that mean? =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476220188",
			"date_added": 1477143976
		},
		{
			"comment_id": 383,
			"body": "@Shellbound: @Antyhrabia: I find i3wm both sufficiently fast, light, easy to master and nice (I am tired of bulky window headers of gnome3...)\n\nHowever, for some reason, only gnome3 allows me to launch minecraft on my notebook. And since it's the favorite game of my lil'brother, I can't just remove gnome =(",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476220188",
			"date_added": 1477144263
		},
		{
			"comment_id": 384,
			"body": "@Flyman: an elephant? Your thought process is confusing.\n\nEDIT: Ah, the light from eyes! Funny =)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1477146259",
			"date_added": 1477149100
		},
		{
			"comment_id": 385,
			"body": "@ks: ..and has several warnings on the page you linked. no, thanks =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1477144943",
			"date_added": 1477152292
		},
		{
			"comment_id": 386,
			"body": "@ks: sure =)\nand what about security updates?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1477144943",
			"date_added": 1477156710
		},
		{
			"comment_id": 387,
			"body": "@ks: brave and honorable Klaus will defend his computer from dangers near and far! =)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1477144943",
			"date_added": 1477162431
		},
		{
			"comment_id": 388,
			"body": "@ks: everything is. Everything is internet nowdays.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1477144943",
			"date_added": 1477162767
		},
		{
			"comment_id": 389,
			"body": "@ks: thanks!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1478454497",
			"date_added": 1478474323
		},
		{
			"comment_id": 390,
			"body": "@ulrichard: ugh... that's a bit too untraditional, I guess... ZeroNet - maybe (I'll even mention this idea), but certainly not IPFS - too slow (and I only count time needed to make that dag thing..)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1478454497",
			"date_added": 1478474495
		},
		{
			"comment_id": 391,
			"body": "@ks: scp... what about rsync? is there a difference? =D",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1478454497",
			"date_added": 1478474751
		},
		{
			"comment_id": 392,
			"body": "@Eibriel: well.. not a bad idea.. but the last time I tried that app, it crashed everything it could..",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1478454497",
			"date_added": 1478536459
		},
		{
			"comment_id": 393,
			"body": "@Shellbound: ugh.. sorry for not answering.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476220188",
			"date_added": 1478536530
		},
		{
			"comment_id": 394,
			"body": "Actually I think now that if we make it work with ZeroNet, it can send parts of a file, and that way it would be possible to append new data to an old file, without creating a new file every time data should be sent.\n\nCurrently, we have decided to create a new file for each part of data. Which means sending new file every few seconds (or second). As you can see, web server/ZeroNet is more interesting anyway.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1478454497",
			"date_added": 1478553045
		},
		{
			"comment_id": 395,
			"body": "@Eibriel: It's not a problem. First, we can encrypt the file. Then more people = better. Second, it's not a secret project, just a presentation (of a non-secret project =D)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1478454497",
			"date_added": 1478561754
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx",
			"user_name": "ks",
			"date_added": 1470874357
		},
		{
			"follow_id": 2,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1470874414
		},
		{
			"follow_id": 3,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1470874426
		},
		{
			"follow_id": 4,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1CTut2qbaj54ZjNoYeuWSGwV75iVieKY6N",
			"user_name": "Quadrangle",
			"date_added": 1470874707
		},
		{
			"follow_id": 5,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1PCPuVtFv8apVpXYbc46wHugNhFUVQ6KCv",
			"user_name": "Newuser123",
			"date_added": 1470906330
		},
		{
			"follow_id": 6,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu",
			"user_name": "PaintNinja",
			"date_added": 1470916834
		},
		{
			"follow_id": 7,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1470986269
		},
		{
			"follow_id": 8,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS",
			"user_name": "ZAlex",
			"date_added": 1470999854
		},
		{
			"follow_id": 9,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ",
			"user_name": "GomZik",
			"date_added": 1471000512
		},
		{
			"follow_id": 11,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo",
			"user_name": "ImUrX",
			"date_added": 1471109434
		},
		{
			"follow_id": 12,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ",
			"user_name": "Musickiller",
			"date_added": 1471109519
		},
		{
			"follow_id": 13,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1MEaxKqZWGEqFH62TRNEEZuNh8iX4nnq5f",
			"user_name": "Kaffie",
			"date_added": 1471115053
		},
		{
			"follow_id": 14,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV",
			"user_name": "Mynameislegion",
			"date_added": 1471301964
		},
		{
			"follow_id": 15,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1NZ4LvZqg61LxtRfEr5Y46KRhYCzWRnqck",
			"user_name": "Gallium",
			"date_added": 1471328286
		},
		{
			"follow_id": 16,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1E59fpQH7EGuFwknQMd5VJKb5Zt68Jd1Jt",
			"user_name": "Bsl",
			"date_added": 1471465677
		},
		{
			"follow_id": 17,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "16ayEL9rXHKdbhoFu1LUanUaPVrzRVe331",
			"user_name": "Andrewm",
			"date_added": 1471677208
		},
		{
			"follow_id": 18,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1EErpRfR94YZwEMpAwsGKYsgSqHuRxvWib",
			"user_name": "megfault",
			"date_added": 1471696751
		},
		{
			"follow_id": 20,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "16nArdxrSaNThNp83kL8E6NLL9WD98iUne",
			"user_name": "Jayofthezero",
			"date_added": 1471709935
		},
		{
			"follow_id": 23,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9",
			"user_name": "Shellbound",
			"date_added": 1471907146
		},
		{
			"follow_id": 24,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1Ab7t6js2jJS3edzqo5jpcEerJJBPFGtH4",
			"user_name": "Another",
			"date_added": 1472125788
		},
		{
			"follow_id": 25,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR",
			"user_name": "weakish",
			"date_added": 1472555997
		},
		{
			"follow_id": 26,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa",
			"user_name": "Talnicrom",
			"date_added": 1472556431
		}
	]
}