{
	"next_post_id": 17,
	"next_comment_id": 63,
	"next_follow_id": 14,
	"avatar": "png",
	"user_name": "PaintNinja",
	"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
	"intro": "Author of ZeroNet's first decentralised music streaming service called \"NinjaBeats\".\n- [General info (slightly outdated)](http://127.0.0.1:43110/15F9LYs6c17NUXv3MxpJSGbpWxyHTEbzMk/)\n- [NinjaBeats streamer](http://127.0.0.1:43110/15F9LYs6c17NUXv3MxpJSGbpWxyHTEbzMk/stream/audio.html)\n- [Contact me](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=paintninja)",
	"post": [
		{
			"post_id": 1,
			"date_added": 1470863726,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 2,
			"body": "My ZeroMe features wishlist:\n- Ability to attach one or more images to posts\n- Reposts, #hashtags and @mentions\n- Searchbox for finding posts, comments and users easily\n- Ability to upload your own image background on your profile (currently you can just have a profile pic and a grey background like the rest of the site - it would be cool if we could upload our own custom background or at least allow us to change the colour of the background to one of a few presets)\n- Ability to write a new post from your own profile page rather than needing to go to to the home page first\n\nThanks to @Musickiller for some of the ideas",
			"date_added": 1470914193
		},
		{
			"post_id": 3,
			"body": "I've discovered that ZeroMe supports some basic markdown... cool!",
			"date_added": 1470923691
		},
		{
			"post_id": 4,
			"body": "I've been thinking about how it would be possible for people to share, stream and preview music on ZeroNet (and NinjaBeats) without needing to setup a zite or having to use something like ipfs or clearnet...\n\nUsing WebTorrent, I've made a tiny *experimental* webapp that'll allow you to do just that - just give it a magnet link and it'll stream and seed the music as it receives it!\n \nTry our demo [here](http://127.0.0.1:43110/15F9LYs6c17NUXv3MxpJSGbpWxyHTEbzMk/stream/v1/audio.html?audioFile=magnet:?xt=urn:btih:68cd19c5b70845e09bfec39e739817a9e7c71258&dn=Paradise.m4a&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&tr=wss%3A%2F%2Ftracker.btorrent.xyz&tr=wss%3A%2F%2Ftracker.fastcast.nz&tr=wss%3A%2F%2Ftracker.openwebtorrent.com&tr=wss%3A%2F%2Ftracker.webtorrent.io) - the demo streams the song Paradise by [Coldplay](http://coldplay.com)\n\n.\n_Known limitations and issues:_\n- It will stop seeding once you leave the page\n- It only streams and downloads in the web browser from seeders also in a web browser or clients using WebRTC like [WebTorrent's desktop client](https://webtorrent.io/desktop)\n- Only works with m4a and Opus files as browsers only natively support Opus, m4a and mp4 in WebRTC at the moment\n- First time use takes quite a while to load. Wait a couple of minutes and it should eventually start buffering.\n- Google Chrome has a bug causing the page to crash if you attempt to click play while the audio is still buffering. A possible workaround is to just wait for it to autoplay on its own.",
			"date_added": 1471264310
		},
		{
			"post_id": 5,
			"body": "As you might already know, public torrents tend to be very slow because barely anyone seeds and some people seem to think it's a good idea to cap their upload speeds stupidly low... There's also times where people upload torrents claiming they're part of a group they're not - causing mislead users to get lower quality content than expected or potentially dangerous files (e.g. malware, viruses, etc...).\n\nWhen NinjaBeats launches, we're completely aware of those issues and want to ensure that everyone wanting to participate in our project, can genuinely do so. That's why we're planning on having an official listing for all of the content we publish while additionally thinking up of our own cool kinds of distribution which guarantees decent download speeds.\n\nAnyway, to the point of this post... Over the last few days I've been working on the official listing and made great progress - it's a heavily modified clone of Kaffiene search and I think it looks beautiful... :) You can type in a part of a song name, artist name, album name, genre or just about anything about the tracks you want - and they'll appear instantly. Click on the artist result and you're taken to a custom page all about the artist where you can download or stream anything by them, as well as the ability to see upcoming events and possibly chat with other fans.\n\nWhile it all works great, it's all static at the moment. I'm looking for script developers who could automate the generation of all these individual pages or better, make the listing a bit more dynamic. If anyone's interested, let me know by contacting me on [ZeroMail](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=paintninja).\n\nUPDATE: Screenshots added.\nHomepage: https://ipfs.pics/QmdhWyaw2tAc5Y2U3iXmP6xRP58i5wPyhL5umD7rdypTD5\nThe \"Meet the artists\" page (just a few manually entered in atm): https://ipfs.pics/QmYDZm8u7eurWHspZH3hxbMY7urcrntvH68YHyozwKWxpz\nSearching for a partial song name: https://ipfs.pics/QmSPw4DBZtajEsk5AX8b17XQTKwBQCeQWHuaBPMZLwuL2v\nArtist page (needs some dynamic code to populate the albums and events areas): https://ipfs.pics/Qmezw7xArCCoseVkM83fdtHzE7BkkGsajeVVxo9xaZsjtm",
			"date_added": 1471710770
		},
		{
			"post_id": 1472829401,
			"body": "You can now donate to NinjaBeats [here](bitcoin:1XpfpsMhvY1gLCRNW3bxkTjj6yQJzN4kL).",
			"date_added": 1472829395
		},
		{
			"post_id": 1473012327,
			"body": "Following the unexpected large interest from a music sharing [experiment conducted last month](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu/4), I have decided to overhaul it and make it fully stable and powerful, compatible both embedded in a webpage (such as on the NinjaBeats listing or a fork of ZeroMe) and just stand-alone.\n\n**Introducing the NinjaBeats music streamer v2**. It works with a much broader range of music files and has lots of error catching and features compared to my last version.\n\n_Here's what's new:_\n- A complete overhaul on all fronts.\n- Supports album art which is shown beside the player\n- It now shows the name of the currently playing track - even if the ID tags are missing or incorrect, by using some simple algorithms on the track's filename.\n- Your existing links will \"just work\" on this new streamer without even needing to change the URL\n- You can now use a torrent info hash/ID like in Bwoi Music rather than needing to put the whole magnet link.\n- Much faster, more reliable and more detailed in the statistics\n- Even more stuff that I don't want to list here\n\n_Demos!_\n[Stream 7 Years by Lukas Graham (using torrent info hash)](http://127.0.0.1:43110/15F9LYs6c17NUXv3MxpJSGbpWxyHTEbzMk/stream/audio.html?audioFileID=c180e66e0892890cc0f1aa36ec528658e547d799)\n[Stream Bad Habit by The Kooks (using magnet link)](http://127.0.0.1:43110/15F9LYs6c17NUXv3MxpJSGbpWxyHTEbzMk/stream/audio.html?audioFile=magnet:?xt=urn:btih:060097c0fbdd735173e89f021ae2b5a9c3df9abc&dn=The+Kooks&tr=wss%3A%2F%2Ftracker.btorrent.xyz&tr=wss%3A%2F%2Ftracker.fastcast.nz&tr=wss%3A%2F%2Ftracker.openwebtorrent.com&tr=wss%3A%2F%2Ftracker.webtorrent.io)",
			"date_added": 1473012320
		},
		{
			"post_id": 1476477476,
			"body": "It's been a while, I know... Sorry about that. What's been happening since I was gone? In short, I've been going through some personal difficulties (and still am to a point) and am working on them alongside my increased amounts of academic work I've been receiving.\n\nUnfortunately that has caused the NinjaBeats project to be delayed, but the good news is that I have gotten permission from my examining board to work on NinjaBeats as part of my coursework, meaning the project isn't dead! :D\n\nFuture updates are in the works, including:\n- Albums and playlists\n- More dynamic database and listing work (it's fairly static at the moment... not ideal when you have over 1000 unique albums)\n- Seeding when the page is closed (potentially via a ZeroMux + WebTorrent hybrid)\n- Setting up lots of physical, hidden \"mini servers\" all over the place to upload, seed and stream seed the huge 300GB collection of FLACs\n\nAs the project progresses, I shall be posting shorter but more frequent status updates. Stay tuned!",
			"date_added": 1476477468
		},
		{
			"post_id": 1476563926,
			"body": "I'm currently working on major improvements to the streamer over the next week or so... What music would you like to see in the demos? :)",
			"date_added": 1476563917
		},
		{
			"post_id": 1476647364,
			"body": "So tired after doing so much streamer code... I've incorporated my new coding philosophy of an \"AI-powered adaptive user experience\" and lots of new features over this weekend. Not really much I can show yet as it's mostly back-end stuff for now but it's looking good...\n\nWith a bit of luck and more work I *might* have a basic playlist implementation ready for some potential demos sometime next week, that also demo all the new stuff I've just finished coding locally this weekend. Stay tuned! :)",
			"date_added": 1476647354
		},
		{
			"post_id": 1476903289,
			"body": "Lots of polish, front-end changes, a few new minor features and further work towards playlist support has been done today.\n\nPlaylist support is getting close now - just missing a UI for it",
			"date_added": 1476903278
		},
		{
			"post_id": 1477600936,
			"body": "Sorry about the delay, I'm in the process of getting refunds for the mini servers that broke a while back and replacing them with LattePandas so that I can get some live demos up of the new streamer...\n\nAs I don't like making people wait too long, the new streamer's already published and working with all previous NinjaBeats stream links. I just didn't want to do an official announcement until I've got some demos up. Stay tuned and enjoy! ;)",
			"date_added": 1477600924
		},
		{
			"post_id": 1478368305,
			"body": "## Announcing the new NinjaBeats streamer\nWhat's new? A lot. While at first glance it might not look like much has changed, the more you use it the more you'll discover... ;)\n\nI'll be showing off a new highlight of the update on a regular basis until all the main features have been showcased.",
			"date_added": 1478368292
		},
		{
			"post_id": 1478368568,
			"body": "*Stream more than just music* with NinjaBeats: Stream photos, videos, text or even a mix of them, without the need of any special file or additional URL arguments.\n\nHere's some demos, including some requested by the community:\n- Stream the [Buffalo Soldier music video by Bob Marley](http://127.0.0.1:43110/15F9LYs6c17NUXv3MxpJSGbpWxyHTEbzMk/stream/audio.html?ID=4af525066b62ab54732155523dd1ecb73acd9102)\n- Stream [a photo](http://127.0.0.1:43110/15F9LYs6c17NUXv3MxpJSGbpWxyHTEbzMk/stream/audio.html?ID=e76ea4d9ef6f4b3c4cbbb3f814e457933dbc26e6)\n- Stream a video as music (video + album art image) - [Slowly by Amon Tobin](http://127.0.0.1:43110/15F9LYs6c17NUXv3MxpJSGbpWxyHTEbzMk/stream/audio.html?ID=db066b0abd17ea44afc0061d98e6d1cea129e0ca)\n\nNote that some demos may not work in Chrome due to a browser bug that blocks locally stored videos from being loaded within a webpage.",
			"date_added": 1478368554
		},
		{
			"post_id": 1478436568,
			"body": "*Seed even with the page closed* with NinjaBeats: You can now seed even without needing to leave the player open.\n\nSimply follow these steps:\n1) Get [WebTorrent Desktop](https://webtorrent.io/desktop/) if you haven't got it already\n2) Open a NinjaBeats stream and copy the ID from the URL (e.g. if the link is `audio.html?ID=4af525066b62ab54732155523dd1ecb73acd9102` , you select `4af525066b62ab54732155523dd1ecb73acd9102` and press Ctrl + C or right click + copy)\n3) Open up WebTorrent Desktop and press Ctrl + V, you will now be seeding the stream.\n\nI welcome people to seed NinjaBeats demos in order to improve the overall speed and reliability, enjoy! :)",
			"date_added": 1478436553
		},
		{
			"post_id": 1478551863,
			"body": "*Easily share multimedia* with NinjaBeats: In just two steps, you can upload just about any format (or even a mix of different kinds of files), without needing to go to any special upload page or do any changes to your files.\n\nTo share content, it's as simple as:\n1) Open up the streamer and drag a file or a group of files onto the page\n2) Copy the share link and share!\n3) You can also *optionally* seed with the page closed by pasting the provided infohash into WebTorrent Desktop.\n\nThe streamer is smart enough to know what kind of content you're trying to share and to adapt the UI and UX accordingly when the file(s) are played, so you don't need to manually tell it anything for it to work (e.g. if you include a video and a picture, it treats it as an \"immersive\" music player; If you include a PDF on its own, you get a nice PDF reader UI; If you include an audio file and a picture, you get a normal music player, etc...)\n\nFeel free to share some links in the comments!",
			"date_added": 1478551847
		}
	],
	"post_like": {
		"1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_2": 1470863787,
		"15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_12": 1470913776,
		"1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ_6": 1470913813,
		"1BePwsiwFD8BjtYfB8tQegiKXDLnHWW1Um_3": 1470913904,
		"1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ_9": 1470913910,
		"1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ_10": 1470914680,
		"1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_6": 1470948017,
		"12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_2": 1470948023,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_9": 1470953243,
		"1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_7": 1471018533,
		"19M1DT5vruSATEcbEczYRwCk2uPuLcATBa_10": 1471114438,
		"1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_10": 1471263067,
		"12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_4": 1471264822,
		"1EErpRfR94YZwEMpAwsGKYsgSqHuRxvWib_9": 1471362792,
		"1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV_7": 1471375182,
		"19M1DT5vruSATEcbEczYRwCk2uPuLcATBa_1471959669": 1471960484,
		"1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_1472462658": 1472473564,
		"12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1473012327": 1473016369,
		"19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ_1473038909": 1473352149,
		"19M1DT5vruSATEcbEczYRwCk2uPuLcATBa_1473872816": 1473882226,
		"1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC_1473924561": 1473933589,
		"1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf_1474127068": 1474132386,
		"1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV_1475087537": 1475091727,
		"19M1DT5vruSATEcbEczYRwCk2uPuLcATBa_1475170734": 1475173255,
		"1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC_1475897596": 1475923502,
		"1G93135DKegpzoqyADP2MznzTwSUBLQKnQ_1477130078": 1477136414,
		"1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC_1477127340": 1477136571,
		"1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC_1477272835": 1477307452,
		"12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478368568": 1478436118,
		"12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478368305": 1478436565,
		"12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478551863": 1478624047,
		"1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_1475134633": 1478628362
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Nice work with the UI, looks nice yet clean!",
			"post_uri": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_2",
			"date_added": 1470863847
		},
		{
			"comment_id": 2,
			"body": "@Scrub I've tried putting the link on a new line but it still moves outta the div... just not as much. Looks like a bug in ZeroMe at the moment.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1",
			"date_added": 1470911083
		},
		{
			"comment_id": 3,
			"body": "@Aizen123 I've always been impressed by how fast ZeroNet zites are compared to clearnet ones... The local caching system and torrent-style distribution really makes a huge difference in performance :D",
			"post_uri": "1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ_6",
			"date_added": 1470913878
		},
		{
			"comment_id": 4,
			"body": "Agreed!",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_2",
			"date_added": 1470914603
		},
		{
			"comment_id": 5,
			"body": "@Jayofthezero Try putting dashes (\"-------\") with one new line padding on either side, like this maybe?\n\n-----------\n\nTest",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_3",
			"date_added": 1471009893
		},
		{
			"comment_id": 6,
			"body": "I like the ZeroNet site design much more... you just need to reduce the amount of padding so I don't have to scroll so much and it's great!",
			"post_uri": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_4",
			"date_added": 1471010048
		},
		{
			"comment_id": 7,
			"body": "@Jayofthezero: Sure, do something like this for a line seperator:\n\"This is the top line\n\n---------\n\nThis is the bottom line\"\n\nNotice how there's a blank line on either side of the dashes, that's the \"padding\".",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_3",
			"date_added": 1471018755
		},
		{
			"comment_id": 8,
			"body": "@Jayofthezero: Shift+Enter does a new line on websites that would usually submit something if you do a normal enter ;)",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_3",
			"date_added": 1471114411
		},
		{
			"comment_id": 9,
			"body": "As far as I'm aware, you do not need to seed hubs to view content from other hubs.",
			"post_uri": "13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ_8",
			"date_added": 1471259801
		},
		{
			"comment_id": 10,
			"body": "You're welcome :)",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_3",
			"date_added": 1471259850
		},
		{
			"comment_id": 11,
			"body": "Tested and confirmed working in Firefox. The audio will autoplay once enough has buffered, so maybe try waiting for it to play automatically without clicking the play button manually(?)",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_4",
			"date_added": 1471264717
		},
		{
			"comment_id": 12,
			"body": "Thanks for post linking!",
			"post_uri": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_9",
			"date_added": 1471265074
		},
		{
			"comment_id": 13,
			"body": "@Hostfat: I'll add it to the known issues list",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_4",
			"date_added": 1471265098
		},
		{
			"comment_id": 14,
			"body": "@Jayofthezero: According to WebTorrent's website, only their own desktop client and Vuze currently support seeding using both normal TCP/UDP torrents and WebRTC torrents. However, anyone streaming from the web browser will be seeding over WebRTC until they close the tab and the WebTorrent desktop client seems to work pretty well with seeding both (that's what I'm using for the demo)",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_4",
			"date_added": 1471265396
		},
		{
			"comment_id": 15,
			"body": "@Tkarita: Does that use WebRTC for streaming the audio or is it a skinned music player? Skim reading the code, it just looks like a skinned music player and could be patched to work on Firefox with some code changes. My music streamer uses a WebRTC torrenting system and relies on the web browser's standards support in order to work, so maybe my streamer will magically work in the future when Google adds support for MP4 audio streaming over WebRTC ;)",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_4",
			"date_added": 1471265644
		},
		{
			"comment_id": 16,
			"body": "@Tkarita: The player only supports formats the browser does through WebRTC. Opus works (either as .opus or contained in an .ogg) and AAC/M4A works on Edge 15 and Firefox (with Chrome adding support in a future release). I'm using M4A in the demo as it's more universally supported outside of the browser than Opus while still having decent browser support (especially in the future when Google decides to catch up with audio codec support on WebRTC).",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_4",
			"date_added": 1471267479
		},
		{
			"comment_id": 17,
			"body": "@P2P: I gave that a go last week and it was pretty good, but it requires software to be installed on the computer and the demo file never loaded for me :/ My aim here is to have something similar to your universal_p2p but without any client software or your own ZeroNet zite required. Maybe I just need to wait a while for your software to be more stable, as it's still very early days ",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_4",
			"date_added": 1471268013
		},
		{
			"comment_id": 18,
			"body": "@RiotPulv: WebTorrent uses WebRTC... By the way, the only data I'm aware it could leak is your public-facing IP address, which can be circumvented on ZeroNet by setting Tor mode to \"Always\". As for local-facing IP address, that can be prevented by changing a setting in your web browser",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_4",
			"date_added": 1471276090
		},
		{
			"comment_id": 19,
			"body": "@Sirenyc: Currently only Firefox and Edge 15 (on Win10 Redstone 2 for Insiders) works with the demo. If it's not too complicated to do, I may make some polyfills to support browsers that don't have the web standards required for this player to fully work.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_4",
			"date_added": 1471281311
		},
		{
			"comment_id": 21,
			"body": "Thanks everyone for your support during such early stages in development, we might have just made ZeroMe's first ever post with the most comments! :P\n\n@Kaffie: Funny enough I actually found out about WebTorrent when I stumbled upon Fastcast, and was curious to see if I could make my own embeddable, lightweight webapp that did something similar but easier and without the need of your own zite or specific static pages.\n\nOnce Chrome gets support for m4a streams over WebRTC like every other browser already has (which hopefully is soon), compatibility shouldn't be a problem. Even though atm this webapp is just a prototype, it's reasonably stable on all browsers that support the standards it needs.\n\nAnd don't worry about 0 seeding peers on any streams I post, as I plan on using this as a cool feature for previewing and possibly downloading music from the upcoming NinjaBeats listing and I'll have multiple dedicated servers seeding 24/7 on both the standard BitTorrent TCP/UDP and website streamer WebRTC.\n\nAnd maybe in the far future when my programming skills get good enough and if the popularity of this streamer remains high, I'll implement some kind of optional server caching for magnet links so that streams leeched within the last x days remain seeded by a server. :)",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_4",
			"date_added": 1471296798
		},
		{
			"comment_id": 22,
			"body": "@Sirenyc: Done!",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_4",
			"date_added": 1471360625
		},
		{
			"comment_id": 23,
			"body": "@Tkarita: Yep, although I don't recommend it as the file size is often far too large for streaming - especially when there aren't many seeding peers. ;)",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_4",
			"date_added": 1471375567
		},
		{
			"comment_id": 24,
			"body": "@Hoot: While that's a nice idea we're planning on distributing over 1000 unique albums in FLAC format (roughly 300GB of stuff!) on launch day, so it would be too much of a hassle to set up a separate zite for each album and it might spam people's ZeroHello page very quckly... :/\n\nOptional files on the main listing zite are under consideration, although again we're unsure about this as it'll require people to raise their storage limit for the NinjaBeats zite up to the point where some people won't have the space to increase it any further and may not know how to delete the zite to carry on getting more music.\n\nBecause of this it's a bit of a challenge to figure out the best means of distribution that won't cause either slow downloads or a confusing experience for some users. It's likely that we'll initially be using a refined version of this streaming experiment I've already got here though (with a download/save file feature of course), as it's like standard torrenting without the need for any additional software and there's no easy way for people to cap their upload speeds causing slow downloads for everyone.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_4",
			"date_added": 1471463432
		},
		{
			"comment_id": 25,
			"body": "Use the optional_files feature in ZeroNet so that content is only downloaded when requested rather than requiring everything to be downloaded before the zite can be viewed",
			"post_uri": "1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV_9",
			"date_added": 1471711831
		},
		{
			"comment_id": 26,
			"body": "@Quadrangle: Assuming everything goes to plan, we should have at least a couple of servers seeding and hosting all the content with 1Gbps connections, thanks to someone who goes by the name \"Lemo\" :)",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_5",
			"date_added": 1471806678
		},
		{
			"comment_id": 27,
			"body": "@Sirenyc: Sure! :) Please bear in mind that it's still a WIP and stuff may change - feedback is welcome.\n\nHomepage: https://ipfs.pics/QmdhWyaw2tAc5Y2U3iXmP6xRP58i5wPyhL5umD7rdypTD5\nThe \"Meet the artists\" page (just a few manually entered in atm): https://ipfs.pics/QmYDZm8u7eurWHspZH3hxbMY7urcrntvH68YHyozwKWxpz\nSearching for a partial song name: https://ipfs.pics/QmSPw4DBZtajEsk5AX8b17XQTKwBQCeQWHuaBPMZLwuL2v\nArtist page (needs some dynamic code to populate the albums and events areas): https://ipfs.pics/Qmezw7xArCCoseVkM83fdtHzE7BkkGsajeVVxo9xaZsjtm\n\nBy the way, the artist page banner has a parallax effect which isn't visible in a static screenshot.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_5",
			"date_added": 1471807957
		},
		{
			"comment_id": 28,
			"body": "Maybe one day if NinjaBeats is a hit at launch, I'll look into NinjaFlicks for films ;)",
			"post_uri": "1CFhytwoGGPNqmueehPqotaf2iG9uxD98e_14",
			"date_added": 1471881477
		},
		{
			"comment_id": 29,
			"body": "@Sirenyc: Thanks for your feedback and a list of some potential artists to add to the collection. Note that while I'll be working on gradually adding stuff from your list overtime, there's no guarantee I'll be able to obtain some of the music or make it available on launch day. :)\n\nAs for donations and ads, we're working on it and will post a status update here on ZeroMe when it's done. If we do end up adding any ads to our listing in the future, we will make sure that they are unobtrusive and that they respect your privacy. Additionally, we may give the artists a percentage of any revenue we make for legal and ethical reasons.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_5",
			"date_added": 1472067618
		},
		{
			"comment_id": 30,
			"body": "@Lemo3tornode: Thanks! :)",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_5",
			"date_added": 1472067675
		},
		{
			"comment_id": 31,
			"body": "@Jayofthezero: Yes, the aim is to have NinjaBeats and the listing all built for ZeroNet.\n\nI'm honestly not sure how I would share revenue with artists to be honest... I haven't really thought it through that much yet. There could be a variety of methods I could go about it...\n- I could try officially licensing music but no guarantee we'll get anywhere considering that we want it completely DRM-free and compatible on any and every device. I might not get a response at all from some artists or labels.\n- I could setup an advertising system that splits revenue depending on popularity of the artist (e.g. an artist that's popular on NinjaBeats gets a higher percentage of ad revenue) and each artist's revenue gets stored into a separate Bitcoin wallet. The funds from the wallets could get transferred to the artists whenever a copyright claim from an artist is filed or whenever either we get in contact with the artist or the artist gets in contact with us (which we'll make sure it'll be easy to contact us).\n\nI'm going to attempt both approaches in an anonymous manner. This'll mean that even if we fail officially licensing music, we'll still at least be seen as ethical and not wanting damage to the industry by providing ad revenue to the artists wherever and whenever possible and not making a profit for ourselves out of artist's works where it's not legal to do so.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_5",
			"date_added": 1472233338
		},
		{
			"comment_id": 32,
			"body": "@Anonymous6354: Anonymous, unobtrusive ads",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_5",
			"date_added": 1472311355
		},
		{
			"comment_id": 33,
			"body": "@Anonymous6354: Hopefully it'll become a success... I'm just quite concerned about the potential legal issues :/",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_5",
			"date_added": 1472380611
		},
		{
			"comment_id": 34,
			"body": "@Sirenyc: There is no bullet-proof way of being entirely anonymous on the internet. Sure, you can make it more difficult to be tracked, but the only certain method of not being tracked online is to not be online.\n\nEven if I won't need to worry about any copyright problems, I don't want to feel as if I am damaging the music industry. I see the NinjaBeats project as a movement towards a different, less restrictive method of enjoying music and connecting the artists with their fans rather than a pirated music site which just wants to make a profit out of other people's works.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_5",
			"date_added": 1472474295
		},
		{
			"comment_id": 35,
			"body": "@Anonymous6354: I've used ZeroTube recently and it worked just fine with just 1 peer on a video on Firefox... Maybe you're using Chrome? At the moment, Chrome has poor support for WebRTC video and audio codecs.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_5",
			"date_added": 1472486577
		},
		{
			"comment_id": 36,
			"body": "@Anonymous6354: I've just done some tests on WebRTC leaking in the latest stable versions of Firefox and Chrome, with both on default settings. https://ipfs.pics/QmbBuiNr6mS5E4V8XJXwgwxHXDJFwYKWq6Xf8JHkPejGMq\n\nBy disabling WebRTC entirely, sites like ZeroTube and WebTorrent stuff won't work. I recommend checking out that Chrome extension or trying a more privacy-focused browser such as Iron Browser or Firefox.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_5",
			"date_added": 1472816215
		},
		{
			"comment_id": 37,
			"body": "@Sirenyc: Just finished setting up a Bitcoin wallet for accepting donations and I'm just manually going through everything in the library and adding it to the listing as I don't have sufficient dynamic code knowledge and nobody has yet to come forward to offer help in that area.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_5",
			"date_added": 1472829574
		},
		{
			"comment_id": 38,
			"body": "@Alex (Bwoi): No browser fully supports everything yet, each browser has its own set of features with reasonable overlap with other vendors. In my personal opinion I believe that the major browsers should be supported by developers, not just one specifically. I'm not saying we should be making workarounds for browsers that don't support stuff, but I do think we should at least test our web creations on the major browsers to make sure it at least works - even if some visual effects are missing. I just really hate it when I visit a website and it tells me I have to use something else or the links don't work because it wasn't tested in my browser (regardless of it being Firefox, Chrome, Edge, etc...) - sometimes other browsers may not be available for my system (e.g. Windows Phone, iOS to a point, etc...).\n\nIf the page requires a certain feature like WebRTC to work at all and the browser doesn't support it, then I believe it is acceptable to at least notify the user that it might not work, but allow the user to go ahead anyway and dismiss the warning or something.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_5",
			"date_added": 1472833522
		},
		{
			"comment_id": 39,
			"body": "@Sirenyc: Does the bitcoin address 1XpfpsMhvY1gLCRNW3bxkTjj6yQJzN4kL  not work? What's the error?",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1472829401",
			"date_added": 1472916276
		},
		{
			"comment_id": 40,
			"body": "@Anonymous6354: Obviously a WebRTC leak test won't show any data if WebRTC is disabled. Your browser doesn't need WebRTC to work entirely, but on websites that need it like ZeroTube, those sites won't work, just like the WebRTC leak test.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_5",
			"date_added": 1472917543
		},
		{
			"comment_id": 41,
			"body": "@Anonymous6354: While it won't require it, some features may be unavailable without it (such as previewing tracks via streaming). You will still be able to use everything else though, including downloading FLACs directly from the browser and searching the listing. Mainly we only use WebRTC for the streaming demo at the moment for people to easily share music with each other... I'm not even sure if we'll need streaming via WebRTC it on launch day for our official library just yet.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_5",
			"date_added": 1472920889
		},
		{
			"comment_id": 42,
			"body": "@Sirenyc: Sure, I'll do that once I know that the bitcoin address is valid. I'm pretty new with Bitcoin and this is my first time using it",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1472829401",
			"date_added": 1472921013
		},
		{
			"comment_id": 43,
			"body": "@Tkarita: @Sirenyc: Thanks for your help. I've been aware of being able to donate directly to zites but I couldn't figure out how to import it into my Bitcoin client (I'm using Copay), which is why I'm just providing a bitcoin address at the moment, although Sirenyc has said that there's an error with it, what's the error? Did I make a typo somewhere?",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1472829401",
			"date_added": 1472929296
		},
		{
			"comment_id": 44,
			"body": "@Anonymous6354: No thanks, I feel like I'm okay with Photoshop already, but thanks for offering. :)",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_5",
			"date_added": 1472938204
		},
		{
			"comment_id": 45,
			"body": "@Sirenyc: Sorry for the late reply, I didn't get a notification until now. If your browser or client doesn't support bitcoin links, you can try donating directly to the address: 1XpfpsMhvY1gLCRNW3bxkTjj6yQJzN4kL",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1472829401",
			"date_added": 1473098508
		},
		{
			"comment_id": 46,
			"body": "@Mytest: There is a known issue on Chrome (it's on Google's side so it's out of my control sadly) that if you click play on an audio stream before it autoplays, the browser will crash. A known workaround in Chrome is to just wait until the music autoplays anyway and don't click pause/play until it starts playing automatically",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1473012327",
			"date_added": 1473100046
		},
		{
			"comment_id": 47,
			"body": "@Sirenyc: Thanks! Now I just need to eventually add support for playlists, albums and NinjaBeats database integration (the integration being that the player detects the artist of the currently playing track and it'll add a link to the official artist page on the NinjaBeats listing) :D",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1473012327",
			"date_added": 1473100108
		},
		{
			"comment_id": 48,
			"body": "@Mytest: I can't catch and disable the onclick event for Chrome until it autoplays because as far as I'm aware, Chrome does not fire any events which indicate that the audio has started autoplaying, although I'll try to add a notice for Chrome users in the near future - thanks for the suggestion",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1473012327",
			"date_added": 1473186526
		},
		{
			"comment_id": 49,
			"body": "I use a mini Intel Atom PC myself :)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1474727485",
			"date_added": 1474741211
		},
		{
			"comment_id": 50,
			"body": "@Mynameislegion: An optional web browser plugin could be made that performs a checksum of the zeronet link the user is about to visit and checks the checksum against a database. This would help prevent people accidentally hosting them while also preventing people finding the links (as checksums/hashes are one-way)",
			"post_uri": "1AjxW1N844WRpscEFSotfsqLXsQurz83xc_1475067668",
			"date_added": 1475086492
		},
		{
			"comment_id": 51,
			"body": "@Musickiller7777: Yep, something like these (if you can afford it... Intel tax >.< ). If you are interested in this except the price, I suggest you wait for a sale or discount or something... when that happens, it's usually a decent price. https://www.amazon.co.uk/s/ref=sr_pg_1?rh=i%3Aaps%2Ck%3Aintel+atom+mini+pc&keywords=intel+atom+mini+pc",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1474727485",
			"date_added": 1475174033
		},
		{
			"comment_id": 52,
			"body": "@Sirenyc: In short, I'm going through some personal difficulties at the moment and am working on them alongside my increased amounts of academic work I've been receiving.\n\nUnfortunately I am unsure if the project will be continued at this time or reach the target launch date due to these unexpected occurrences, although there is a chance that the project may progress in the future - I am currently looking into whether I could work on NinjaBeats as part of my coursework under a different name and slightly different aims - if so, a lot of the work from there could be ported over to NinjaBeats. ",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1473012327",
			"date_added": 1476117978
		},
		{
			"comment_id": 53,
			"body": "Thank you for your input. I'll try to add at least one song from an artist each of you have suggested per demo announcement, alongside some of my own picks which are specifically chosen to showcase new functionality at their best (where suitable)\n\n@Firebox You can already stream lossless music provided that your browser supports it. I don't use it in demos at the moment due to limited browser support, but maybe when I add a download feature I'll throw in a lossless demo.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1476563926",
			"date_added": 1476647693
		},
		{
			"comment_id": 54,
			"body": "@Splinterk: Thanks for your offer, however I have already finished refining my adaptive in-house framework that I'm now using for NinjaBeats.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1476903289",
			"date_added": 1477413783
		},
		{
			"comment_id": 55,
			"body": "@Binero: The example link is currently non-functioning and is just used to show the formatting of the URL (it's: audio.html?ID=infohashhere ). I'll update the example link and fix ZeroNet's forbidden bug in the near future, thanks for reporting",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478368305",
			"date_added": 1478368648
		},
		{
			"comment_id": 56,
			"body": "@Sirenyc: \n@Jro: \nTo infinity and beyond! It turns out that having an ampersand (&) in the filename causes problems. I've renamed the file and updated the link and it's working now.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478368568",
			"date_added": 1478374933
		},
		{
			"comment_id": 57,
			"body": "@Jro:\nI can confirm the issue you're having also occurs in Chromium 56.0.2902.0. Looking at the console, this is definitely a Chrome/Chromium bug and not a bug on my end. Chrome/Chromium is blocking local resources from being loaded (stuff on 127.0.0.1 or localhost is considered local) and hence prevents the video from being played.\n\n@Jro:\n@Binero:\nThe download speed varies on the amount of peers seeding the file on the NinjaBeats network and their combined upload speed. Assuming that only I am seeding the file, the download will be slow as my upload speed is very poor. Next highlight I will show how to seed when the page is closed, which should help with the download speeds a lot if some of you help seed the files :)",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478368568",
			"date_added": 1478378360
		},
		{
			"comment_id": 58,
			"body": "@Technoshaman777: As the player said, there weren't any peers seeding when you tried the demos, probably because my computer was off at the time. The idea of having a centralised fallback is a good idea, I'll consider it for a future update. :)\n\nTry the demos now, they should work at least in Firefox.\n\n@Nofish: Thanks for the info, I hope it gets fixed soon too!",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478368568",
			"date_added": 1478436016
		},
		{
			"comment_id": 59,
			"body": "@Jro: Thanks! If you have any feature requests or more feedback, feel free to let me know. :)",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478436568",
			"date_added": 1478549716
		},
		{
			"comment_id": 60,
			"body": "There's a known bug in the share link atm... just remove the `?wrapper_nonce=(hash)` inbetween `audio.html` and the `?ID=` as a workaround for now.\n\nSome stuff I'm sharing because it shows off the background effect quite well:\n- [Pumped Up Kicks by Foster The People](http://127.0.0.1:43110/15F9LYs6c17NUXv3MxpJSGbpWxyHTEbzMk/stream/audio.html?ID=df0407738c27663941efd5a1b897b3dbd9b06ce5)\n- [Someone That Loves You by HONNE & Izzy Bizu](http://127.0.0.1:43110/15F9LYs6c17NUXv3MxpJSGbpWxyHTEbzMk/stream/audio.html?ID=752aae0291d6eaeede2b03df147d396453d0b900)\n- [My Way by Calvin Harris](http://127.0.0.1:43110/15F9LYs6c17NUXv3MxpJSGbpWxyHTEbzMk/stream/audio.html?ID=74b199b65d6e1ea6209319de24555f2fa36f4c7f)",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478551863",
			"date_added": 1478552614
		},
		{
			"comment_id": 61,
			"body": "@Zanity: Because currently ZeroNet has limitations on the amount of files per site (although that can be worked around with the new merger sites feature) and can be problematic with large file transfers as there's no file splitting support yet.\nWhile you could use ZeroMux there's still the issue of where to host the content and how you can streamline that as much as possible for the end user.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478436568",
			"date_added": 1478554061
		},
		{
			"comment_id": 62,
			"body": "@Juansantiago:\n1) Sí, ¡puedes seguir semillando sin el navegador! Simplemente copias el infohash o ID y pega en el cliente [WebTorrent Desktop](https://webtorrent.io/desktop/)\n2) Si tienes un link/ID/infohash y no hay nadie semillando ese archivo, obviamente no funcionará el link. *Pero* si gente se semilla el mismo archivo, ese mismo link funcionará sin necesitar cambiarlo o recargar la página",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478551863",
			"date_added": 1478624038
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1470863785
		},
		{
			"follow_id": 2,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1CTut2qbaj54ZjNoYeuWSGwV75iVieKY6N",
			"user_name": "Quadrangle",
			"date_added": 1470864015
		},
		{
			"follow_id": 4,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L",
			"user_name": "Alex (Bwoi)",
			"date_added": 1471375829
		},
		{
			"follow_id": 5,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1Lye3ahX99TGQkQbuCUtZADGBqVeVpYxfr",
			"user_name": "Lemo3tornode",
			"date_added": 1472037163
		},
		{
			"follow_id": 6,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t",
			"user_name": "tkarita",
			"date_added": 1472332306
		},
		{
			"follow_id": 7,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "13Cqt2MSFS6eu4cbVuByZBuULrEAcZAqFG",
			"user_name": "https://bit.no.com",
			"date_added": 1472935800
		},
		{
			"follow_id": 8,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1473186613
		},
		{
			"follow_id": 9,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ",
			"user_name": "Sirenyc",
			"date_added": 1473363475
		},
		{
			"follow_id": 10,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa",
			"user_name": "Talnicrom",
			"date_added": 1473882221
		},
		{
			"follow_id": 11,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1KkA3C1iVDfieotYpuPUCpUtKzdFcfHMRy",
			"user_name": "cryp7ix",
			"date_added": 1474043016
		},
		{
			"follow_id": 12,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk",
			"user_name": "Userzero",
			"date_added": 1474043106
		},
		{
			"follow_id": 13,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC",
			"user_name": "Firebox",
			"date_added": 1476472539
		}
	],
	"comment_order": 0,
	"settings": {
		"reverse_comment_order": false,
		"mute_ugly": false,
		"mute_spam": false,
		"mute_blocked": false
	},
	"blocked": [
		"1D4B7XbRYY5p9kx79NtKr3qiShR5Tcpnvo"
	],
	"flags": {},
	"comment_like": {
		"137PNA5gLgCTLZTBtzUqCmMoZ752NQGQSJ_10": 1475518482,
		"18DbeZgtVCcLghmtzvg4Uv8uRQAwR8wnDQ_4": 1478549674
	}
}