{
	"next_comment_id": 5,
	"user_name": "Mynameislegion",
	"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
	"post_like": {
		"1EizNCr1TBaytrcEFBPrk8yk6eUFgNCC5r_1": 1471047183,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_16": 1471139442,
		"16ayEL9rXHKdbhoFu1LUanUaPVrzRVe331_8": 1471384489,
		"15Hi7MDddHwzTZmmcsj8MWLpZaDz6mLPXg_1474638112": 1474667014,
		"1JuUHRJ3A1wy5zgT6c2KviH9cHtq8Zr4X9_1474815271": 1474824878,
		"1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9_1479074084": 1479115481
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "I feel you my friend. Same here.",
			"post_uri": "15Hi7MDddHwzTZmmcsj8MWLpZaDz6mLPXg_1474638112",
			"date_added": 1474667031
		},
		{
			"comment_id": 2,
			"body": "I agree that this is an issue - what do you mean by \"public funded\"? Often public-funded means government-funded what is e.g. the BBC in the UK. If an outlet is government-funded, it will always portray the government positively in order to secure funds. The problem is, that ZeroNet and duckduckgo are for nerds - people won't leave their walled gardens until shit hits the fan.",
			"post_uri": "1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9_1479074084",
			"date_added": 1479115712
		},
		{
			"comment_id": 3,
			"body": "@Bravo: No matter if corporate, blog or twitter - the big question is how \"truth\" can be defined? \nIs something true, just because it sounds convincing, is shared by a person you respect, gets repeated a thousand times, matches your personal experiences or the majority accepts it as truthful? \nIn my opinion, human thought is nonobjective and therefore every piece of journalism is coloured by the bias of its writer. With that in mind, I would say that it makes sense to mix all possible news sources and see the \"big picture\".  \nOne site I can recommend is the https://theintercept.com/\nAlso I think Wikileak's concept is interesting -  just publish the source and cut out the \"man in the middle\".",
			"post_uri": "1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9_1479074084",
			"date_added": 1479133503
		},
		{
			"comment_id": 4,
			"body": "@Shellbound: Brexit was not just the result of wrong claims made by the leave campaign - corporate media such as the Daily Mail & Sun spread lies about the EU for decades until people started accepting them as truth. In comparison with other countries Britain has a very strong right wing press. And this example highlights one of the issues: big media organisations which are very influential on public opinion must be held accountable for misinformation/fearmongering. It is unbelievable that the punishment for printing a big fat lie on the front page and is an apology in small print on the last page a few weeks later. If you want \"good\" journalism in the free market, then the penalties for bad journalism must exceed the profits that can be gained from \"clickbait\".",
			"post_uri": "1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9_1479074084",
			"date_added": 1479242775
		}
	]
}