{
	"next_post_id": 49,
	"next_comment_id": 71,
	"next_follow_id": 48,
	"avatar": "png",
	"user_name": "Userzero",
	"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
	"intro": "",
	"post": [],
	"post_like": {
		"1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_9": 1472196089,
		"1G22SgXJtdx9D6BfvXgjknD57Mi1wjnZX3_1474400148": 1474401024,
		"1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS_1475579081": 1475605211,
		"19Mn6dCwtPj7NFsLTDWMuDK4jU5WKBkDdm_1476385093": 1476394003,
		"19Mn6dCwtPj7NFsLTDWMuDK4jU5WKBkDdm_1477850314": 1478476672
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "totalmente de acuerdo, falta e-books, anime,etc Y que no te deja actualizar el torrent (trackers) ni el .magnet. Añadir fotos...@Rapapobre: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_6",
			"date_added": 1471359560
		},
		{
			"comment_id": 2,
			"body": "Gracias. Saludos @Rapapobre: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_4",
			"date_added": 1471427869
		},
		{
			"comment_id": 3,
			"body": "Videos de cursos variados (informática, seguridad, programación, deportes...) @Thekiller66: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_7",
			"date_added": 1471471179
		},
		{
			"comment_id": 4,
			"body": "Todos los cursos de Udemy estan en http://127.0.0.1:43110/ZeroTorrent.bit/ @Thekiller66: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_7",
			"date_added": 1471511773
		},
		{
			"comment_id": 5,
			"body": "Para eso se necesita rootear el móvil @Zorriko: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_8",
			"date_added": 1471638466
		},
		{
			"comment_id": 6,
			"body": "En Tor > Configuración manual del proxy>\"No usar Proxy para 127.0.0.1\". \nServidor Sock: 127.0.0.1  puerto: 9150   Sock: v5      DNS remoto\n\nEsta es una buena configuración. Puerto cerrado en ZeroNet mejor. El mensaje ese puede aparecer, lo importante es que te cambie tu ip desde ZeroNet:\nhttp://127.0.0.1:43110/1Ey8WR7e3quTdPTMZZKDdqw2U6JG3zvkHe/",
			"post_uri": "18EjLHTadBR6ci3XRWyMfsGeWVtXTR8xx_5",
			"date_added": 1471680404
		},
		{
			"comment_id": 7,
			"body": "http://127.0.0.1:43110/1M71aqWtuwb3AKp8HfNqEa4LZVrGxLDWff\n\n¡Mi trabajo desapareció! Más de un 60 % borrado. Put. mierda",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1472222376",
			"date_added": 1472224275
		},
		{
			"comment_id": 8,
			"body": "@Rapapobre:  Sí. He reiniciado varias veces. Esa web estaba correcta esta mañana con + de 76 mensajes. Yo no la he tocado.Tengo que comprobar si también se han borrado torrents, algo díficil ya que no hay ni estadísticas ni nada.",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1472222376",
			"date_added": 1472225935
		},
		{
			"comment_id": 9,
			"body": "Todo el trabajo a la basura. Ya no continuo con ella. No sé como alguién puede borrar MI web. Había hace poco 30 conectados (copias?). Por suerte los torrents parecen estar bien @Rapapobre: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1472222376",
			"date_added": 1472227908
		},
		{
			"comment_id": 10,
			"body": "Gracias por la ayuda. Pero sólo pensar de volverlo a hacer...(y eso que se suponía que era más segura que una web normal. Eso sí, como me desaparezcan torrents, adiós Zeronet) @Rapapobre: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1472222376",
			"date_added": 1472228949
		},
		{
			"comment_id": 11,
			"body": "Cada uno tiene sus gustos. Zerotorrent tiene pocos uploaders y material. Ya habrá tiempo de preocuparse de la calidad de algún torrent, mejor que sobre que no que falte @RiotPulv: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1472201677",
			"date_added": 1472291541
		},
		{
			"comment_id": 12,
			"body": "Esa \"mierda\", como tú dices, la subí yo junto con otros cientos de torrents. Esa actitud de descalificar subidas y usuarios no ayuda en nada. No sé lo que buscas @RiotPulv: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1472201677",
			"date_added": 1472315989
		},
		{
			"comment_id": 13,
			"body": "https://github.com/HelloZeroNet/ZeroNet @Thekiller66: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1472338648",
			"date_added": 1472375825
		},
		{
			"comment_id": 14,
			"body": "bienvenido. Quiero dejar de nuevo clara mi opinión : 1.Sobre gustos no hay nada escrito, ¿quién es nadie para decir si una cosa es interesante o no ?, ese disco que para tí es una mierda, esa película que para tí es de frikis, etc a otras personas les puede encantar. Yo intento subir variado y para todos. Respetemos los gustos personales. (A ver si va a haber más censura aquí que en una web normal. Yo voy a seguir subiendo lo que me dé la gana) 2. ¿Qué todo el material de Zeronet se puede encontrar AHORA en el internet \"normal\"? Pues lógico, internet lleva muchos años y es espejo de los gustos e intereses de las personas. No se va a descubrir nada nuevo. Yo he subido muchos clásicos, películas antiguas, estrenos, cursos...Esto puede parecer redundante pero estamos  hablando de que cada vez cierran más webs tradicionales y que Zeronet es casi como una copia de seguridad, pues si vas a hacer una copia de seguridad anti-futuros-borrados tendrás que salvar todo el material que puedas (no guardas el material sólo los magnet, .torrent). No se quejen que no llega ni al gb  : P, para descargar hay que compartir. Y sí, mejor que sobre que no que falte, a tí te puede no gustar algo pero a otro le puede encantar. Buscas en el Buscador lo que te interese e ignoras lo demás. : ) Por cierto, todavía nadie ha dicho que son esos \"maravillosos\" y \"novedosos\" contenidos que se podrían subir y no existen en la web tradicional . Saludos @Thekiller66: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1472201677",
			"date_added": 1472377073
		},
		{
			"comment_id": 15,
			"body": "\"usado: 38.9k/40k\nYou are running out of your allowed space, please contact the site's admin at raito to raise your limit\"\n\nPero antes ponía el mismo mensaje y salían correctamente los mensajes. Casi todo el trabajo perdido.\n @Drymer: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1472222376",
			"date_added": 1472390432
		},
		{
			"comment_id": 16,
			"body": "¿Contratar tu propio internet ?",
			"post_uri": "18EjLHTadBR6ci3XRWyMfsGeWVtXTR8xx_1472869823",
			"date_added": 1473007638
		},
		{
			"comment_id": 17,
			"body": "y tal vez con ello Zeronet. \nSi vas a la web indica \n\"used: 1838.0k/2000k\nused: 1838.0k/2000k\nYou are running out of your allowed space, please contact the site's admin at someone to raise your limit.\"\nEl espacio está a punto de agotarse y luego no se podrán subir más torrents. En un sistema descentralizado P2p cuyo punto fuerte son los torrents esto me parece imperdonable. He leído por ahí que el creador de Zeronet es un sóla persona que trabaja en ello en sus ratos libres. Lo siento por su idea y no sé si dispone de los medios necesarios, pero si no quiere que Zeronet se estrelle antes de despegar debería buscar más ayuda, recursos y no dejar abandonado las funciones básicas. Me parece una falta de respeto al esforzado trabajo de los uploaders.\nZeroTorrent.bit concretamente fué creado por otra persona que después abandonó el proyecto. La web se ha quedado a medias, muy simple, sin búsqueda avanzada, estadísticas, fechas, actualizaciones de trackers, fotos, pocas categorías, etc y si encima no soporta grandes tamaños cuando estamos hablando de una página que debería aspirar a albergar miles de torrents resistentes a la censura...mal vamos.\nAlgunos hablarán de clonar ZeroTorrent.bit pero sé por experiencia propia que suele dar errores (realmente sólo funciona bien la clonación de blogs), esto no resuelve los problemas de su diseño anticuado y limitado y además ¿cuántos clones va a haber para tener una cantidad decente de torrents? ZeroTorrent02.bit,  ZeroTorrent03.bit  .... ZeroTorrent30.bit  : P\nZeronet llamó la atención de las personas cuando empezaron a cerrar otras web de torrents. Era la solución : red descentralizada p2p imposible de cerrar y sin censura, el futuro...\nLa realidad es que la sección de torrents está abandonada, sólo cuatro almas caritativas suben torrents y encima copiados de otras webs de torrents. A la hora de la verdad ¿dónde vamos a buscar las películas, series y programas actuales? pues a las webs de torrents tradicionales. Es gracioso que para dar de comer (dotar de contenidos) haya que ir a las antiguas webs de torrents ¿Qué pasará cuando las cierren? ¿Cuánta gente se molestará en ripear DVD´s (películas, series), extraer pistas de CD´s , escanear libros, crackear juegos, etc para publicarlas en ZeroTorrent104.bit para 800 usuarios en todo el mundo ?\n¿Por qué la gente sigue subiendo diariamente cientos de torrents a las webs antiguas y no a la novedosa y descentralizada p2p Zeronet? Pues porque tienen muchos alicientes, económicos a veces pero no siempre, sino porque los suben a webs curradas, con muchas opciones, donde su labor es reconocida, respetada, ganan prestigio, les facilitan mucho su tarea, su trabajo llega a posibles millones de usuarios, se forma una comunidad, se vé, valora y conoce el trabajo de los uploaders y cincuenta mil cosas más.\n¿Uploaders anónimos, sin fotos, sin  página propia personalizada, sin estadísticas de su trabajo, sin agradecimientos (like)?,...no creo.\nZerome puede ayudar a ser como un pegamento que una a la Comunidad Zeronet, pero una Comunidad P2P sin una web de torrents decente...mal vamos ¿Comunidad de qué? ¿Cuál es el interés común?.\n .Mucha unión en las Comunidades de Kickass y tal ...en cuanto desaparecieron los torrents, a las pocas semanas en el Foro sólo entran cuatro usuarios : P\nPlay tampoco deja subir películas, no hay nada en español, no se actualiza el contenido...además estar en un sistema P2P descentralizado y estar perfectamente visible tu Ip porque utiliza Webrtc...vamos no me hagas reir. Hay sistemas de streaming u otras opciones mucho mejor y más privadas.\nTampoco los clones de ZeroTalk y Zerotalk con imágenes funcionan correctamente y tienen un tamaño muy limitado. Esto son microclonaciones. Hay opciones de blogs gratuitos en Internet llenos de opciones...\n[Espero no haber sido muy duro en mis comentarios, yo apoyo Zeronet pero siento que puedo acabar dando la razón a los que dicen que va a morir antes de despegar]\n\n\n",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473099577",
			"date_added": 1473099595
		},
		{
			"comment_id": 18,
			"body": "Y cuando haya muchos clones ¿Cómo van a ser las búsquedas? Primero buscas en ZeroTorrent.bit, luego en  ZeroTorrent02.bit  y así hasta ZeroTorrent94.bit ¿ Cómo se sabe la calidad, bitrate, sonido, versión ...en las búsquedas ¿ Hay que descargar 5 versiones y probar suerte? ¿Cómo puedes seguir a un usuario que te gusten sus subidas? etc, etc, etc. Nadie va a perder tiempo y dinero ripeando DVD´s para subirlos a Zeronet @Dios: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473099577",
			"date_added": 1473104832
		},
		{
			"comment_id": 19,
			"body": "Error. No puedo conectar @5thvortex: \n",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473099577",
			"date_added": 1473104889
		},
		{
			"comment_id": 20,
			"body": "@5thvortex:  Sí, Play. Pero esto no resuelve los problemas ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473099577",
			"date_added": 1473105809
		},
		{
			"comment_id": 21,
			"body": "@5thvortex: Ok, thanks. ¿Y en navegador Tor? ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473099577",
			"date_added": 1473105970
		},
		{
			"comment_id": 22,
			"body": "@5thvortex:  Quiero decir que Play, no soluciona el tema de una web moderna de subida y descarga de torrents por usuarios. Play sólo deja visualizar películas.",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473099577",
			"date_added": 1473106110
		},
		{
			"comment_id": 23,
			"body": "@5thvortex: Play does not solve the issue of a modern web upload and download torrents by users. Play is streaming movies in English only",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473099577",
			"date_added": 1473106348
		},
		{
			"comment_id": 24,
			"body": "@5thvortex: \"This browser is unsupported. Please use a browser with WebRTC support.\"",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473099577",
			"date_added": 1473106880
		},
		{
			"comment_id": 25,
			"body": "Unsupported file type \".mkv\" @5thvortex: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473099577",
			"date_added": 1473109127
		},
		{
			"comment_id": 26,
			"body": "@5thvortex: I can not upload videos (Chrome). What formats are supported? http://127.0.0.1:43110/1GrtBsG57kjU2Z3iAQebG9D5c8CRDRLoPj/",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473099577",
			"date_added": 1473114879
		},
		{
			"comment_id": 27,
			"body": "Actualización Zeronet 0.4.1Rev1510, Fix site save without loaded SiteManager",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473156681",
			"date_added": 1473166906
		},
		{
			"comment_id": 28,
			"body": "Actualización. Cambiadas las categorias y más apartados de información.",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473166545",
			"date_added": 1473248906
		},
		{
			"comment_id": 29,
			"body": "ok, actualizado. Crear apartados dentro de Features me está costando mucho, no los acaba de cargar",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473166545",
			"date_added": 1473276236
		},
		{
			"comment_id": 30,
			"body": "Actualización Zeronet 0.4.1, Rev1515",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473156681",
			"date_added": 1473292309
		},
		{
			"comment_id": 31,
			"body": "ZeroTorrent.bit fué creado por una persona desconocida que lo dejó abandonado, el tamaño es muy pequeño y está próximo a acabarse. Lo único que se puede hacer es una web de torrents desde cero o clonar ZeroTorrent.bit y modificar sus parámetros para quitar las limitaciones y mejorarlo. ¿Voluntarios? : )",
			"post_uri": "18EjLHTadBR6ci3XRWyMfsGeWVtXTR8xx_1473487375",
			"date_added": 1473524775
		},
		{
			"comment_id": 32,
			"body": "Sólo me sale desde: \nhttp://127.0.0.1:43110/15Hiyn7U2C24K6j7xwWer8Z2TtcAxXgauR/Home\nY pone:   content.json download failed",
			"post_uri": "18EjLHTadBR6ci3XRWyMfsGeWVtXTR8xx_1473492029",
			"date_added": 1473524940
		},
		{
			"comment_id": 33,
			"body": "Gracias por las sugerencias, pero mis conocimientos son bastante límitados. Intenté hacer una tabla completa con un montón de información a rellenar ( tamaño, calidad, bitrate, codec, publicador, nº de páginas, autor...) y esta información no era visible despues de completarla. Otras pruebas también fallaron...\nEs un clon de Zerotorrents sin limitaciones pero básico, mi idea es incentivar su uso o clonación con mejoras por gente que sepa. Prefiero separar este tipo de torrents de los de idiomas, en el que estaré más centrado. El de Unlimited es para que suban otros usuarios yo sólo no le voy a mantener : )",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473872019",
			"date_added": 1473879583
		},
		{
			"comment_id": 34,
			"body": "Categoría Games añadida",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473872019",
			"date_added": 1473880553
		},
		{
			"comment_id": 35,
			"body": "ejjejeje Espero que otros usuarios se piquen y hagan una mejor versión. Sino de momento, para ir tirando, está bien.",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473872019",
			"date_added": 1473880658
		},
		{
			"comment_id": 36,
			"body": "Totalmente de acuerdo",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473872019",
			"date_added": 1473881443
		},
		{
			"comment_id": 37,
			"body": "Actualización Zeronet 0.4.1, Rev1523, Real fix file write confirmation",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473866268",
			"date_added": 1473895172
		},
		{
			"comment_id": 38,
			"body": "You can put an image in \"Torrent description\" (link). Size images take up a lot and have to be controlled. Also, I would have to research how. Regards @Sirenyc: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473872019",
			"date_added": 1473896957
		},
		{
			"comment_id": 39,
			"body": "@Sirenyc: Audio is more generic. Audio: music, audiobooks (no pdf), audio courses (no pdf), audio radio ...\nThe problem is: many categories give problems",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473872019",
			"date_added": 1473901377
		},
		{
			"comment_id": 40,
			"body": "Music and Others Category added",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473872019",
			"date_added": 1473943222
		},
		{
			"comment_id": 41,
			"body": " <option id=\"tvepisodes\" value=\"tvepisodes\">TV Episodes</option> sino lo pongo así me dá problemas...A veces parece que los cambios tardan en actualizarse.",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473872019",
			"date_added": 1473963689
		},
		{
			"comment_id": 42,
			"body": "@Rapapobre: Lo cambié a TV pero ahora tus capítulos de Ash vs Evil Dead no aparecen en esta categoría : (",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473872019",
			"date_added": 1473968576
		},
		{
			"comment_id": 43,
			"body": "Intenté cambiarlos yo pero no sé si la he \"liao\"",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473872019",
			"date_added": 1473969261
		},
		{
			"comment_id": 44,
			"body": "oo Creo que me lo he cargado ¿Te sale UZerotorrents?",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473872019",
			"date_added": 1473969901
		},
		{
			"comment_id": 45,
			"body": "Ahora va bien. Intenté probar a borrar el comentario de \"This is the future\" desde Atom y se quedaba infinitamente en Loading... (pensaba que podría borrar más facilmente ciertas cosas...)",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473872019",
			"date_added": 1473970266
		},
		{
			"comment_id": 46,
			"body": "@Rapapobre:  :)",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473872019",
			"date_added": 1473971670
		},
		{
			"comment_id": 47,
			"body": "Amigo, lee este Blog:\nhttp://127.0.0.1:43110/1JfpEppAtZJZo3rVZQGjYDpkn2gcwGTJn/?Home\ny cambia las direcciones web, sino te lleva a Uzerotorrent. Saludos",
			"post_uri": "1FhBaNDUvHMejk1hfkEgiSTWKPZBntBnff_1473965722",
			"date_added": 1473984009
		},
		{
			"comment_id": 48,
			"body": "Sí, a eso me refería pero tranquilos, \"morir\" en un sitio donde te puedes clonar infinitamente es irrelevante. ZERONET = CLONACIÓN @Rapapobre: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473983861",
			"date_added": 1474027778
		},
		{
			"comment_id": 49,
			"body": "Leído. Thanks",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1474145190",
			"date_added": 1474324648
		},
		{
			"comment_id": 50,
			"body": "ok. My image is very large but prettier : ) Regards @Sirenyc: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1474145190",
			"date_added": 1474417085
		},
		{
			"comment_id": 51,
			"body": "¿Qué tal les funciona? ¿Ven los post?",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1474415553",
			"date_added": 1474463288
		},
		{
			"comment_id": 52,
			"body": "Gracias. Poco a poco vamos aprendiendo @Rapapobre: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1473872019",
			"date_added": 1474501491
		},
		{
			"comment_id": 53,
			"body": "Ya me ha pasado alguna otra vez al arrancar Zeronet > Zerome no aparecerme mi imagén en el circulo si no otra, he observado que alguna otra, de otros usuarios,  tampoco se correspondía con la habitual. Suele durar unos segundos o hasta recargar la web. ¿Alguién más lo ha notado?",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1474651200",
			"date_added": 1474673239
		},
		{
			"comment_id": 54,
			"body": "Mi imagen era la de Zeronauta, la tuya la de RiotPulv, ...@Rapapobre: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1474651200",
			"date_added": 1474675310
		},
		{
			"comment_id": 55,
			"body": "Respondido",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1474910577",
			"date_added": 1474934660
		},
		{
			"comment_id": 56,
			"body": "Lo único bueno que como son webs compartidas se puede recuperar una versión anterior pero desactualizada",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1474910577",
			"date_added": 1475058520
		},
		{
			"comment_id": 57,
			"body": "ZeroHello saca imágenes de manera incorrecta\nhttps://ipfs.pics/QmYDNp4yH1YFycQWABW7LK7DFD4nLydCjTeyG6bDeQzLDK",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1475109114",
			"date_added": 1475170471
		},
		{
			"comment_id": 58,
			"body": "http://127.0.0.1:43110/1ArzJQzPVdxdHCZcGjTfD6VAKPdSaSmiu6/?Home",
			"post_uri": "113ncCKRevSvp6z9gGwFNFH5YUWcT9xHWY_1475348611",
			"date_added": 1475352214
		},
		{
			"comment_id": 59,
			"body": "\t\nthanks\n\t\n",
			"post_uri": "1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS_1475579081",
			"date_added": 1475605207
		},
		{
			"comment_id": 60,
			"body": "I do not",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1475605317",
			"date_added": 1475605880
		},
		{
			"comment_id": 61,
			"body": "Stiglitz falla más que una escopeta de feria : )",
			"post_uri": "15rDwTWvkH2digEM8BSxWCUanhBJVXnKki_1475798904",
			"date_added": 1475854000
		},
		{
			"comment_id": 62,
			"body": "Hola",
			"post_uri": "19cqDVzyTrnz5CEkfXjb5eLs1ofjuwKP3a_1476042763",
			"date_added": 1476045835
		},
		{
			"comment_id": 63,
			"body": "sí es una pseudociencia :) @Xikujaro: ",
			"post_uri": "15rDwTWvkH2digEM8BSxWCUanhBJVXnKki_1475798904",
			"date_added": 1476210537
		},
		{
			"comment_id": 64,
			"body": "Contestado @Rapapobre: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1475605317",
			"date_added": 1476211362
		},
		{
			"comment_id": 65,
			"body": "¿Para eso vienes a Zeronet, para meter cizaña en la Comunidad Zerome cuando antes no la había, promocionar tu blog y distribuir spam ?. He comprobado ciertos datos, creación de perfiles y correlación entre ataques. Provocas en Zerome, te responden y atacas Uzer0torrent a las pocas horas. Dísimula un poco mejor, no pongas imágenes de temas que te relacionen, ataca Zer0torrent oficial y otras webs que tienen más usuarios, boludo \n\nhttp://127.0.0.1:43110/1ArzJQzPVdxdHCZcGjTfD6VAKPdSaSmiu6/?Topic:37_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk/+Requests+Peticiones+Post+your+request+here+and+mind+to+give+as+much+info+as+will+be+helpful+to+find+it+title+edition+isbn+author+etc \n\nhttp://127.0.0.1:43110/1ArzJQzPVdxdHCZcGjTfD6VAKPdSaSmiu6/?Topic:396_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk/Friend+Sites+Webs+amigas\n\n @Cer: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1476353912",
			"date_added": 1476356868
		},
		{
			"comment_id": 67,
			"body": "\nSi quieres decirme algo dilo aquí pero no pongas spamm en las webs porque perjudicas a otras personas y a la Comunidad de Zerome, valiente @Cer: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1476353912",
			"date_added": 1476361164
		},
		{
			"comment_id": 68,
			"body": "sure??? @Greate Sick: \nhttp://127.0.0.1:43110/0list.bit/?Topic:348_1MRSDFESsBXDGvNoZ5ifztA89XfEahA5ka/print+reports+of+physical+immortality+BOINC+ROSETTA+HOME+one+one+six+one+one+two+training+modules+immortality+two+two+one+The+access+code+the+access+level+six+six+Eight+zero+level+of+access+to+physical+immortality+zero+zero+six+eight+Access+level+two+six+eight+all+protein+agents+mobilization+of+physical+immortality+the+access+code+two+two+three+six+two+one+prepare+all+regions+of+the+world+to+the+physical+immortality+access+level+eight+access+code+six+six+two+zero+six+One+strict+compliance+with+all+instructions+of+protein+agents+with+physical+immortality+access+level+one+one+six+eight+two+four+activation+protocols+immortality+eternal+renewal+of+quantum+cells+access+level+six+six+two+four+eight+https+i+imgsafe+org+f9c45a7960+jpg+https+i+imgsafe+org+f9c4f044d7+jpg+https+i+imgsafe+org+f9c942bc19+jpg\n\nhttp://127.0.0.1:43110/0list.bit/?Topic:237_1MRSDFESsBXDGvNoZ5ifztA89XfEahA5ka/+Kerosene+can+t+melt+steel\n\nhttp://127.0.0.1:43110/0list.bit/?Topic:269_1MRSDFESsBXDGvNoZ5ifztA89XfEahA5ka/Prepare+reports+immortality+CODE+38834+483834+BOINC+ROSETTA+HOME\n\n\nDo you need more examples?",
			"post_uri": "19Mn6dCwtPj7NFsLTDWMuDK4jU5WKBkDdm_1476385093",
			"date_added": 1476460331
		},
		{
			"comment_id": 69,
			"body": "Is it my fault spam? Punish the spammer ( Cer) @MilitaryRiotLab: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1476461557",
			"date_added": 1476461875
		},
		{
			"comment_id": 70,
			"body": "I guess, bbxxx = Cer not attack your web ... @MilitaryRiotLab: ",
			"post_uri": "1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_1476461557",
			"date_added": 1476462144
		}
	],
	"follow": [
		{
			"follow_id": 25,
			"hub": "185yXNL48LTZyKfNo6WgyKshtMgcV3mecL",
			"auth_address": "1AuDwEHZ2BKhmDfCpMB43nwKp3Rbt1uaQj",
			"user_name": "Icf20",
			"date_added": 1473202847
		},
		{
			"follow_id": 34,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "18FZVA1o8FjjxaxQTu3LBArraePzPdwZtC",
			"user_name": "Userzero",
			"date_added": 1475110472
		},
		{
			"follow_id": 36,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "18FZVA1o8FjjxaxQTu3LBArraePzPdwZtC",
			"user_name": "Userzero",
			"date_added": 1475110623
		},
		{
			"follow_id": 37,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "18FZVA1o8FjjxaxQTu3LBArraePzPdwZtC",
			"user_name": "Userzero",
			"date_added": 1475110693
		},
		{
			"follow_id": 39,
			"hub": "185yXNL48LTZyKfNo6WgyKshtMgcV3mecL",
			"auth_address": "1DLf7WXLCVK3VyLtV3gawnBjTynYeRyhgh",
			"user_name": "Zero",
			"date_added": 1475853882
		}
	],
	"settings": {
		"reverse_comment_order": false,
		"mute_ugly": false,
		"mute_spam": false,
		"mute_blocked": false
	},
	"flags": {},
	"blocked": [
		"1AAt12Xq7AmHr6VzxjUfsb2FBiLfrHGD5Y",
		"1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT",
		"1MRSDFESsBXDGvNoZ5ifztA89XfEahA5ka"
	],
	"comment_like": {}
}