{
	"next_comment_id": 20,
	"user_name": "狗蛋",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "Use BTsync to sync everything.It is very useful.",
			"post_uri": "1PoiRFseXaeGhnj2mpwS3xiXVrUd8noRLW_4",
			"date_added": 1471535083
		},
		{
			"comment_id": 2,
			"body": "@Andrewm: Yes，I know Syncthing,but it is not easy to use.",
			"post_uri": "1PoiRFseXaeGhnj2mpwS3xiXVrUd8noRLW_4",
			"date_added": 1471538058
		},
		{
			"comment_id": 3,
			"body": "@P2P: RT是啥？",
			"post_uri": "16XhwuR6w5BURDK4bn3m3Fy9qXRmX24kDc_2",
			"date_added": 1471701260
		},
		{
			"comment_id": 4,
			"body": "然而我已经存有她的两部微电影。",
			"post_uri": "15Zmh5dcKYDxo3mUFTXwJPUHAbczeafAUp_8",
			"date_added": 1471789885
		},
		{
			"comment_id": 5,
			"body": "打开时还有，一刷新就没了。。。。",
			"post_uri": "15Zmh5dcKYDxo3mUFTXwJPUHAbczeafAUp_12",
			"date_added": 1471919353
		},
		{
			"comment_id": 6,
			"body": "Who can translate this article ?(谁能翻译一下？好像是俄语。)",
			"post_uri": "18WFCAqYM3Kdhm5qskvR1rS3REQVZGjiHe_2",
			"date_added": 1471962986
		},
		{
			"comment_id": 7,
			"body": "Hope this function coming soon.",
			"post_uri": "13pAK1jj4Qwt56ytnn5BorrMfHA7J3Nc8C_1471967886",
			"date_added": 1471968046
		},
		{
			"comment_id": 8,
			"body": "BtSync ：https://www.getsync.com/\ndemonsaw：https://www.demonsaw.com/\nfree-share：https://github.com/psychokinesis-dev/free-share\nIPFS ：https://ipfs.io/\n",
			"post_uri": "114c9kLxp6SPG4xhhHZEnoijFdYA8j23JE_1472356653",
			"date_added": 1472361682
		},
		{
			"comment_id": 9,
			"body": "你手机刷了windows10?",
			"post_uri": "14MrxSzhaSXiFwsAbyhwtipmU3Lh55Xcrr_1473251667",
			"date_added": 1473312756
		},
		{
			"comment_id": 10,
			"body": "@Mzero: 小米4能刷成windows10，不知道刷成win10后能否用zeronet.",
			"post_uri": "14MrxSzhaSXiFwsAbyhwtipmU3Lh55Xcrr_1473251667",
			"date_added": 1473513949
		},
		{
			"comment_id": 11,
			"body": "中国的",
			"post_uri": "1V7usnfmabQXPSNC2zrCpF2ed2jDZaujS_1473590838",
			"date_added": 1473603026
		},
		{
			"comment_id": 12,
			"body": "where has magnet link?",
			"post_uri": "16YP1ZeHrKq3KB3DdBWHec984oQAfVPT9d_1473590616",
			"date_added": 1473603059
		},
		{
			"comment_id": 13,
			"body": "像用微博那样用就行，不求甚解。",
			"post_uri": "1V7usnfmabQXPSNC2zrCpF2ed2jDZaujS_1473590378",
			"date_added": 1473603110
		},
		{
			"comment_id": 14,
			"body": "Because China is the most people country in the world.",
			"post_uri": "156HySyXH37jFXXqKCwVq8HqsrZLZzy8Qx_1473557892",
			"date_added": 1473603421
		},
		{
			"comment_id": 15,
			"body": "[这里有个链接](http://gz.feixin.10086.cn/HttpInterface/SMsg/show/sdx/MTYzMDIzOTIzNA%3D%3D/idx/MjQ5Njg0/tk/64ba3db95dc239bf3af6ef698408d3d4/inx/1/fclient/pc?from=groupmessage&isappinstalled=0)\n\n文章如下（只复制文字）\n\n\n看到杨改兰的事件时，格隆真实感受到一种无法呼吸的窒息，胃部阵阵痉挛绞痛，随后泪水不由自主溢满眼眶。\n\n如果没有杨改兰令人窒息的“自我灭门”，谁会相信我们这个“盛世”下有这样惨绝人寰的生态与人群？\n\n2016年8月26日18时许，甘肃省康乐县景谷镇阿姑山村，28岁女子杨改兰在其家房屋后一条羊肠小道上，用斧子将自己的4个亲生子女（一个6岁，两个双胞胎5岁，一个三岁）一一砍杀，在发现孩子未死后，又逼迫他们喝下农药，随后自杀身亡。\n\n奶奶杨兰芳闻讯赶去时，杨改兰还没断气，马上要报名读一年级的6岁的大重孙女也没断气，但看起来十分痛苦。她曾经请求，让杨改兰把这个孩子“留下”，但杨改兰没同意——这个女人很决绝、近乎残忍地不给亲生骨肉留任何生的机会。\n\n外出打工的丈夫李克英在接到电话赶回后被眼前的一幕吓傻了，他一言不发、没流眼泪，抱起还没死的小儿子就向村口跑。半路上，儿子断气了，他又木然把儿子抱回家。\n\n在平静料理完一家人的后事后，这个男人也以喝农药的方式离开了人世。\n\n\n▌二、\n\n景古镇阿姑山村位于景古镇东北面，距镇政府6公里，全村共有10个社、191户、841人。2013年全村建档立卡贫困户73户、281人，占总户的 38%。低保户56户、152人，占总人口的18%——超过一半的人口在贫困线下。\n\n19岁结婚的杨改兰就生活在这个村里。她几乎撑起了一个家，带着4个子女和父亲一起生活，还要照顾奶奶。杨改兰家的生活环境，用尽词典中对于贫穷的形容都毫不为过：那是村里人都说最穷最破的房子，那是大风几乎都会吹翻的土坯房，那是连大门都关不严、家里任何值钱物件都没有的危房。杨改兰就是这样日复一日劳作，平日一个人带着4个孩子在10平方米左右的、连电都不舍得多用的危房里生活。\n\n（杨改兰家徒四壁的家）\n\n入赘的丈夫李克英平时外出打工，家里的十亩土地，各种农家杂货，4个孩子的衣食住行，上学等等一系列沉重的问题，都压在了杨改兰的肩头。麦子和大豆是当地较为常见的农作物，几乎也是杨改兰一家的口粮和重要经济来源，农民看天吃饭，十亩贫瘠的土地种上小麦和大豆，收成好了一年能够有个三四千，不好的话，除了能吃饱饭，啥也干不了。日复一日，年复一年，在无尽的苦海中挣扎，没有尽头。\n\n外出打工的李克英的收入也并不高。堂弟李克义说，他们这样农村出去的打工者，饥一顿饱一顿，勤扒苦做，一天小工工资也不过120元左右，但有时候几个星期也没有工作。\n\n因为超生，四个孩子统统没能上户口（当地官方给的说法是：均未及时申报户口）。作为全世界仅有的四个有户口的国家，没有户口，就意味着国家对孩子的抚养与成长不承担任何责任，这也是杨家在2010年被纳入农村三类低保，直至2013年底取消低保，四个孩子一直没有纳入低保范围的原因——杨改兰的孩子们在自己国家的土地上是“黑户”，真实存在，却又如隐形人一样，视若无物。\n\n这就是杨改兰们——中西部绝大多数农民——的真实生态：他们都是“盛世”下的蝼蚁，无关紧要，无人在意，也无人关注。他们在社会的最底层苦苦挣扎，但始终看不到一个出头之日。对他们而言，勤劳致富只是一个美丽且虚幻的泡沫。杨改兰即使不自杀，穷尽一生所得，也可能无法在哪怕省城兰州买一个厕所。“精英”占有和集中了社会所有的资源，留给杨改兰们的，只剩下贫瘠和这辈子也可能爬不出的穷困泥沼。社会车轮滚滚向前，但他们被毫不怜悯地刻意甩下、遗弃甚至无情碾压。\n\n希望，永远不是无所谓有，无所谓无的。对于杨改兰、李克英们，活得憋屈，死无尊严，支撑他们活下去的几乎唯一支柱，就是心中那点卑微、渺小、若有若无的希望。这也是在新学期开学前，6岁的大女儿要报名读书，李克英在工地上厚着脸皮提前“善意预支”1500元钱的原因——拿回去给大女儿报名用。\n\n当某一天，某件事，比如小孩报名遭拒，比如全家被取消低保资格（杨家在2013年底的群众评议中未通过，而被全家取消低保——我百思不得其解，这种事情，怎么可能是通过群众评议的方式），令他们觉得连最后的希望都不剩下的时候，他们能很轻松地做出放弃自身生命的决定——这也是这个弱势群体抗议和呐喊的最后、唯一的合法工具。\n\n这个时候，于杨改兰，生和死，已经不是道选择题，而是一件吃饭睡觉一样的必选、单选项。到这种份上，生亦何喜，死亦何哀！死亡，可能反而是一种愉悦的解脱。\n\n我不知道杨改兰在砍杀自己孩子并自杀前是怎么想的，也不知道她做过怎样的挣扎。但我相信，但凡对人世哪怕还有丝毫的留恋，这个世界但凡哪怕给过她哪怕一丁点的希望，但凡在她喝药前的那几个小时、几分钟，身边的人，社会，哪怕给过她一丁点的色彩、微笑，或者是希望的暗示，她都不会选择死亡的。\n\n事实上，这个渺小而卑微的女人，哪怕临死前，内心都还是怀有希望的：杨改兰的大女儿是穿着杨改兰此前去几公里外的镇上买来的新衣服离开这个世界的——买回家后，杨改兰一直不让她穿，说是怕脏了，让她等开学再穿。\n\n那件色彩艳丽的新衣服，和它的主人一起，埋入地下，成为了永远也不会再见阳光的希望。\n\n\n▌三、\n\n杨改兰并不孤独。之所以社会会形成他们是“社会的少数”的错觉，多半是因为“形势大好”的阳光宣传，以及镜头从来没有对准过他们的原因。\n\n事实上，我们这个社会始终都是金字塔型的，杨改兰这样的底层一直都是大多数，无论是在建国前的私有时期，还是建国后的“公有时期”。\n\n90年代下岗工人因生活无着、谋生无路而举家上吊的事情，或许很多人还记忆犹新。其实稍微近一点，这种案例也毫不罕见。2014年一名妇女因盗窃两个面包，被店主当场抓住，店主为防止妇人下次继续作案，将其绑在电线杆上，并在其胸前挂上写有“我是小偷”的纸板。\n\n\n社会给这个群体人格和尊严的估值，有时候只值两块面包。\n\n如果记忆力不坏，应该也不会忘记，今年六一儿童节前，一个母亲为了孩子偷一个鸡腿的新闻。\n\n儿童节前一天，南京玄武警方抓获一个奇怪的小偷，对女子进行搜查后，民警在她身上搜出了被盗的一点杂粮、一个鸡腿。而检查到腰部时，则发现了一本儿童读物。\n\n女子姓刘，生了双胞胎女儿，但肾脏都有问题，她这次带着其中一个病情比较严重的来到南京总医院治病。丈夫出走，她在老家种地，没有其他经济来源。她家的主要经济来源，是她每天在废品站打工所得，每天只有四五十元。这次来南京看病总共带了3000元，也都是跟亲戚借的。\n\n“为什么不偷多一点鸡腿呢？”民警很疑惑。\n\n“我就是为了孩子，不是自己吃。”刘女士十分后悔，声音也带着哽咽：“因为今天是儿童节，昨天一早，孩子就说想要礼物，说想吃鸡腿，但是超市的鸡腿要7块钱一个。还想要一本三字经，学校早读课上要背，之前一直没舍得给她买，她常和我说，别的小朋友都有，就她没有，我总跟她说再等等，过段时间买。昨天下午去超市，本来是想买点玉米大豆，给她吃消肿，结果看到有鸡腿和三字经，可我身上只有5块钱，我拿起又放下，拿起又放下，最后还是一个糊涂……”\n\n现在我想问的是两个问题：\n\n    1、哪个更真实？\n\n    是杨改兰和四个孩子？偷面包和鸡腿的母亲？还是“盛世”？\n\n    2、谁的错？\n\n    杨改兰们的？还是这个社会的？\n\n\n▌四、\n\n81年前，美国社会也发出过类似的诘问。\n\n1935年的一天，时任美国纽约市长的拉古迪亚在法庭旁听了一桩面包偷窃案的庭审。被指控的是一位老太太，当法官问她是否认罪时，她说：“我那两个小孙子饿了两天了，这面包是用来喂养他们的。”法官秉公执法地裁决：“你是选择10美元罚款，还是10天拘役？”无奈的老太太只得“选择”拘役，因为要是拿得出10美元，何至于去偷几美分的面包呢？\n\n审判刚结束，人们还没散去，拉古迪亚市长从旁听席上站起，脱下自己的礼帽，往里面放进10美元，然后向在场的人大声说：“现在，请各位每人交50美分的罚金，这是为我们的冷漠所支付的费用，以惩戒我们这个要老祖母去偷面包来喂养孙子的社会。”法庭上一片肃静，在场的每位，包括法官在内都默不作声地捐出了50美分。\n\n这就是著名的\"拉古迪亚的拷问”：一个人为钱犯罪，这个人有罪；一个人为面包犯罪，这个社会有罪......\n\n行文至此，必定会有高高在上的“爱国者”提醒格隆：杨改兰们的贫困是自己不够努力的结果，与社会何干？\n\n我们回到杨改兰“灭门”现场。奶奶杨兰芳见到还未断气的杨改兰时，看到了她的笑容。亲手了结4个亲生骨肉后，她的情绪竟然那么平静而欢愉。奶奶问她究竟怎么了，她用方言说：你不理解。\n\n“你不理解”这四个字，我相信，绝大部分习惯了俯视众生，“何不食肉糜”的城市看客也不会理解。脾气和善，几乎从不抱怨的杨改兰如同大多数中国农村妇女，逆来顺受，勤扒苦做，早已习惯了穷困。对她们而言，穷，并不可怕；比穷更可怕的是失去了希望和信心。\n\n我想，杨改兰说的“你不理解”，应该是指那种对今生和来世都没有希望的绝望感，是那种想挣脱现状却又极端无助的绝望感，是那种靠自身力量，再怎么勤扒苦做，也完全没可能走出贫困的无能为力的绝望感……\n\n事实上，我们必须承认的一点是：对于杨改兰的四个孩子，几乎从一出生，就基本注定了不会有出人头地的机会。杨改兰，杨改兰的孩子，从一开始，就注定是“弱势群体”的那一部分。\n\n梦想是要有的，万一实现了呢？这句励志鸡汤，对杨改兰和她的孩子，就真的是梦想。\n\n所以：真不是杨改兰的问题，确实是社会的问题。\n\n▌尾声、\n\n有解决办法吗？\n\n当然有，不外乎两条：\n\n    1、改造社会阶层流动与晋升、资源占有欲处理、财富创造与分配的机制，压缩顶层，推动底层向中层演进，最终将我们的金字塔社会结构，改造成纺锤形社会结构；\n\n    2、默认并接受底层“弱势群体”的现状无可更改，继续固化社会结构，但对弱势群体输血，在福利上对他们大力度定向倾斜；\n\n第一种方法，有可能吗？\n\n答案是悲观的：基本没有可能。理由掰着脚趾头也能明白。\n\n更现实可行的，无疑是第二种：既然是我们的社会机制必然性地“制造”了弱势群体，社会就有义务和责任去善待他们，至少，让他们的孩子有病能治，有书能读。如果我们有资源让“老干部”群体医无所忧，我们就一定有资源让杨改兰的孩子们能治上病，读上书。\n\n这实质就是给杨改兰们留下一丝卑微而渺小的希望，也是给他们留下活下去的勇气。\n\n怎样对待弱势群体，是一个社会最柔软的部分，恰恰也是一个社会最强大的部分。\n\n一个国家是不是真的强大，一定不是出了多少英明领袖，造了多少核弹，有多少外汇储备，在奥运会拿了多少金牌，GDP增长率多高……，这些和杨改兰们没有毛线关系。\n\n是看你怎么对待你的弱势群体！",
			"post_uri": "1V7usnfmabQXPSNC2zrCpF2ed2jDZaujS_1473658930",
			"date_added": 1473670720
		},
		{
			"comment_id": 16,
			"body": "这不是东西。。。。这是变态！！",
			"post_uri": "15oJLfpirNrTr2Fzhq6reLQ2aJGeDAnLHF_1473665841",
			"date_added": 1473670796
		},
		{
			"comment_id": 17,
			"body": "@Woodsfirezyj: 没用过微博，不知道。应该说类twitter or facebook,你使用就能体会到了。这里言论完全由你自己控制。分布式twitter or facebook，你所发表的东西，就你自己能删除。所有数据都保存在浏览过的节点，无中心，无审查。",
			"post_uri": "15oJLfpirNrTr2Fzhq6reLQ2aJGeDAnLHF_1473665841",
			"date_added": 1473692392
		},
		{
			"comment_id": 18,
			"body": "类twitter  or facebook。",
			"post_uri": "15oJLfpirNrTr2Fzhq6reLQ2aJGeDAnLHF_1473692108",
			"date_added": 1473694591
		},
		{
			"comment_id": 19,
			"body": "你可以用[IPFS](https://ipfs.io)发的.\n\n[IPFS图片](http://ipfs.pics)分布式托管。\n[IPFS视频](https://ipfstube.erindachtler.me)分布式托管。\n\n1.[图片例子](https://ipfs.pics/ipfs/QmUwHMFY9GSiKgjqyZpgAv2LhBrh7GV8rtLuagbry9wmMU)\n2.[视频例子](https://ipfstube.erindachtler.me/ipfs/QmeXSTgXKj8fHX9q7XUDKbvQxTH8MaSU6S5HsBuaBJqYjx)",
			"post_uri": "15oJLfpirNrTr2Fzhq6reLQ2aJGeDAnLHF_1473747560",
			"date_added": 1473762883
		}
	]
}