{
	"next_post_id": 66,
	"next_comment_id": 40,
	"next_follow_id": 29,
	"avatar": "jpg",
	"user_name": "Flyman",
	"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
	"intro": "ZeroNet user.",
	"post": [
		{
			"post_id": 8,
			"body": "Joke: Nikotine kills.\nThere is common legend about 1 gram of nikotine kills a horse. But what will happen to a hamster? 1 gram of nikotine will tear hamster apart to the pieces!\n",
			"date_added": 1470986985
		},
		{
			"post_id": 9,
			"body": "Joke: Cat vs (Bread with butter).\nIt is well known legend that falling cat always grounds to it's legs. And buttered piece of bread always grounds to it's \"buttered\" side. What will happen if you attach this bread to the cat's back so butter will point upward and then drop this \"system\"? We have a video of what happens! Here, on ZeroNet! Go see for yourself: http://127.0.0.1:43110/zatogra.bit/?Topic:1_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t/unlimited+power",
			"date_added": 1471164778
		},
		{
			"post_id": 12,
			"body": "Joke: Sensei and Unteachable student.\nSensei says to one of his students: Take this pencil (student takes one pencil) and break it. Student puts his hands at both ends of this pencil, bends it, and pencil is broken. Then sensei tells same student to take bunch of pencils and try to break them at once. Student takes pencils, tries to bend them, then tries a little harder... And whole bunch of pencils becomes broken. Student was extraordinary strong! Sensei says: there is something you will never understand!",
			"date_added": 1471433305
		},
		{
			"post_id": 13,
			"body": "Joke: Terminator`s replica.\nHasta la windows vista, baby!",
			"date_added": 1471501345
		},
		{
			"post_id": 14,
			"body": "Joke: Insect \"repellent\" cream.\nIt is common for rus/urk males to believe that manly man must not read any instructions or manuals. They are for idiots. Manly man is smart so he can figure out how any mechanism or other thing works just by staring at it. Here is one story about that kind of guy. He and his friends were spending their free time in a forest: camp fire, alcohol, jokes, talks, fun. And then they are under attack of little flying insects seeking for blood. Mr. Manly Man uses his insect \"repellent\" cream on himself with catastrophic result. Because he did not read manual. It was saying: use this cream outside your camp on a rock or a tree, so all insects will be attracted to that spot and will not bother you.",
			"date_added": 1471590743
		},
		{
			"post_id": 15,
			"body": "Fun untranslatable play of words: Doom.\nIn russian language \"to think\" sounds like \"DOOMat`\", \"I am thinking\" sounds like \"Ya DOOMayu\", I was thinking - \"Ya DOOMal\". So in the time DOOM was new cool game, my friends could say something sounds like \"I was thinking few hours today\" and everybody knew he meant he was playing \"DOOM\" all this time.",
			"date_added": 1471785335
		},
		{
			"post_id": 16,
			"body": "Joke: That age.\nI am in that age in which I can say \"I am not in that age...\".",
			"date_added": 1471785509
		},
		{
			"post_id": 17,
			"body": "Find and correct mistakes I made intentionally.\nOnce upon a time in the Cocoon city there were Cinderella corporation. Because of this corporation most of city folks became dummies. In the end of game \"President Devil\" you enter secret underground laboratories. You shoot bunch of dummies then alarm triggers. Alarm was saying something like this: \"Self destruct sequence has been activated. All personal must ejaculate immediately!\"",
			"date_added": 1471786381
		},
		{
			"post_id": 18,
			"body": "Joke: Animal conspiracy.\nIn one forest some animals were alcoholics who developed some kind of cryptography talking to hide fact that they are alcoholics. Instead of saying something that could make them compromised, animals were saying something \"intelligent\". Fox says to Bear: \"I saw Wolf yesterday, he was leaving library building and he was !SO! educated.",
			"date_added": 1471787759
		},
		{
			"post_id": 1472667546,
			"body": "Joke: One leg here, other leg there.\nIn russian language it is common phrase. It is used when 1st person asks 2nd person to go somewhere and to do something there, and 2nd person acknowledge and wants to say he will do this very quickly. I think english have some equivalents - \"consider it done\" or maybe \"I will do it in a blink of an eye!\". So \"one leg here, other leg there\" means one person is so quick, so in one moment his one leg here, and in next moment he is already in other place stepping his other leg.\nHere is actually the joke. If deminer (guy who deactivates mines on a mine field) makes mistake, he can say \"one leg here, other leg there\".",
			"date_added": 1472667525
		},
		{
			"post_id": 1472668793,
			"body": "Joke: infinity/finity.\nIn both russian and english languages there are words \"finite\" and \"infinite\". Both languages have word \"infinity\", but here is a fun thing. In english there is no word \"finity\" and in russian corresponding word means limb. Let me explain you details. \"Infinite\" means something without end. That is exact meaning of russian word \"beskonechiy\" (infinite), i mean something \"bes\" (without) \"konechniy\" (end). So \"beskonechnost\" is \"infinity\", but at same time \"konechnost\" in russian means \"limb\" (hand or/and leg, head maybe, I am not sure about head). So I guess now you can understand following \"play of words\".\nWhen deminer stepped on a mine, he scattered his \"finities\" and then he become \"infinity\".\nP.S. Now you can associate infinity as something without limbs...",
			"date_added": 1472668771
		},
		{
			"post_id": 1472669658,
			"body": "Joke: Wish of a dying man.\nAfter huge battle one survived man with minor wound walks through battlefield. Trenches, dead bodies, other horrors of war. And our survivor hears voice of other person who obviously dying in pain: \"B-b-b-ro-th-th-ther..., kill... me-e-e-e... p-p-l-ease!\". So 1st guy shoots other guy to end his pain, and hears: \"Th-a-a-a-nk y-o-u, b-ro-th-th-ther!\".",
			"date_added": 1472669635
		},
		{
			"post_id": 1473079855,
			"body": "Joke: Philosophical Fleas.\nTwo fleas. Somewhere at The Dog's surface. One flea says to another: \"What do you think, Is there possible life on other dogs?\"",
			"date_added": 1473079831
		},
		{
			"post_id": 1473080077,
			"body": "Joke: Philosophical Fishes.\nTwo fishes. Somewhere in The Aquarium. One fish says to another: \"If, as you say, there is no god, then who the hell is dropping food into the Universe?\".",
			"date_added": 1473080052
		},
		{
			"post_id": 1473081543,
			"body": "Joke: Russian plumber expert.\nTwo russian plumbers are fixing toilet. One of them is very experienced and very proud of himself, other one is a novice. Expert starts to work and asks novice to hand him wrench #1. Novice gives him that wrench. Expert uses it and dives deeper into a toilet so only his legs and his butt are visible. Then expert's hand shows up. \"Give me wrench #2\" experts says. Novice gives him what he asked and expert's hand disappears. Then geiser of shit happens. Expert asks for another wrench. Novice gives. At the end when work is finished and toilet is working well, expert who all covered in shit (literally) says proudly to his apprentice who is absolutely clean: \"Learn from me, son! Or else you always be a guy who only gives a wrenches!\".",
			"date_added": 1473081517
		},
		{
			"post_id": 1473147425,
			"body": "Joke: Canned Food or Fail of the Logic.\nShop. Shelves of canned food. On one shelf there are cans with picture of tomato, so you can guess it is something made of tomato inside. On second shelf there are cans with pictures of cow, sheep, chicken, so it is obvious that it is meat of that animals inside. But then you encounter shelf with cans that have picture of babies/infants smiling at you. What the hell are they selling? I am not gonna eat this!",
			"date_added": 1473147397
		},
		{
			"post_id": 1473148392,
			"body": "Joke: Pessimist vs Optimist.\nNo1: Pessimist is well informed optimist.\nNo2: Pessimist sees dark tonnel, optimist sees light in the end of that tonnel. Realist sees dark tonnel, the light, and incoming train that causes that light.\nNo3: Optimist is a guy who is often been send to hell by others, but he always returns sun-tanned and with souveniers.\nNo4: When pessimist and optimist are trapped inside a labyrinth, pessimist seeks for exit, and optimist hits the walls with his head.",
			"date_added": 1473148363
		},
		{
			"post_id": 1473260333,
			"body": "Fun fact: Russian medicament \"Papazol\".\nThere is drug \"papazol\" (Папазол): http://aptprice.ru/img/papazol-tabletki-n10.jpg But let me explain \"meaning\" of it's name. \"Папа\" means \"Papa\" or \"Father\" or \"Daddy\", and \"зол\" means \"in rage\" or \"very angry\". So if you translate that into english you get \"Dad-in-rage-ium\" or \"Angrydadium\" or something like that. I am not making it up here is another link: http://www.piluli.kharkov.ua/drugs/drug/563/ It contain an instruction how to use and in which case.",
			"date_added": 1473260303
		},
		{
			"post_id": 1473260657,
			"body": "Joke: Fun Slogans of Big Company.\nNo1: We focus on everything.\nNo2: Fake it until you make it.",
			"date_added": 1473260626
		},
		{
			"post_id": 1473624867,
			"body": "I found out there is english version of nice russian cartoon episodes on youtube (lots of episodes). Here is a link: https://www.youtube.com/playlist?list=ELz1kTQoPdsrA My favorite is: number 30 (big race) and number 37 (about honey addicted Bearry).",
			"date_added": 1473624835
		},
		{
			"post_id": 1473704596,
			"body": "Joke: Cat and Vacuum Cleaner.\nTo understand this joke you need to understand two fun things:\n1) In russian there is fun word for vacuum cleaner. It is composite word made from two simple words: dust (пыль [pyl']) and suck (сосать [sosat']) - dustsucker (пылесос [pylesos]).\n2) Consider you start to do something you never did before. It is unusual, discomfort, you obviously feel lack of skill. And after some time you doing that unusual \"thing\" your skill improves and you feel better, you feel used to it. In russian there is fun words for that - \"to be sucked in\" (втянуться [wtyanut'sya]). It means you \"sucked into the process\", you \"get used to it\", you \"become involved\".\nHere is the joke. Our cat at first was very frightened by vacuum cleaner while it was in use. But eventually the cat (got used to it)/(was sucked in).",
			"date_added": 1473704563
		},
		{
			"post_id": 1474015448,
			"body": "Fun thing from my memomry: Waku Waku 7.\nThere is a fun game \"Waku Waku 7\". It is fighting game, very exciting one, and it is parody of other games. I was playing a lot this game about 10 years ago. https://www.youtube.com/watch?v=K0vR5PS1afo My friends were playing \"Quake 3\" at that time. It is multiplayer deathmatch 3d-shooter.\nSo I said to one of my friends: \"Lets play Waku Waku 7\"!. And he answered: \"No, lets play Quaku Quaku 3\"!.",
			"date_added": 1474015414
		},
		{
			"post_id": 1474018732,
			"body": "Joke: Epicenter.\nThere is big group of russian jokes about what \"stupid sergeant\" in the army says to \"teach a meaning of life\" to privates. Some of them looks like based on real life, some of them obviously made up. But anyway they often are very funny. So here are some of them:\nNo.1. Missile never misses an epicenter.\nNo.2. There were N flying aircrafts... No N is too small number. Lets say there were M flying aircrafts... And both of them were jets.\nNo.3. The dog is an animal covered with fur for military service purpose. And it has four legs by it's corners.\nNo.4. If you are stupid and have bad memory then get yourself a textbook and write things there like I do myself.\nNo.5. Cosinus value can reach 4 at wartime!\nIn russian there is saying \"to do at fresh head\". It means to do something when you are not tired or when your mind is clear. So here comes number 6.\nNo.6. Good soldier must clean his boots at evening to be able to put them on fresh head next morning.",
			"date_added": 1474018697
		},
		{
			"post_id": 1474108789,
			"body": "Article Translation: Inner moral vs Outer moral.\n\nЧто такое мораль и нравственность.\nWhat is outer moral and inner moral.\n\nМораль - принятая в данном конкретном обществе система норм и ценностей, призванная регламентировать взаимоотношения людей.\nOuter moral is system of norms and values accepted in specific society, which designed for regulation of people relations.\n\nНравственность - неукоснительное соблюдение человеком своих внутренних принципов, носящих при этом всеобщий, универсальный характер.\nInner moral is person's strict abidance of his own inner principles, which has property of being global, universal.\n \nСравнение морали и нравственности.\nComparison of outer moral and inner moral.\n\nВ чем же разница между моралью и нравственностью?\nWhat the difference between outer moral and inner moral?\n\nМораль и нравственность - фундаментальные философские категории, которые находятся в ведении науки этики. Но смысл, который они несут, различен. Сущность морали состоит в том, что она предписывает или запрещает конкретные людские действия или поступки. Мораль формируется социумом, а потому она всегда отвечает интересам определенной группы (национальной, религиозной и т.д.). Задумайтесь, даже у преступных кланов есть своя мораль! При этом им обязательно противостоит другая часть общества - со своими устоями и нормами, а из этого следует, что моралей одномоментно может быть великое множество. Обычно мораль зафиксирована в законе (кодексе), в котором закреплены определенные нормы поведения. Каждый поступок человека согласно данному закону оценивается обществом негативно или позитивно. Интересно, что в одном и том же социуме мораль может со временем измениться до неузнаваемости (как, например, произошло в России в XX веке), диктуя прямо противоположные принципы поведения.\nOuter and inner moral are fundamental philosophical categories, which are subjects of ethics science. But meaning of those two words has differences. Essence of outer moral is to dictate and forbid specific human actions and doings. Outer moral is forming/creating by society, and because of that it is always serves for interests of specific group of people (national group, religious group and so on). Think about it, even criminal clans have their own outer moral! And at same time this criminal group is necessarily opposed by other part of society which has it's traditions and norms, and what is follows from that is there can be very big number of \"outer moral\"s at same time. Usually outer moral established in The Law (Codex), in which specific norms of behavior are fixated. Every deed of person is judjed as negative or positive by that law/codex. It is interesting, in the same society outer moral can change in time to unrecognisable state (as, for example, what happened in Russia in 20th century), dictating antithetic (quite opposite) principles of behavior.\n\nOтличие морали от нравственности.\nDifference of outer moral and inner moral.\n\nНравственность же неизменна по содержанию и крайне проста по форме. Она абсолютна и выражает интересы человека (и человечества) в целом. Одними из главных нравственных ориентиров считаются отношение к другому, как к самому себе, и любовь к ближнему, а значит, нравственность изначально не приемлет насилия, презрения, унижения, ущемления чьих-либо прав. Наиболее нравственно поступает тот человек, который совершает нравственные поступки, даже об этом не задумываясь. Он просто не может вести себя по-другому. Мораль направлена в первую очередь на самоутверждение, а нравственность - на бескорыстный интерес к другому человеку. Нравственность наиболее близка к идеалу, к универсуму.\nInner moral is unchangable in it's content and very simple in it's form/shape. It is absolute and express interests of person (and humanity) in common. One of main reference points of inner moral is: attitude for other person as if you dealing with yourself, love for close people, and this means that inner moral from beginning doesn't allow violence, contempt, humiliation, limiting of someone's rights. Most \"inner moral\" person is person who do \"inner moral\" deeds, even without thinking about it. This person can't behave other way. Outer moral directed (in 1st place) for self-affirmation, but inner moral - for non-selfish/non-profitable interest to other person. Inner moral more close to the ideal, to universum.\n\nОтличие морали от нравственности.\nDifferences between outer moral and inner moral.\n\nНравственность связана с духовной, а мораль - с социальной сферой.\nInner moral is related to spiritual/mind sphere, outer moral is related to social sphere.\n\nНравственности свойственно постоянство, мораль же крайне изменчива.\nInner moral tend to be solid/unchangable, Outer moral is very changable.\n\nНравственность едина для всех, а моральных устоев великое множество.\nInner moral is one for all, but there are big number of \"outer moral\"s.\n\nНравственные устои абсолютны, а моральные - условны (зависят от места и времени).\nInner moral is absolute, but outer moral is relative (from place to place and from time to time).\n\nМораль стремится соответствовать некому образцу (обычно где-то прописанному), нравственность основывается на <внутреннем законе>.\nOuter moral tends to match some image (usually written somewhere), inner moral based on \"inner law/order\".\n",
			"date_added": 1474108753
		},
		{
			"post_id": 1474138033,
			"body": "Strange: It works now.\nIt is very strange. I can unfollow now. It just works now. I click \"x\" in green circle and it just works. User name disappears from the list. Why it did not work until now? And why it has started to work all this sudden? Mystery! It is \"following rush\" on my to do list for near future. I feel happier. :-]\nBut here is another problem. ZeroMePlus shows only 1000 of ZeroMe users. And ZeroMe shows 1600+ user names. So for now I need to use ZeroMe (not ZeroMePlus) to \"hunt\" whom to follow. But it is minor. I CAN UNFOLLOW NOW! I am so happy. :-]",
			"date_added": 1474137995
		},
		{
			"post_id": 1474185772,
			"body": "Joke: Shortest joke.\nThis is shortest joke I ever encounter. I mean joke which made me laugh hysterically for 20-30 seconds. And then at that day every time it popped up in my mind I smiled widely. Now I remember there were another joke that fits same description.\nNo.1. Passive necrophile. (advanced imagination required).\nNo.2. Locksmith-Gynecologist. (In USSR it was common to have \"dual-class\" professions).",
			"date_added": 1474185733
		},
		{
			"post_id": 1474272706,
			"body": "Joke: Doctor and Greedy patient.\nPatient: \"Doctor, give me some pills to cure my greediness. And give me !LOTS! of them! LOTS OF THEM!\"",
			"date_added": 1474272666
		},
		{
			"post_id": 1474272975,
			"body": "Joke: Doctor and Unconfident patient.\nPatient: \"Doctor, I am so unconfident person, so nobody seems to listen to me, everybody completely ignore me because of that. What should I do?\"\nDoctor: \"Who is there?\", \"I think I hear something!\".",
			"date_added": 1474272934
		},
		{
			"post_id": 1474273245,
			"body": "Joke: Evil Doctor.\nDoctor: \"Take those pills. Eat one before you sleep in the evening. And tomorrow in the morning (in case you wake up) eat another two pills\".",
			"date_added": 1474273203
		},
		{
			"post_id": 1474273681,
			"body": "Joke: Gloomy Doctor.\nPatient before serious surgery operation: \"Doctor, will I live?\".\nDoctor: \"What the sense? What is the meaning of life after all?\".",
			"date_added": 1474273638
		},
		{
			"post_id": 1474398564,
			"body": "Idea: Antifollowing (or Black) list.\nI stared at Erotic's picture, which represent a person in ZeroMe. I was thinking... And now I think it can be very nice to have something like \"antifollowing\" or \"blacklist\" feature to be able to completely ignore some personas I do not want to see.",
			"date_added": 1474398519
		},
		{
			"post_id": 1474534231,
			"body": "Epub is not text format.\nI have downloaded book \"things you make and do in 4th dimension\" in \"new\" format epub. First I was sad about that. Epub? now I have to find epub-reader or something, but it looks like epub is just bunch of html files with pictures. Epub file behaves like a zip file. You can unpack files you already know from this so called epub. They are trying to confuse someone again. Not this time. So be aware of this fact - epub is not new freaking text format like pdf, djvu. It is simply zipped bunch of html! Jeez, I hate those guys trying to make my life more complicated. I still think txt with 80 symbols in a line is best text format! It is simpliest format you can imagine.",
			"date_added": 1474534185
		},
		{
			"post_id": 1474575552,
			"body": "Joke: Old man and little girl with a cat.\nOld man passes by a little girl playing with her cat. Old man was in sentimental mood and looking at child reminded him his youth, so he smiled and asked the girl friendly: \"May I caress your pussy?\". Girl took her cat and ran away in hurry. Old man was thinking: \"Strange, what is wrong with this kid? Why she was so scared? Is my old face so scary?\".",
			"date_added": 1474575505
		},
		{
			"post_id": 1474577170,
			"body": "Joke: Alkashnikov's Kalashmat.\nIt is hard to translate this joke into english language. It is play of words. In russian \"Kalashnikov's Assault Riffle\" sounds like \"Automat Kalashnikova\" and it means that this weapon is automatic and named in favor of Mr. Kalashnikov. Word \"kalashmat\" doesn't exist in russian language but for russian guy it sounds like it is device for beating up some target very hard and with high frequency. Word \"Alkashnikov\" sounds like last name, reminds of Kalashnikov but strongly associated with word \"alcash\" which means regular alcohol drinker. So what kind of device can be called Alkashnikov's Kalashmat. It may be invention of some constantly/permanently drunk guy to automaticaly punch/kick his friends/enemies who most likely are alcoholics too.",
			"date_added": 1474577122
		},
		{
			"post_id": 1474657261,
			"body": "Joke: Shtirlitz and mind blow.\nThere is a big group of russian jokes about Shtirlitz. To have a chance to understand them you first need to know who is Shtirlitz. Shtirlitz is russian secret agent or spy who infiltrated german nazis during world war 2 or something like that. He is a fictional character, some kind of James Bond. Also in russian language when you need to think about something you can say \"to throw my brains around\" (пораскинуть мозгами [poraskinut' mozgami]). So here comes the joke.\nShtirlitz got shot to his head. \"Hmm, this bullet is explosive\" thought Shtirlitz throwing his brains around.\nP.S. you can say also \"it made his mind blow\".",
			"date_added": 1474657211
		},
		{
			"post_id": 1474658021,
			"body": "Joke: Shtirlitz became alert.\nShtirlitz and his wife were walking down the street. Suddenly, Shtirlitz heard gun shot, and his wife was fallen. Shtirlitz became alert a little.",
			"date_added": 1474657970
		},
		{
			"post_id": 1474658712,
			"body": "Joke: Shtirlitz and Elephants.\nOne guy was at his home when somebody was knoking his door. Man at home opens door and sees suspicious stranger who says conspiraciously: \"Elephants go to the South!\". Man at home  responded: \"Elephants go to HELL, Shtirlitz lives at second floor!\".",
			"date_added": 1474658660
		},
		{
			"post_id": 1474659030,
			"body": "Joke: Shtirlitz.\nShtirlitz was shooting blindly. Blindly was shot and died.",
			"date_added": 1474658977
		},
		{
			"post_id": 1474659658,
			"body": "Joke: 3 spiders in the jar.\n3 spiders were locked in a jar by some scientist. After some time scientist was checking them and discovered that all spiders disappeared. Scientist was thinking: \"Hmm, interesting, they must have been ate one another!\".",
			"date_added": 1474659604
		},
		{
			"post_id": 1474903876,
			"body": "Lets test new features of ZeroMe (Bad Ugly) and (Spam).\nConsider this message as very ugly and spam, go click new options. I am curious what will happen. :-]",
			"date_added": 1474903821
		},
		{
			"post_id": 1474904938,
			"body": "Joke: Circus and some troller.\nCircus. Announcer: \"Now at the arena clowns will entertain you\"; audience: \"Yey! hurray!\"; somebody from far seats: \"Booo! Booo! Clowns are sux! Booo! Booo!\". After some time announcer: \"Now at the arena acrobats will entertain you\"; audience: \"Nice, hurray!\"; somebody from far seats: \"Booo! Booo! Acrobats are sux! Booo! Booo!\". Then same thing happen to elephant entertainment, and tigers jumping through flaming rings. Announcer: \"And now you will see special event, 1st time at whole history of this circus, brave man will be used as ammo for a big cannon. Audience: \"Yey! Hurray!\". Somebody from far seats: \"This is sux! Booo! Booo!... Hey? What's going on? Why are you grabbing me? Where are you taking me?!!\"",
			"date_added": 1474904882
		},
		{
			"post_id": 1474905268,
			"body": "Joke: Doctor and Patient.\nPatient: \"Doctor, every part of my body is in terrible pain. When I touch my head it hurts. When I touch my belly it hurts. When I touch my arms, legs, back or butt it hurts\".\nDoctor, after examining patient: \"Oh, I see, your finger is broken!\".",
			"date_added": 1474905211
		},
		{
			"post_id": 1474905403,
			"body": "Joke from \"Steal This Show\" podcast.\nIt is another short one. Ukrainian Uranium.",
			"date_added": 1474905345
		},
		{
			"post_id": 1475004902,
			"body": "Joke: Doctor's Report and Foreign Body.\nI g??gled a little and it seems like english language has the same strange property too. There is fun \"foreign body\" thing. Those words associated with medicine, and they have meaning that something that is not part of your body is stuck in your body. So here is a joke.\nOne patient came to doctor with stewpot on his head. Head was completely stuck in it, so patient had to ask medical assistance to remove it. Official doctor's diagnosis was something like this: \"Patient's head is in foreign body\".",
			"date_added": 1475004843
		},
		{
			"post_id": 1475314640,
			"body": "Joke: Antitrolling tactics. Introduction (Explanation).\nThose jokes are based on my experience. About 5 years ago it was common in my life to some \"smart ass\" trying troll me by asking questions not to get my answer but (now I understand clearly) just to mock me. I played this game by pretending that asking guy is serious and my goal is to answer correctly. If I did this successfully, \"smart ass\" started to feel very stupid, angry, disappointed. In that case I won the game. So it may be new serie of jokes I call \"antitrolling tactics\". If something pops up in my mind, I will try to describe it.",
			"date_added": 1475314580
		},
		{
			"post_id": 1475315957,
			"body": "Antitrolling Tactics Fun: Believing in God.\nMany trolls asked me the same question: \"Do you believe in God?\". I tried different responses and now I can't remember them, I was naive, stupid, I didn't understand they are mocking me, and tried to answer honestly, but it always ended humiliating for me. Now I am \"evil\" and consider this as some kind of game like chess. It is like they make move e2-e4 and there are strong and week responses for that move. And here is a strong one I developed for myself: \"Which one god are you asking me about?\" or simply \"In which one?!\". Now I know I am not only one who was so \"smart\" to \"find\" that \"move\". It is a very strong move. Most trolls I tried this on were starting to \"go reverse\"/\"change subject\". Even those who wished to continue this game were feeling like they lost this game. In that position you can \"teach them a lesson\" about history, about fact that there are many different cultures, different religions, different modification of same religion in different places and/or in different times, and they (trolls) have to listen to you because they asked for it! And in this position you have plenty possibilities to show them how you are smart and how they are stupid.\nP.S. Being evil feels good!",
			"date_added": 1475315896
		},
		{
			"post_id": 1475739367,
			"body": "Sharing files by torrent client and posting magnet link.\nI am in search for nice way to share files with someone through the internet. Recently, I became aware that magnet link is just sequence of about 20-40 text symbols. So my idea is to open file/folder (of what I want to be sent to other person) in torrent client, post a magnet link in chat or here in ZeroMe. However first try didn't work out. I was seeding, receiving person says it always were 0 of 0 peers. So I want to figure out what is wrong with the idea. Here is magnet link for audio book \"Wisdom of Psychopaths\": magnet:?xt=urn:btih:96095659B476046B19EA3AFA0A028FC1052EB88A&dn=__wisdom_of_psychopaths Can anybody try to download this? Or tell me where I am mistaking if that shouldn't work in 1st place.",
			"date_added": 1475739305
		},
		{
			"post_id": 1475780157,
			"body": "Joke: Toxic Waste Warning.\nWarning! Jumping into toxic waste does not give you super powers. May cause adverse health effects: http://127.0.0.1:43110/zatogra.bit/?Topic:3_1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN/Toxic+Waste+Warning",
			"date_added": 1475780094
		},
		{
			"post_id": 1475841646,
			"body": "Translation of fun songs.\nToday I translated two songs (made by Enjoykin) from russian into english. Few months ago I translated two songs from ukrainian into english. Here is a magnet link: magnet:?xt=urn:btih:dbf535eded36efd5e383dccd60c0805a237861aa&dn=__flyman_2016_10_07 Hash is: dbf535eded36efd5e383dccd60c0805a237861aa Few words about contents:\n1. Yizhachok - fun and sad song about little hedgehog.\n2. Karawan - fun and not sad song about caravan vs dogs conflict.\n3. Brezhnew's New Year Greatings - President of USSR new year speech-song.\n4. Klichko - philosophical speech of ukrainian boxer-politician (yes, \"dual-class\" profession again) about advanced skills of time perception.\n5. I am also included 5 mp3s I created few years ago when I played a little with FL-Studio music editor.",
			"date_added": 1475841582
		},
		{
			"post_id": 1475848361,
			"body": "Oh, it looks like Enjoykin made some english songs too. They are fun and need no translation. Here are some links:\n.1. The building is on fire: https://www.youtube.com/watch?v=RLuVVIztVXA\n.2. It is all about the rain: https://www.youtube.com/watch?v=DLF2m10EswI\nAnd Enjoykin made song translations from russian into cat language!\n.1. https://www.youtube.com/watch?v=NlxSW2dxUWo\n.2. https://www.youtube.com/watch?v=6sBfJDcVTXw\n.3. https://www.youtube.com/watch?v=ujMzuKoDfw0\nI think Enjoykin is great.",
			"date_added": 1475848296
		}
	],
	"post_like": {
		"1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1473785042": 1473785315,
		"15ySnmVuP2xGCWGxfbDdpjQxajSndfkmyL_1474001652": 1474013845,
		"19rk3ktkoBozUXDEpVHjUNoJNGCnsbzPra_1474065050": 1474119526,
		"1M29UgKTUcDsSHafheTS2W8Ec9RZiNMvRk_1473443056": 1474286360,
		"1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1474994523": 1475002875,
		"1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY_1475327310": 1475352898,
		"1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY_1475329176": 1475353708,
		"1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475777634": 1475780397
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Nofishes: what is this chinese text here? Did you translated this joke into chinese? Do you know chinese language?",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_12",
			"date_added": 1471455343
		},
		{
			"comment_id": 2,
			"body": "Link, please!",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1473785042",
			"date_added": 1473785334
		},
		{
			"comment_id": 3,
			"body": "I was hoping for something I can download and listen with my pocket player. But thank you anyway.",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1473785042",
			"date_added": 1473786026
		},
		{
			"comment_id": 4,
			"body": "Here is example of podcast I listen regularly: https://radio-t.com/ It is russian podcast so it may be useless for you, but what I want to say - it is easy to download mp3 from sites like that one. And when site hides \"download possibility\" or tries to feed me \"some bullsh*t\" I just prefer to seek for other things to do. :-]",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1473785042",
			"date_added": 1473788845
		},
		{
			"comment_id": 5,
			"body": "@Talnicrom: Try to unfollow me, please. And tell me does this work for you. If it works, you can follow me again if you want. Oh, sorry, I confused you for guy who follows me.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474136251",
			"date_added": 1474136879
		},
		{
			"comment_id": 6,
			"body": "Anyone who follows me, please, try to unfollow me and tell me does it work for you or not.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474136251",
			"date_added": 1474137137
		},
		{
			"comment_id": 7,
			"body": "@Talnicrom: Oh, one mystery solved. So it was you who fixed my \"unfollow\" problem? :-]",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474138033",
			"date_added": 1474140127
		},
		{
			"comment_id": 8,
			"body": "@Talnicrom: Another nice way to \"hunt\" for whom to follow is \"everyone\" mode and \"activity feed\" list. What about hashtags? Is it enough to type something like \"#myHashtag\" inside a post to associate this post with some topic?",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474138033",
			"date_added": 1474140956
		},
		{
			"comment_id": 9,
			"body": "I do not know what facebook is, and I do not want to know what is it (a can guess it is something like ZeroMe). And with ZeroNet you do not have to! Pink Floyd \"The Wall\" says: \"we don't need no force control. Teachers, leave us kids alone!\". :-]",
			"post_uri": "1M29UgKTUcDsSHafheTS2W8Ec9RZiNMvRk_1473443056",
			"date_added": 1474286742
		},
		{
			"comment_id": 10,
			"body": "@Talnicrom: I just checked this. I still can not unfollow using ZeroMe, but I can do it using ZeroMePlus. So it doesn't matter did you anything or not, it is still makes difference to use ZeroMePlus instead of ZeroMe!",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474398564",
			"date_added": 1474481308
		},
		{
			"comment_id": 11,
			"body": "@Hankrearden: That is the point! To find russian joke which is very funny and to have a trouble to translate it into english without being lost in translation and without loss of humor. So in that one I think I failed. And this is great.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474577170",
			"date_added": 1474581706
		},
		{
			"comment_id": 12,
			"body": "Try this sequence:\n1. Create a Test post.\n2. Do a pixel hunting between picture representing you (your awatar) and your post.\n3. Find pencil symbol which should appear and click it.\n4. Then options \"cancel/delete/save\" should appear.\n5. Use \"delete\"!",
			"post_uri": "1674XymFPbmAXh78xEpt3Pehtko6i2kvtA_1474653769",
			"date_added": 1474654795
		},
		{
			"comment_id": 13,
			"body": "@weakish: Because Shtirlitz is very cool super spy, so he can do coldblooded thinking in very difficult situations.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474657261",
			"date_added": 1474818729
		},
		{
			"comment_id": 14,
			"body": "@weakish: this joke is both russian and english because of same \"unhealthy\" association of word \"pussy\" with... same thing that is not a little cat! This is true for both english and russian language.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474575552",
			"date_added": 1474819049
		},
		{
			"comment_id": 15,
			"body": "Did anybody try it already? From my point of view nothing is happening.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474903876",
			"date_added": 1474904943
		},
		{
			"comment_id": 16,
			"body": "Oh, it looks like this new features are filters which are individual for every user. So it is not like \"like\"s or \"antilike\"s.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474903876",
			"date_added": 1474905629
		},
		{
			"comment_id": 17,
			"body": "@Talnicrom: This is great! Now we can \"like\" comments here.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474903876",
			"date_added": 1474915054
		},
		{
			"comment_id": 18,
			"body": "@Talnicrom: About messages which are marked as spam or ugly by guys I follow. I do not know is this a good idea. I think for start/test it can be nice to have some indication... I mean it is good to see some warning sign that one of your friends marked this post as a spam or it is ugly rather than hide this post.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474903876",
			"date_added": 1474915549
		},
		{
			"comment_id": 19,
			"body": "@weakish: Here is another strange coincidence: why in both russian and english languages word \"to nut\" (he went nuts, он рехнулся (\"орех\" [orekh] is \"nut\" in russian)) as a verb is associated with madness/crazyness/insanity. I mean, what is a connection between nut and insanity? It is one of linguistic mysteries! :-]",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474575552",
			"date_added": 1475258646
		},
		{
			"comment_id": 20,
			"body": "@weakish: and another fun thing: I have read book about black holes and history of science about black holes. And in this book it was told French people considered term \"black hole\" as something unspeakable like english word \"f??k\". And the meaning of these french \"black holes\" were the same: \"NOT a little pussy cat\"!",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474575552",
			"date_added": 1475259188
		},
		{
			"comment_id": 21,
			"body": "Imagine what can happen if someone throw his poodle out of house and it will become wild. Wild Dire Poodle (not cute anymore). Scary.",
			"post_uri": "1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY_1475327310",
			"date_added": 1475353183
		},
		{
			"comment_id": 22,
			"body": "Magnet link is just little string (bunch of text symbols). Something that begins like \"magnet:?xt=urn:bla-bla-bla-bla-bla...\" and ends before next \"=\" symbol. How it possibly can not work? You just need to copypaste text to your torrent client. I hope this will help you.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1475400513",
			"date_added": 1475504721
		},
		{
			"comment_id": 23,
			"body": "@Dergatt: Yes, that is annoying. I mean, when you searching for something and you find at last some (download link)/(magnet link)/(torrent)... and it doesn't work! Sad thing. It is \"pointers and objects\" thing (pointers are not objects they point to), or it is \"map and territory\" thing, or... I am short of analogies. Oh, here is good analogy: it is like someone tell you there is an apple on a table, you check the table, but there is no apple for some reason. Annoying.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1475400513",
			"date_added": 1475609422
		},
		{
			"comment_id": 24,
			"body": "And I got audiobook \"Wisdom of Psychopaths\". One big 400Mb mp3 file. I've splitted it into 10 parts 50 minutes each wav, made them loud, encoded into mp3 again and load them into my \"pocket\" mp3 player. This made me happier for a while. What a joke: psychopath needs to split something into pieces!",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475609939",
			"date_added": 1475612134
		},
		{
			"comment_id": 25,
			"body": "@meidan: here is a magnet link for audiobook \"Wisdom of Psychopaths\" after my manipulations: magnet:?xt=urn:btih:96095659B476046B19EA3AFA0A028FC1052EB88A&dn=__wisdom_of_psychopaths It is new way for me to share files, so I am not sure if it works or not. I will be glad to know if you successfully download mp3s. Hash is: 96095659b476046b19ea3afa0a028fc1052eb88a Wait a minute, it looks like hash of a torrent is part of magnet link of a torrent.",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475609939",
			"date_added": 1475655091
		},
		{
			"comment_id": 27,
			"body": "@meidan: I am seeding now, but it looks like nobody downloading. I will be online for about 2 hours from now... After 2 hours nothing happens. I am about to go offline. Next time I will try to ask people to download this torrent. Maybe I am not understand how it works and made some mistake.",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475609939",
			"date_added": 1475692210
		},
		{
			"comment_id": 28,
			"body": "@Voruman: how about this one? magnet:?xt=urn:btih:96095659B476046B19EA3AFA0A028FC1052EB88A&dn",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1475739367",
			"date_added": 1475740545
		},
		{
			"comment_id": 29,
			"body": "Or simply using hash: 96095659B476046B19EA3AFA0A028FC1052EB88A",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1475739367",
			"date_added": 1475740617
		},
		{
			"comment_id": 30,
			"body": "Oh, It looks like someone managed to download! Is that you, Voruman?",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1475739367",
			"date_added": 1475740904
		},
		{
			"comment_id": 31,
			"body": "@Voruman: strange, I think I start to understand you without translator. Jes looks like Yes, laboras looks like labour (hard work). So hash works, and my magnet link doesn't. Thanks, it helps a lot.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1475739367",
			"date_added": 1475741141
		},
		{
			"comment_id": 32,
			"body": "@meidan: Voruman managed to download this torrent using hash. And it looks like something wrong with my understanding of magnet link, so magnet link doesn't work. Try to use hash: 96095659b476046b19ea3afa0a028fc1052eb88a",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475609939",
			"date_added": 1475741330
		},
		{
			"comment_id": 33,
			"body": "@Voruman: is that so? All you need to fix my magnet link to make it work is change all capital/big letters into noncapital/small letters? I will check this hypothesis next time I try to send something via magnet link. It is very funny! :-]",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1475739367",
			"date_added": 1475741977
		},
		{
			"comment_id": 34,
			"body": "@meidan: Voruman says this link works: magnet:?xt=urn:btih:96095659b476046b19ea3afa0a028fc1052eb88a&dn=__wisdom_of_psychopaths It is strange and funny, but all I need to fix magnet link to make it work is \"decapitalize\" big letters into small ones.",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475609939",
			"date_added": 1475742224
		},
		{
			"comment_id": 36,
			"body": "@meidan: I love very much movies where time travel is involved. Here is example: https://www.youtube.com/watch?v=UTO0ogdNMdY It lasts less than 20 minutes, but it is worthy time travel movie. Here is list of time travel movies I am using: https://en.wikipedia.org/wiki/List_of_time_travel_works_of_fiction be careful not to mess movies list with book list - they both on the same page. Strange, I can't find movie \"Paradox\" 2016, maybe because it is new movie. It is nice time travel movie. Here is some films from that list I found nice: \"Coherence\" 2013, \"About Time\" 2013, \"Mine Games\" 2012, \"Source Code\" 2011, \"FAQ About Time Travel\" 2009 (It is fun half comedy film). And movie with 4 or 5 seasons \"Continuum\" 2012-2015. But I watched them so now I don't. If you want to know what I am watching currently, it is: \"Supernatural\" (watched 5 seasons of 9 or 10, 6th to go), \"Californication\" (you may found this show disgusting, but it is about guy from X-Files, and I watched 5 seasons before, so I am hooked and want to continue watch it just because!), Simpsons (23th season).",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475609939",
			"date_added": 1475778555
		},
		{
			"comment_id": 37,
			"body": "It can be happening because you study too much. Be sure you do not study more than 10 hours per day! I am 50% serious! And do not forget to sleep, it may cause hallucinations. :-]",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475777634",
			"date_added": 1475780370
		},
		{
			"comment_id": 38,
			"body": "https://www.youtube.com/watch?v=1g0KThAbkjU",
			"post_uri": "1CPx3458RryZUzbz2vBUpomG2ihbcNgg6w_1475769382",
			"date_added": 1475781293
		},
		{
			"comment_id": 39,
			"body": "Status: seeding.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1475841646",
			"date_added": 1475845195
		}
	],
	"follow": [
		{
			"follow_id": 3,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1BFTNXtYQDMCurqyg45KLmsV6oJD7bQSsH",
			"user_name": "Silverstorm",
			"date_added": 1470992137
		},
		{
			"follow_id": 4,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1CTut2qbaj54ZjNoYeuWSGwV75iVieKY6N",
			"user_name": "Quadrangle",
			"date_added": 1470992640
		},
		{
			"follow_id": 6,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1CTut2qbaj54ZjNoYeuWSGwV75iVieKY6N",
			"user_name": "Quadrangle",
			"date_added": 1471163582
		},
		{
			"follow_id": 9,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1BFTNXtYQDMCurqyg45KLmsV6oJD7bQSsH",
			"user_name": "Silverstorm",
			"date_added": 1471163606
		},
		{
			"follow_id": 21,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "156HySyXH37jFXXqKCwVq8HqsrZLZzy8Qx",
			"user_name": "rushka life feed",
			"date_added": 1473618993
		},
		{
			"follow_id": 22,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS",
			"user_name": "ZAlex",
			"date_added": 1473709146
		},
		{
			"follow_id": 23,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS",
			"user_name": "ZAlex",
			"date_added": 1473924817
		},
		{
			"follow_id": 24,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa",
			"user_name": "Talnicrom",
			"date_added": 1474138826
		},
		{
			"follow_id": 25,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ",
			"user_name": "ulrichard",
			"date_added": 1474357964
		},
		{
			"follow_id": 28,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC",
			"user_name": "meidan",
			"date_added": 1475782553
		}
	],
	"comment_order": 1,
	"settings": {
		"reverse_comment_order": true,
		"mute_ugly": false,
		"mute_spam": false,
		"mute_blocked": false
	},
	"flags": {
		"post-1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474903876": 0
	},
	"blocked": [
		"14fdwxPt83nTw5vFaXTCR7KQkAxkXuGbAR"
	],
	"comment_like": {
		"19M1DT5vruSATEcbEczYRwCk2uPuLcATBa_29": 1475354406,
		"13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_14": 1475609431
	}
}