{
	"next_post_id": 122,
	"next_comment_id": 120,
	"next_follow_id": 31,
	"avatar": "jpg",
	"user_name": "Flyman",
	"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
	"intro": "Eng/Rus Paranoid/Psychopath ZeroNet user.",
	"post": [
		{
			"post_id": 9,
			"body": "Joke: Cat vs (Bread with butter).\nIt is well known legend that falling cat always grounds to it's legs. And buttered piece of bread always grounds to it's \"buttered\" side. What will happen if you attach this bread to the cat's back so butter will point upward and then drop this \"system\"? We have a video of what happens! Here, on ZeroNet! Go see for yourself: http://127.0.0.1:43110/zatogra.bit/?Topic:1_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t/unlimited+power",
			"date_added": 1471164778
		},
		{
			"post_id": 12,
			"body": "Joke: Sensei and Unteachable student.\nSensei says to one of his students: Take this pencil (student takes one pencil) and break it. Student puts his hands at both ends of this pencil, bends it, and pencil is broken. Then sensei tells same student to take bunch of pencils and try to break them at once. Student takes pencils, tries to bend them, then tries a little harder... And whole bunch of pencils becomes broken. Student was extraordinary strong! Sensei says: there is something you will never understand!",
			"date_added": 1471433305
		},
		{
			"post_id": 13,
			"body": "Joke: Terminator`s replica.\nHasta la windows vista, baby!",
			"date_added": 1471501345
		},
		{
			"post_id": 14,
			"body": "Joke: Insect \"repellent\" cream.\nIt is common for rus/urk males to believe that manly man must not read any instructions or manuals. They are for idiots. Manly man is smart so he can figure out how any mechanism or other thing works just by staring at it. Here is one story about that kind of guy. He and his friends were spending their free time in a forest: camp fire, alcohol, jokes, talks, fun. And then they are under attack of little flying insects seeking for blood. Mr. Manly Man uses his insect \"repellent\" cream on himself with catastrophic result. Because he did not read manual. It was saying: use this cream outside your camp on a rock or a tree, so all insects will be attracted to that spot and will not bother you.",
			"date_added": 1471590743
		},
		{
			"post_id": 15,
			"body": "Fun untranslatable play of words: Doom.\nIn russian language \"to think\" sounds like \"DOOMat`\", \"I am thinking\" sounds like \"Ya DOOMayu\", I was thinking - \"Ya DOOMal\". So in the time DOOM was new cool game, my friends could say something sounds like \"I was thinking few hours today\" and everybody knew he meant he was playing \"DOOM\" all this time.",
			"date_added": 1471785335
		},
		{
			"post_id": 16,
			"body": "Joke: That age.\nI am in that age in which I can say \"I am not in that age...\".",
			"date_added": 1471785509
		},
		{
			"post_id": 17,
			"body": "Find and correct mistakes I made intentionally.\nOnce upon a time in the Cocoon city there were Cinderella corporation. Because of this corporation most of city folks became dummies. In the end of game \"President Devil\" you enter secret underground laboratories. You shoot bunch of dummies then alarm triggers. Alarm was saying something like this: \"Self destruct sequence has been activated. All personal must ejaculate immediately!\"",
			"date_added": 1471786381
		},
		{
			"post_id": 18,
			"body": "Joke: Animal conspiracy.\nIn one forest some animals were alcoholics who developed some kind of cryptography talking to hide fact that they are alcoholics. Instead of saying something that could make them compromised, animals were saying something \"intelligent\". Fox says to Bear: \"I saw Wolf yesterday, he was leaving library building and he was !SO! educated.",
			"date_added": 1471787759
		},
		{
			"post_id": 1472667546,
			"body": "Joke: One leg here, other leg there.\nIn russian language it is common phrase. It is used when 1st person asks 2nd person to go somewhere and to do something there, and 2nd person acknowledge and wants to say he will do this very quickly. I think english have some equivalents - \"consider it done\" or maybe \"I will do it in a blink of an eye!\". So \"one leg here, other leg there\" means one person is so quick, so in one moment his one leg here, and in next moment he is already in other place stepping his other leg.\nHere is actually the joke. If deminer (guy who deactivates mines on a mine field) makes mistake, he can say \"one leg here, other leg there\".",
			"date_added": 1472667525
		},
		{
			"post_id": 1472668793,
			"body": "Joke: infinity/finity.\nIn both russian and english languages there are words \"finite\" and \"infinite\". Both languages have word \"infinity\", but here is a fun thing. In english there is no word \"finity\" and in russian corresponding word means limb. Let me explain you details. \"Infinite\" means something without end. That is exact meaning of russian word \"beskonechiy\" (infinite), i mean something \"bes\" (without) \"konechniy\" (end). So \"beskonechnost\" is \"infinity\", but at same time \"konechnost\" in russian means \"limb\" (hand or/and leg, head maybe, I am not sure about head). So I guess now you can understand following \"play of words\".\nWhen deminer stepped on a mine, he scattered his \"finities\" and then he become \"infinity\".\nP.S. Now you can associate infinity as something without limbs...",
			"date_added": 1472668771
		},
		{
			"post_id": 1472669658,
			"body": "Joke: Wish of a dying man.\nAfter huge battle one survived man with minor wound walks through battlefield. Trenches, dead bodies, other horrors of war. And our survivor hears voice of other person who obviously dying in pain: \"B-b-b-ro-th-th-ther..., kill... me-e-e-e... p-p-l-ease!\". So 1st guy shoots other guy to end his pain, and hears: \"Th-a-a-a-nk y-o-u, b-ro-th-th-ther!\".",
			"date_added": 1472669635
		},
		{
			"post_id": 1473079855,
			"body": "Joke: Philosophical Fleas.\nTwo fleas. Somewhere at The Dog's surface. One flea says to another: \"What do you think, Is there possible life on other dogs?\"",
			"date_added": 1473079831
		},
		{
			"post_id": 1473080077,
			"body": "Joke: Philosophical Fishes.\nTwo fishes. Somewhere in The Aquarium. One fish says to another: \"If, as you say, there is no god, then who the hell is dropping food into the Universe?\".",
			"date_added": 1473080052
		},
		{
			"post_id": 1473081543,
			"body": "Joke: Russian plumber expert.\nTwo russian plumbers are fixing toilet. One of them is very experienced and very proud of himself, other one is a novice. Expert starts to work and asks novice to hand him wrench #1. Novice gives him that wrench. Expert uses it and dives deeper into a toilet so only his legs and his butt are visible. Then expert's hand shows up. \"Give me wrench #2\" experts says. Novice gives him what he asked and expert's hand disappears. Then geiser of shit happens. Expert asks for another wrench. Novice gives. At the end when work is finished and toilet is working well, expert who all covered in shit (literally) says proudly to his apprentice who is absolutely clean: \"Learn from me, son! Or else you always be a guy who only gives a wrenches!\".",
			"date_added": 1473081517
		},
		{
			"post_id": 1473147425,
			"body": "Joke: Canned Food or Fail of the Logic.\nShop. Shelves of canned food. On one shelf there are cans with picture of tomato, so you can guess it is something made of tomato inside. On second shelf there are cans with pictures of cow, sheep, chicken, so it is obvious that it is meat of that animals inside. But then you encounter shelf with cans that have picture of babies/infants smiling at you. What the hell are they selling? I am not gonna eat this!",
			"date_added": 1473147397
		},
		{
			"post_id": 1473148392,
			"body": "Joke: Pessimist vs Optimist.\nNo1: Pessimist is well informed optimist.\nNo2: Pessimist sees dark tonnel, optimist sees light in the end of that tonnel. Realist sees dark tonnel, the light, and incoming train that causes that light.\nNo3: Optimist is a guy who is often been send to hell by others, but he always returns sun-tanned and with souveniers.\nNo4: When pessimist and optimist are trapped inside a labyrinth, pessimist seeks for exit, and optimist hits the walls with his head.",
			"date_added": 1473148363
		},
		{
			"post_id": 1473260333,
			"body": "Fun fact: Russian medicament \"Papazol\".\nThere is drug \"papazol\" (Папазол): http://aptprice.ru/img/papazol-tabletki-n10.jpg But let me explain \"meaning\" of it's name. \"Папа\" means \"Papa\" or \"Father\" or \"Daddy\", and \"зол\" means \"in rage\" or \"very angry\". So if you translate that into english you get \"Dad-in-rage-ium\" or \"Angrydadium\" or something like that. I am not making it up here is another link: http://www.piluli.kharkov.ua/drugs/drug/563/ It contain an instruction how to use and in which case.",
			"date_added": 1473260303
		},
		{
			"post_id": 1473260657,
			"body": "Joke: Fun Slogans of Big Company.\nNo1: We focus on everything.\nNo2: Fake it until you make it.",
			"date_added": 1473260626
		},
		{
			"post_id": 1473624867,
			"body": "I found out there is english version of nice russian cartoon episodes on youtube (lots of episodes). Here is a link: https://www.youtube.com/playlist?list=ELz1kTQoPdsrA My favorite is: number 30 (big race) and number 37 (about honey addicted Bearry).",
			"date_added": 1473624835
		},
		{
			"post_id": 1473704596,
			"body": "Joke: Cat and Vacuum Cleaner.\nTo understand this joke you need to understand two fun things:\n1) In russian there is fun word for vacuum cleaner. It is composite word made from two simple words: dust (пыль [pyl']) and suck (сосать [sosat']) - dustsucker (пылесос [pylesos]).\n2) Consider you start to do something you never did before. It is unusual, discomfort, you obviously feel lack of skill. And after some time you doing that unusual \"thing\" your skill improves and you feel better, you feel used to it. In russian there is fun words for that - \"to be sucked in\" (втянуться [wtyanut'sya]). It means you \"sucked into the process\", you \"get used to it\", you \"become involved\".\nHere is the joke. Our cat at first was very frightened by vacuum cleaner while it was in use. But eventually the cat (got used to it)/(was sucked in).",
			"date_added": 1473704563
		},
		{
			"post_id": 1474015448,
			"body": "Fun thing from my memomry: Waku Waku 7.\nThere is a fun game \"Waku Waku 7\". It is fighting game, very exciting one, and it is parody of other games. I was playing a lot this game about 10 years ago. https://www.youtube.com/watch?v=K0vR5PS1afo My friends were playing \"Quake 3\" at that time. It is multiplayer deathmatch 3d-shooter.\nSo I said to one of my friends: \"Lets play Waku Waku 7\"!. And he answered: \"No, lets play Quaku Quaku 3\"!.",
			"date_added": 1474015414
		},
		{
			"post_id": 1474018732,
			"body": "Joke: Epicenter.\nThere is big group of russian jokes about what \"stupid sergeant\" in the army says to \"teach a meaning of life\" to privates. Some of them looks like based on real life, some of them obviously made up. But anyway they often are very funny. So here are some of them:\nNo.1. Missile never misses an epicenter.\nNo.2. There were N flying aircrafts... No N is too small number. Lets say there were M flying aircrafts... And both of them were jets.\nNo.3. The dog is an animal covered with fur for military service purpose. And it has four legs by it's corners.\nNo.4. If you are stupid and have bad memory then get yourself a textbook and write things there like I do myself.\nNo.5. Cosinus value can reach 4 at wartime!\nIn russian there is saying \"to do at fresh head\". It means to do something when you are not tired or when your mind is clear. So here comes number 6.\nNo.6. Good soldier must clean his boots at evening to be able to put them on fresh head next morning.",
			"date_added": 1474018697
		},
		{
			"post_id": 1474108789,
			"body": "Article Translation: Inner moral vs Outer moral.\n\nЧто такое мораль и нравственность.\nWhat is outer moral and inner moral.\n\nМораль - принятая в данном конкретном обществе система норм и ценностей, призванная регламентировать взаимоотношения людей.\nOuter moral is system of norms and values accepted in specific society, which designed for regulation of people relations.\n\nНравственность - неукоснительное соблюдение человеком своих внутренних принципов, носящих при этом всеобщий, универсальный характер.\nInner moral is person's strict abidance of his own inner principles, which has property of being global, universal.\n \nСравнение морали и нравственности.\nComparison of outer moral and inner moral.\n\nВ чем же разница между моралью и нравственностью?\nWhat the difference between outer moral and inner moral?\n\nМораль и нравственность - фундаментальные философские категории, которые находятся в ведении науки этики. Но смысл, который они несут, различен. Сущность морали состоит в том, что она предписывает или запрещает конкретные людские действия или поступки. Мораль формируется социумом, а потому она всегда отвечает интересам определенной группы (национальной, религиозной и т.д.). Задумайтесь, даже у преступных кланов есть своя мораль! При этом им обязательно противостоит другая часть общества - со своими устоями и нормами, а из этого следует, что моралей одномоментно может быть великое множество. Обычно мораль зафиксирована в законе (кодексе), в котором закреплены определенные нормы поведения. Каждый поступок человека согласно данному закону оценивается обществом негативно или позитивно. Интересно, что в одном и том же социуме мораль может со временем измениться до неузнаваемости (как, например, произошло в России в XX веке), диктуя прямо противоположные принципы поведения.\nOuter and inner moral are fundamental philosophical categories, which are subjects of ethics science. But meaning of those two words has differences. Essence of outer moral is to dictate and forbid specific human actions and doings. Outer moral is forming/creating by society, and because of that it is always serves for interests of specific group of people (national group, religious group and so on). Think about it, even criminal clans have their own outer moral! And at same time this criminal group is necessarily opposed by other part of society which has it's traditions and norms, and what is follows from that is there can be very big number of \"outer moral\"s at same time. Usually outer moral established in The Law (Codex), in which specific norms of behavior are fixated. Every deed of person is judjed as negative or positive by that law/codex. It is interesting, in the same society outer moral can change in time to unrecognisable state (as, for example, what happened in Russia in 20th century), dictating antithetic (quite opposite) principles of behavior.\n\nOтличие морали от нравственности.\nDifference of outer moral and inner moral.\n\nНравственность же неизменна по содержанию и крайне проста по форме. Она абсолютна и выражает интересы человека (и человечества) в целом. Одними из главных нравственных ориентиров считаются отношение к другому, как к самому себе, и любовь к ближнему, а значит, нравственность изначально не приемлет насилия, презрения, унижения, ущемления чьих-либо прав. Наиболее нравственно поступает тот человек, который совершает нравственные поступки, даже об этом не задумываясь. Он просто не может вести себя по-другому. Мораль направлена в первую очередь на самоутверждение, а нравственность - на бескорыстный интерес к другому человеку. Нравственность наиболее близка к идеалу, к универсуму.\nInner moral is unchangable in it's content and very simple in it's form/shape. It is absolute and express interests of person (and humanity) in common. One of main reference points of inner moral is: attitude for other person as if you dealing with yourself, love for close people, and this means that inner moral from beginning doesn't allow violence, contempt, humiliation, limiting of someone's rights. Most \"inner moral\" person is person who do \"inner moral\" deeds, even without thinking about it. This person can't behave other way. Outer moral directed (in 1st place) for self-affirmation, but inner moral - for non-selfish/non-profitable interest to other person. Inner moral more close to the ideal, to universum.\n\nОтличие морали от нравственности.\nDifferences between outer moral and inner moral.\n\nНравственность связана с духовной, а мораль - с социальной сферой.\nInner moral is related to spiritual/mind sphere, outer moral is related to social sphere.\n\nНравственности свойственно постоянство, мораль же крайне изменчива.\nInner moral tend to be solid/unchangable, Outer moral is very changable.\n\nНравственность едина для всех, а моральных устоев великое множество.\nInner moral is one for all, but there are big number of \"outer moral\"s.\n\nНравственные устои абсолютны, а моральные - условны (зависят от места и времени).\nInner moral is absolute, but outer moral is relative (from place to place and from time to time).\n\nМораль стремится соответствовать некому образцу (обычно где-то прописанному), нравственность основывается на <внутреннем законе>.\nOuter moral tends to match some image (usually written somewhere), inner moral based on \"inner law/order\".\n",
			"date_added": 1474108753
		},
		{
			"post_id": 1474138033,
			"body": "Strange: It works now.\nIt is very strange. I can unfollow now. It just works now. I click \"x\" in green circle and it just works. User name disappears from the list. Why it did not work until now? And why it has started to work all this sudden? Mystery! It is \"following rush\" on my to do list for near future. I feel happier. :-]\nBut here is another problem. ZeroMePlus shows only 1000 of ZeroMe users. And ZeroMe shows 1600+ user names. So for now I need to use ZeroMe (not ZeroMePlus) to \"hunt\" whom to follow. But it is minor. I CAN UNFOLLOW NOW! I am so happy. :-]",
			"date_added": 1474137995
		},
		{
			"post_id": 1474185772,
			"body": "Joke: Shortest joke.\nThis is shortest joke I ever encounter. I mean joke which made me laugh hysterically for 20-30 seconds. And then at that day every time it popped up in my mind I smiled widely. Now I remember there were another joke that fits same description.\nNo.1. Passive necrophile. (advanced imagination required).\nNo.2. Locksmith-Gynecologist. (In USSR it was common to have \"dual-class\" professions).",
			"date_added": 1474185733
		},
		{
			"post_id": 1474272706,
			"body": "Joke: Doctor and Greedy patient.\nPatient: \"Doctor, give me some pills to cure my greediness. And give me !LOTS! of them! LOTS OF THEM!\"",
			"date_added": 1474272666
		},
		{
			"post_id": 1474272975,
			"body": "Joke: Doctor and Unconfident patient.\nPatient: \"Doctor, I am so unconfident person, so nobody seems to listen to me, everybody completely ignore me because of that. What should I do?\"\nDoctor: \"Who is there?\", \"I think I hear something!\".",
			"date_added": 1474272934
		},
		{
			"post_id": 1474273245,
			"body": "Joke: Evil Doctor.\nDoctor: \"Take those pills. Eat one before you sleep in the evening. And tomorrow in the morning (in case you wake up) eat another two pills\".",
			"date_added": 1474273203
		},
		{
			"post_id": 1474273681,
			"body": "Joke: Gloomy Doctor.\nPatient before serious surgery operation: \"Doctor, will I live?\".\nDoctor: \"What the sense? What is the meaning of life after all?\".",
			"date_added": 1474273638
		},
		{
			"post_id": 1474398564,
			"body": "Idea: Antifollowing (or Black) list.\nI stared at Erotic's picture, which represent a person in ZeroMe. I was thinking... And now I think it can be very nice to have something like \"antifollowing\" or \"blacklist\" feature to be able to completely ignore some personas I do not want to see.",
			"date_added": 1474398519
		},
		{
			"post_id": 1474534231,
			"body": "Epub is not text format.\nI have downloaded book \"things you make and do in 4th dimension\" in \"new\" format epub. First I was sad about that. Epub? now I have to find epub-reader or something, but it looks like epub is just bunch of html files with pictures. Epub file behaves like a zip file. You can unpack files you already know from this so called epub. They are trying to confuse someone again. Not this time. So be aware of this fact - epub is not new freaking text format like pdf, djvu. It is simply zipped bunch of html! Jeez, I hate those guys trying to make my life more complicated. I still think txt with 80 symbols in a line is best text format! It is simpliest format you can imagine.",
			"date_added": 1474534185
		},
		{
			"post_id": 1474575552,
			"body": "Joke: Old man and little girl with a cat.\nOld man passes by a little girl playing with her cat. Old man was in sentimental mood and looking at child reminded him his youth, so he smiled and asked the girl friendly: \"May I caress your pussy?\". Girl took her cat and ran away in hurry. Old man was thinking: \"Strange, what is wrong with this kid? Why she was so scared? Is my old face so scary?\".",
			"date_added": 1474575505
		},
		{
			"post_id": 1474577170,
			"body": "Joke: Alkashnikov's Kalashmat.\nIt is hard to translate this joke into english language. It is play of words. In russian \"Kalashnikov's Assault Riffle\" sounds like \"Automat Kalashnikova\" and it means that this weapon is automatic and named in favor of Mr. Kalashnikov. Word \"kalashmat\" doesn't exist in russian language but for russian guy it sounds like it is device for beating up some target very hard and with high frequency. Word \"Alkashnikov\" sounds like last name, reminds of Kalashnikov but strongly associated with word \"alcash\" which means regular alcohol drinker. So what kind of device can be called Alkashnikov's Kalashmat. It may be invention of some constantly/permanently drunk guy to automaticaly punch/kick his friends/enemies who most likely are alcoholics too.",
			"date_added": 1474577122
		},
		{
			"post_id": 1474657261,
			"body": "Joke: Shtirlitz and mind blow.\nThere is a big group of russian jokes about Shtirlitz. To have a chance to understand them you first need to know who is Shtirlitz. Shtirlitz is russian secret agent or spy who infiltrated german nazis during world war 2 or something like that. He is a fictional character, some kind of James Bond. Also in russian language when you need to think about something you can say \"to throw my brains around\" (пораскинуть мозгами [poraskinut' mozgami]). So here comes the joke.\nShtirlitz got shot to his head. \"Hmm, this bullet is explosive\" thought Shtirlitz throwing his brains around.\nP.S. you can say also \"it made his mind blow\".",
			"date_added": 1474657211
		},
		{
			"post_id": 1474658021,
			"body": "Joke: Shtirlitz became alert.\nShtirlitz and his wife were walking down the street. Suddenly, Shtirlitz heard gun shot, and his wife was fallen. Shtirlitz became alert a little.",
			"date_added": 1474657970
		},
		{
			"post_id": 1474658712,
			"body": "Joke: Shtirlitz and Elephants.\nOne guy was at his home when somebody was knoking his door. Man at home opens door and sees suspicious stranger who says conspiraciously: \"Elephants go to the South!\". Man at home  responded: \"Elephants go to HELL, Shtirlitz lives at second floor!\".",
			"date_added": 1474658660
		},
		{
			"post_id": 1474659030,
			"body": "Joke: Shtirlitz.\nShtirlitz was shooting blindly. Blindly was shot and died.",
			"date_added": 1474658977
		},
		{
			"post_id": 1474659658,
			"body": "Joke: 3 spiders in the jar.\n3 spiders were locked in a jar by some scientist. After some time scientist was checking them and discovered that all spiders disappeared. Scientist was thinking: \"Hmm, interesting, they must have been ate one another!\".",
			"date_added": 1474659604
		},
		{
			"post_id": 1474904938,
			"body": "Joke: Circus and some troller.\nCircus. Announcer: \"Now at the arena clowns will entertain you\"; audience: \"Yey! hurray!\"; somebody from far seats: \"Booo! Booo! Clowns are sux! Booo! Booo!\". After some time announcer: \"Now at the arena acrobats will entertain you\"; audience: \"Nice, hurray!\"; somebody from far seats: \"Booo! Booo! Acrobats are sux! Booo! Booo!\". Then same thing happen to elephant entertainment, and tigers jumping through flaming rings. Announcer: \"And now you will see special event, 1st time at whole history of this circus, brave man will be used as ammo for a big cannon. Audience: \"Yey! Hurray!\". Somebody from far seats: \"This is sux! Booo! Booo!... Hey? What's going on? Why are you grabbing me? Where are you taking me?!!\"",
			"date_added": 1474904882
		},
		{
			"post_id": 1474905268,
			"body": "Joke: Doctor and Patient.\nPatient: \"Doctor, every part of my body is in terrible pain. When I touch my head it hurts. When I touch my belly it hurts. When I touch my arms, legs, back or butt it hurts\".\nDoctor, after examining patient: \"Oh, I see, your finger is broken!\".",
			"date_added": 1474905211
		},
		{
			"post_id": 1474905403,
			"body": "Joke from \"Steal This Show\" podcast.\nIt is another short one. Ukrainian Uranium.",
			"date_added": 1474905345
		},
		{
			"post_id": 1475004902,
			"body": "Joke: Doctor's Report and Foreign Body.\nI g??gled a little and it seems like english language has the same strange property too. There is fun \"foreign body\" thing. Those words associated with medicine, and they have meaning that something that is not part of your body is stuck in your body. So here is a joke.\nOne patient came to doctor with stewpot on his head. Head was completely stuck in it, so patient had to ask medical assistance to remove it. Official doctor's diagnosis was something like this: \"Patient's head is in foreign body\".",
			"date_added": 1475004843
		},
		{
			"post_id": 1475314640,
			"body": "Joke: Antitrolling tactics. Introduction (Explanation).\nThose jokes are based on my experience. About 5 years ago it was common in my life to some \"smart ass\" trying troll me by asking questions not to get my answer but (now I understand clearly) just to mock me. I played this game by pretending that asking guy is serious and my goal is to answer correctly. If I did this successfully, \"smart ass\" started to feel very stupid, angry, disappointed. In that case I won the game. So it may be new serie of jokes I call \"antitrolling tactics\". If something pops up in my mind, I will try to describe it.",
			"date_added": 1475314580
		},
		{
			"post_id": 1475315957,
			"body": "Antitrolling Tactics Fun: Believing in God.\nMany trolls asked me the same question: \"Do you believe in God?\". I tried different responses and now I can't remember them, I was naive, stupid, I didn't understand they are mocking me, and tried to answer honestly, but it always ended humiliating for me. Now I am \"evil\" and consider this as some kind of game like chess. It is like they make move e2-e4 and there are strong and week responses for that move. And here is a strong one I developed for myself: \"Which one god are you asking me about?\" or simply \"In which one?!\". Now I know I am not only one who was so \"smart\" to \"find\" that \"move\". It is a very strong move. Most trolls I tried this on were starting to \"go reverse\"/\"change subject\". Even those who wished to continue this game were feeling like they lost this game. In that position you can \"teach them a lesson\" about history, about fact that there are many different cultures, different religions, different modification of same religion in different places and/or in different times, and they (trolls) have to listen to you because they asked for it! And in this position you have plenty possibilities to show them how you are smart and how they are stupid.\nP.S. Being evil feels good!",
			"date_added": 1475315896
		},
		{
			"post_id": 1475780157,
			"body": "Joke: Toxic Waste Warning.\nWarning! Jumping into toxic waste does not give you super powers. May cause adverse health effects: http://127.0.0.1:43110/zatogra.bit/?Topic:3_1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN/Toxic+Waste+Warning",
			"date_added": 1475780094
		},
		{
			"post_id": 1475848361,
			"body": "Oh, it looks like Enjoykin made some english songs too. They are fun and need no translation. Here are some links:\n.1. The building is on fire: https://www.youtube.com/watch?v=RLuVVIztVXA\n.2. It is all about the rain: https://www.youtube.com/watch?v=DLF2m10EswI\nAnd Enjoykin made song translations from russian into cat language!\n.1. https://www.youtube.com/watch?v=NlxSW2dxUWo\n.2. https://www.youtube.com/watch?v=6sBfJDcVTXw\n.3. https://www.youtube.com/watch?v=ujMzuKoDfw0\n.4. https://www.youtube.com/watch?v=_I75OGdL2Bc\nI think Enjoykin is great.",
			"date_added": 1475848296
		},
		{
			"post_id": 1475948169,
			"body": "Joke: Solving hard problems using different chakras.\nWhen some russian language thinker struggles some difficult problem, or simply has some troubles with something he/she can say one of two phrases: \"It is hemorroid\" (I think english thinkers have \"it is a pain in the ass\" variant for that) or \"It is head ache\". So this is a fact you can observe. And here some interpretation: there are two kinds of people, defined by where their center or thinking located: 1) if mind HQ is in the head, person tend to say \"it is a head ache\", 2) but some people apparently have thinking center in their butts, so they say \"it is a pain in the ass\"/\"it is a hemorroid\".",
			"date_added": 1475948103
		},
		{
			"post_id": 1476173990,
			"body": "Joke: Fake Millionaire Question.\nWhich dog is used to hunt foxes (and other animals) from their hole homes? <A> St. Bernard Dog; <B> Dachshund; <C> Mastiff; <D> Poodle.",
			"date_added": 1476173921
		},
		{
			"post_id": 1476186676,
			"body": "Antitrolling Tactics Fun: Troll talking about himself.\nI discovered some pattern you can easily find in troll behavior. Trolls like to blame you in something that applies to them much more then it applies to you. Here some examples. Greedy people tend to blame you in greediness, stupid people can't see level of your intelligence (partly because they are stupid) and they think you are one who is stupid (Oh, stupid people and how to protect yourself from them is deep and fun theme, so maybe I will talk about it later... (\"Red flags of stupidity\" sounds fun khe-khe.) Cheating people like to call you a cheater. People who do not mind to steal other's stuff can say you are thief. One guy (this is my experience) with beard attacked me with: \"Why did you not shave yourself? You should shave!\". I shave once per 2 weeks usually, and that guy had higher level of his \"unshaveredness\" than I at that time. So I developed \"magical\" respond (spell/mantra) that now quickly pops up in my mind at right moments: \"people talk about themselves\". Especially it works when blame is completely can't be applied to you. So if someone blame you in something, do not panic nor react emotionally, 1st think that maybe this \"someone\" signals you about his/her own properties. It works often for me, and already saved a lot of my psychic energy.",
			"date_added": 1476186606
		},
		{
			"post_id": 1476258990,
			"body": "Joke: Girl is breaking up with her boyfriend.\nGirl: \"Our relationship is over\". Boy: \"But why?\". Girl: \"Because it became known to me that you are pedophile!\". Boy: \"Jeez! Isn't it a too difficult word for ten years old girl?\".",
			"date_added": 1476258919
		},
		{
			"post_id": 1476260140,
			"body": "Joke: Proud fathers.\nThree fathers decided to spend some time together: have a beer, talk about their achievements, have fun e.t.c. Two fathers already been sitting in a room, talking proudly about their sons. 1st father: \"My son is so successful, he is good banker and he has this, he has that, bla-bla-bla, and he gave his friend a house as a gift just because he can. 2nd father: \"And my son is successful lawyer, he has bla-bla-bla, and he gave his friend a ferrari car as a gift just because he can afford it. Then after some time 3rd father comes to the room: \"What are you talking about?\". 1st father: \"We discuss success of our sons\". 3rd father: \"Oh, my son is totally failure, complete loser: has no skills, has no job, and recently I knew he is gay. Very sad. But somehow he became owner of new expensive house and he rides ferrari. I wonder, how does he do this?\".",
			"date_added": 1476260068
		},
		{
			"post_id": 1476261899,
			"body": "Joke: Taras Bulba and his son.\nThere is episode in Gogol's novel where Taras Bulba meets his son on a battle field. And his son is on opposite side, because of love story. It is well known phrase Taras Bulba says during fight: \"I was one who made you, and I will be one who kills you\". Here is little modified phrase he could say: \"With same `thing` I used to made you, same `thing` I will use to kill you!\" (For russian thinkers: \"Чем я тебя породил, тем я тебя и убью!\").",
			"date_added": 1476261826
		},
		{
			"post_id": 1476270247,
			"body": "Joke: Fail of Logic.\nI think there fore I am. Russian has more dark version of that phrase. It is \"My head is in pain, there fore my head exists\". !Wrong! There are people that have their leg removed. Some of them say they can feel pain in leg they do not have anymore. It is called \"phantom pain\" (I do not know about english, but in russian it is medical term). So if your head is in pain it doesn't necessarily means you have it on your shoulders, maybe it is a \"phantom pain\". Back to the \"I think there fore I am\". I have a feeling something wrong with this logics too.",
			"date_added": 1476270172
		},
		{
			"post_id": 1476346540,
			"body": "Watching Youtube.\nhttps://www.youtube.com/user/ActualizedOrg/playlists This guy is great. I already watched:\n1. How You Lie - All Your Dirty, Sneaky Lies & Manipulations Exposed! https://www.youtube.com/watch?v=XulpS3cAkOM&index=8&list=PLFfM65xLnO-ElYIU3swM2v4wSHqy2ccDV\n2. How To Be A Strategic Motherf??ker - The 7 Pillars Of Strategic Thinking. https://www.youtube.com/watch?v=4oVrMpvtU8c&index=9&list=PLFfM65xLnO-ElYIU3swM2v4wSHqy2ccDV\n3. How To Meditate - The No Bullshit Guide to Meditation. https://www.youtube.com/watch?v=wirV265ZYSw&list=PLFfM65xLnO-EpLcMJS9eiayq8uT_dDfPR&index=1\n\nI am very excited. I love bullshitless \"evil\" people who cynically tell how things work. Now I have intention to watch all his videos one by one starting from foundations. https://www.youtube.com/playlist?list=PLFfM65xLnO-ElYIU3swM2v4wSHqy2ccDV",
			"date_added": 1476346464
		},
		{
			"post_id": 1476611108,
			"body": "Joke: Drunk Husband vs Angry Wife. Cemetery.\nMany russian jokes start like this. Very drunk husband returns home very late and tries to avoid conversation with his wife, but wife is angry and waiting to attack, and husband tries different bullshit to defend himself, to create reasonable explanation, but almost always fails because his explanations are rediculous. Wife: \"It is 3 a.m, where the hell have you been?\". Husband (voice shows his very drunk): \"At cemetery\". Wife switches her emotion from anger to \"worried a little\": \"Oh my, who died?\". Husband: \"You not gonna believe this, THEY ALL are died there!\".",
			"date_added": 1476611031
		},
		{
			"post_id": 1476611275,
			"body": "Joke: Drunk Husband vs Angry Wife. Cooking.\nSame thing. Very drunk husband returns home at about 2-3 a.m., his wife waiting to punish him with frying-pan in her hand at the door. Husband: \"Oh dear, you are always cooking, always cooking\".",
			"date_added": 1476611197
		},
		{
			"post_id": 1476611937,
			"body": "Joke: Cemetery and Vampires.\nWoman returns home lately. It is night and it happened her path lies through the cemetery. Woman is superstitious, she afraid of some ghosts, zombies and vampires from scary stories and cemetery is strongly associated with those unholy creatures. So she goes through cemetery and meets some guy there. Guy looks friendly and politely speaks, agrees to accompany her on all way through cemetery. And when time to separate their ways comes woman says: \"Thank you very much! It was so great not to be alone considering those scary vampires might lurking here. I am so afraid of them\". Guy: \"Why being afraid of us?\".",
			"date_added": 1476611858
		},
		{
			"post_id": 1476612615,
			"body": "Joke: New Airplane Autopilot.\nNot so distant future. Some airplane company created plane without need in human pilot, so computer will handle airplane completely during all stages: lift off, flying, landing, cheer up passengers during turbulence, e.t.c. So imagine this plane in the middle of course with dozens of passengers. Computer says: \"Onboard artificial intelligence greats you, all systems are working perfectly [khch] orking perfectly [khch] orking perfectly [khch] orking perfectly. Ha-ha-ha. Just joking around\".",
			"date_added": 1476612535
		},
		{
			"post_id": 1476698896,
			"body": "Joke: Man Lost in Winter Forest.\nWinter. Forest. Man can't find his way home for few hours. Man starts to yell: \"Hello? Anybody? I am lost here? Help?\". Then he feels someone touches his shoulder gently. Men turns around and sees big bear. Bear: \"Why are you so loud, you wake me up, I want to sleep\". Man (scared): \"Mm... I, I, I, I,... I thought someone hear me and help me out.\". Bear: \"So, I heard you, do you think it is easier now?\"",
			"date_added": 1476698815
		},
		{
			"post_id": 1476699312,
			"body": "Joke: Doctor and Patient after surgery.\nPatient: \"Doctor, how went the surgery, was it all right?\". Doctor: \"Can't you see? I am not doctor, I am Paul the Apostle!\".",
			"date_added": 1476699230
		},
		{
			"post_id": 1476699516,
			"body": "Joke: Hair and Intelligence Correlation.\nKid asks his mother: \"Why father has no hair on his head?\". Mother: \"It is because he is very smart and thinks a lot!\". Kid: \"Why do you have plenty then?\".",
			"date_added": 1476699433
		},
		{
			"post_id": 1477035176,
			"body": "Joke: illegal possession of fingers (dark vision of possible future).\nAfter some guy managed to kill other guy using his index finger, government made a law. From now on, any person in any public place must wear gloves (like boxers use). Any person who for some reason needs to get some work done that requires use of naked hand, that person needs authorization, otherwise he/she will be considered as a criminal!",
			"date_added": 1477035090
		},
		{
			"post_id": 1477040460,
			"body": "Joke: Fake Millionaire Question.\nWhat kind of prize they can give you if you discovered something really awesome? <A> Noble prize. <B> No blame prize. <C> Nobel prize. <D> Nebula prize.",
			"date_added": 1477040373
		},
		{
			"post_id": 1477040684,
			"body": "Joke: Fake Millionaire Question.\nWhat is not related to japan writing system? <A> Hiragana. <B> Katakana. <C> Kanji. <D> Harakiri.",
			"date_added": 1477040596
		},
		{
			"post_id": 1477146103,
			"body": "Joke: Psychiatrist and Positive Patient.\nPsychiatrist: \"Are you suffering from delusions or hallucination?\". Patient: \"No, I am actually enjoying from them! Especially those sexual ones!\".",
			"date_added": 1477146014
		},
		{
			"post_id": 1477211338,
			"body": "Highly manipulative people trick: Hero by doing zero.\nIt is kind of trick people in charge can do: your boss, politician, or just ambitious friend or family member who has influence to other people. First thing they do is making some change that makes other people very unhappy. Secondly, they wait some time, so people begin to forget what it was look like before those changes. People start to adjust themselves for new situation. Then finally third step is to return situation to the way it was originally. People feel happy and start to think good about this person, how great this person is making \"changes to the good\".",
			"date_added": 1477211248
		},
		{
			"post_id": 1477212154,
			"body": "Joke: Police officer trained to detect drug-users.\nTwo police officers are on patrol to catch some drug-users. One officer is very experienced, other one is novice. Novice: \"How do you detect which house has drug-users?\". Expert: \"It is very easy! For example, can you see those pink crocodiles over there flying from the window of that house? I am sure some guys there are our next target!\".",
			"date_added": 1477212063
		},
		{
			"post_id": 1477383718,
			"body": "Highly manipulative people trick: \"Provoking feeling of guilt\".\nThere are people who constantly want you to do something for them. They know you might not be willing to do that if they ask directly, or they do not want be in psychological debt (favor for favor thing). So those trolls for sure will try to devolve your deed. One of many ways to doing so is to blame you in something. If blame was succeed (victim begin to feel guilt) then troll starts to talk victim into taking initiative for doing something for troll. And troll will accept your deed for granted. He/she doesn't own you anything because you \"just\" paying for your guilt to be removed. And if you do not aware of this mechanism, those trolls can use you multiple times to make you do great amount of work just because you did something little and feel bad about that. If your mistake was a little then trolls can try to blow it into something huge (russian phrase - to make an elephant out of a fly). And if you did not do something that can be used as target for blame you, then troll can create something from nothing literally. I am engaged many this kind of trolls in the past (now it doesn't seem a trouble anymore), they always start conversation either by blame you or by asking you question to gather information they will use to blame you.\nHere is some cure. Every time you feel guilt consider it as red flag \"!Warning! Troll attack! Activate Defence!\", ask yourself (to be aware) \"who wants something from me?\" and when you figured out WHO (it is usually someone who just came and started to talk) ask yourself \"what does he/she want from me?\". If you do this frequently you will achieve immunity - you will not feel guilt anymore. It doesn't mean you will become some jerk who hurt other people and doesn't care about it. I mean if you really hurt someone, you can pay for it but only once and forget about it. Trolls can try to use your mistake to their schemes even if you payed for it already. Do not let them.\nBe aware: there are many hungry trolls out there seeking for people who tend to accept blame and feel guilty. By my experience I can tell: those kind of trolls very quickly stop to consider you as victim if you do not show any symptoms of guilt-feeling person. You can find yourself in funny situation when some aggressive troll attacks everyone but not you.",
			"date_added": 1477383626
		},
		{
			"post_id": 1477384249,
			"body": "Highly manipulative people trick: \"There is no time\".\nOh, it is very simple and easy one. If someone tries to \"sell\" you something and you want to take your time and think deeply about it for few days, but that someone starts to hurry you up. That is huge red flag of con artist. Almost all good things are out there waiting for you to come now, tomorrow, next week, next month, year after year - it doesn't matter when. But troll will try to make you believe that it is very limited, you have no time to think, make your decision here and now, because it is exclusive and you will never have such wonderful opportunity ever after! Do not fall into this cheap trick!",
			"date_added": 1477384156
		},
		{
			"post_id": 1477391433,
			"body": "Joke Voting Question: What is \"ass hole\"?",
			"date_added": 1477391338
		},
		{
			"post_id": 1477402117,
			"body": "Russian language: gender of numbers.\nRus nouns mostly have association with one of three genders: male, female, \"the-thing\" or \"it\". For example word \"book\" \"книга\" has \"female\" gender, word \"table\" \"стол\" has \"male\" gender, word \"window\" \"окно\" has \"thing\" gender. And when you count something, you adjust number words (one, two, three, e.t.c.) to be in proper gender form. In english you do not have to bother with that, it is simple: one book, two books, one table, two tables; but in russian you modify words \"one\", \"two\" and other numbers to match a noun. Male \"one\" is \"один\", female \"one\" is \"одна\", thing \"one\" is \"одно\", so you have \"одна книга\", \"один стол\", \"одно окно\". Same thing for other numbers. And \"gender\" is only one \"dimension\" to adjust one word to another. I will think about how to describe basic rules of how words adjust to one another, which dimensions you can consider when dealing with russian words in a sentence.",
			"date_added": 1477402021
		},
		{
			"post_id": 1477467816,
			"body": "Russian language: gender of numbers part2.\nI was thinking about it yesterday and found one important thing I didn't figure out when I was writing \"part1\". It looks like only first two numbers have gander: one and two. But number three, four and so forth have no gender. Example \"three books\" \"три книги\" and \"three tables\" \"три стола\" have same number word. But now I figured out that there 3 points in dimension of countable quantity of nouns. In english you have two: one thing, and more than one thing. It seems like in russian you have 3 groups: one thing, 2-4 things, 5 and more things. Lets check this out: 1. one book - одна книга (\"книга\" is in (one)form), 2-4. two books - две книги, three books - три книги, four books - четыре книги (\"книги\" is in (2-4)form), 5+. five books - пять книг, six books - шесть книг, hundred books - сто книг (\"книг\" is in (5+)form). It works for round numbers and for numbers from 1 to 20. \"Twenty one books\" in russian is \"двадцать одна книга\" (\"книга\" is in (one)form). You can think about it as \"**twenty** books and **one** another **book**\" sentence where you have removed unnecessary words. So now you must consider gender of noun and pick proper form of word \"one\". Word \"книга\" has female gander as many other words which ends by \"-га\": нога (leg), телега (cart), слуга (personal clerk or slave), дорога (road, way, path). Same principle applies for all other numbers. Twenty two books - двадцать две книги; same for 23 and 24, then again twenty five will be \"дватцать пять книг\". So if number ends by digit 1 you make noun to be in (one)form, if number ends by digit 2to4 - it is 2nd form, all other numbers are in 3rd form. But if number ends by digits 11to19 noun must be in 3rd form, because numbers from 11 to 19 is some kind of special and they ends by \"-дцать\".\n.1. One - один (for male), одна (for female), одно (for \"middle\" gender), одни (for multiple). Another fun thing - multiple form of word \"one\". But I think english has something like that: word \"alone\", for example \"kids were left home alone\" - \"дети остались дома одни\".\n.2. Two - два/две/два. There is no difference between \"male\" and \"middle\" gender here.\n.3. Three - три. 4. Four - четыре. 5. Five - пять. 6. Six - шесть. 7. Seven - семь. 8. Eight - восемь. 9. Nine - девять. 10. Ten - десять.\n.11-19. Compare those numbers with 1-9, pattern is almost obvious. 11. одиннадцать, 12. двенадцать, 13. тринадцать, 14. четырнадцать, 15. пятнадцать, 16. шестнадцать, 17. семнадцать, 18. восемнадцать. 19. девятнадцать.\n.10N. numbers: It is similar to 11-19 where you take basis from 1-9 and add +\"на\" and +\"дцать\" prefixes (одинадцать (11) = один (1) + на + дцать), but here you do not add \"на\" prefix - just +\"дцать\" prefix. 20. двадцать, 30. тридцать. 40. сорок (that is exception). 50. пятьдесят (it is very common to say this word like \"пидисят\", it is like english \"twony\" instead of \"twenty\"). 60. шестьдесят. 70. семьдесят. 80. восемдесят. 90 девяносто. 100. сто. Oh, from 50 to 80 you add \"-десят\" (looks like \"десять\" (10), not \"дцать\").\nP.S. Strange, I thought it will be easy to describe thing like that which seemed to be easy before I started. Now I realize I wrote lots of text and just barely \"scratched the surface\". And I am not sure I've done all correctly - \"there might be mistakes I didn't notice\" feeling I have. So, why do I do this? And why little dogs are barking and threatening big automobiles? What are they thinking? Are they just stupid? Am I Stupid? Big mystery it is, indeed! :-]",
			"date_added": 1477467719
		},
		{
			"post_id": 1477476871,
			"body": "Joke: Pinocchio Paradox.\nPinocchio's nose grows every time he says something that is not true. What will happen if Pinocchio says \"My nose will grow now!\". <A> Nothing will happen. <B> Collapse of the Universe. <C> Black hole (or some kind of anomaly) will be created inside Pinocchio's nose. <D> His nose just will grow as he says so.",
			"date_added": 1477476773
		},
		{
			"post_id": 1477645336,
			"body": "\"Freedom vs Independence\" and \"Dots and Links Thinking\".\nBasically dots are nouns, links are verbs. You just try to draw graph on paper or in your imagination, and you can encounter some interesting questions. You become aware of things you thought you know, but you don't. You can find dots that have no connections. You can find link which has only one defined dot, and link is something that \"must have\" two. There are dot groups (patterns) that acts like dots but they require specific number of \"must have\" links. Now examples. Simplest element is just noun which represent object you can imagine and object you can put in your imaginary cart (this cart can be any size): cats, dogs, people, buildings, spaceships, e.t.c. - they all are dots. And there is other type of nouns - nominalizations - you can't put them in your cart: love, friendship, respect, freedom, independence. Fun thing with nominalizations is everybody has his/her own \"understanding\" of what \"freedom\" or \"friendship\" means. So it is better to \"denominalize\" them into simple components of dots and links. For example someone says \"we fight for freedom\" and this sentence has no sense unless you fill this structure with your own \"understanding\" by your own imagination. And your way of doing this can be **very** different from what person was thinking saying that.\nSo I try to make my own definitions of words for clear understanding of what is going on. Here is my current definition of word \"freedom\": it is ability or resource **for** doing something you want to do at specific time in specific place (here and now for example). You either have freedom to visit your friend now or you have no freedom to do that now. You either have freedom to read book you want to read or you don't. So if I hear someone says \"we fight for freedom\" and I try to understand what does it mean, then I want to ask \"what do you want to do?\" or \"why do you want this freedom for?\". And word \"independence\" requires 2 specific variables (\"must have\" links to specific dots on imaginary graph). 1st: **who** is independent, 2nd: **from what** he/she is independent. You can imagine dependence/independence pointing to the past on timeline, and freedom pointing to the future. Freedom has some purpose in the future (we want to do something now), independence has some causes from the past (something was created in the past and now it is obstacle on our way to do what we want).\nOne more thing. Do not confuse freedom with independence. I hear often someone says \"I am free **from** bla-bla-bla\" - it means for me \"he is independent **from** bla-bla-bla\". Or someone says \"I am independent\" (meaning he has freedom **for** to do something) - I ask \"independent **from** what?\".",
			"date_added": 1477645237
		},
		{
			"post_id": 1477648368,
			"body": "2D judgement and 1D judgement.\nIt is common to do one dimensional judgement. It doesn't matter it is \"black and white\" or \"grades of gray\", it both cases you can imagine one axis with two extremes on both sides: evil vs good, small vs big, stupid vs smart, cold vs hot. Now try to do same thing on the plane, you have two orthogonal axes which divide plane into 4 pieces. Now you can pick two 1D things and combine them to do 2D model to see does it show something interesting. For example you can combine \"introvert vs extravert\" with \"neurotic vs emotional stabile\" and get four temperaments: (melancholic vs phlegmatic) vs (choleric vs sanguine). https://katerinamichouli.wordpress.com/the-four-temperament-types-of-hippocrates-wikipedia/ (look at the picture, I didn't read the article so I do not know is it good or not).\nI for myself found useful to combine \"stupid vs smart\" with \"enemy vs friend\". Because it is common mind trap to think all your friends are smart because they are your friends, and all your foes are stupid because they cause you a troubles, and if they were not being so stupid then they were being your friends. Now I aware of false of this \"logic\". It is called \"holo-effect\" https://en.wikipedia.org/wiki/Halo_effect You tend to overestimate things you like, and you tend to underestimate thins you hate. It is easy to understand there are stupid enemies and smart friends out there. So it was \"big discovery\" for me to figure out two additional kinds of people: stupid friends (who hurt you because of their lack of understanding combined with \"good\" intentions) and smart enemies (who just do not like you for some reason).\nP.S. And do not tell me about making same thing in 3D. I tried and didn't found anything entirely new for me to use.",
			"date_added": 1477648268
		},
		{
			"post_id": 1477651574,
			"body": "Dark joke: Frightening 4 words combo.\nYou can try this words combo on your friend when he has a very little wound on his limb and he says \"it is just a scratch\". Those 4 magic words are: scratch, infection, gangrene, amputation. I did it several times. It can make your friend feel frightened and laugh and same time. Very funny.",
			"date_added": 1477651473
		},
		{
			"post_id": 1477663770,
			"body": "MetaTimeStrategy video PC\\Win game \"Achron\": https://www.youtube.com/watch?v=AcrueaoOQ3o It is RTS with Time Travel mechanism built in as part of game process. I completed it 1-2 years ago. Is here anybody who played this game too? Or want to talk about it?",
			"date_added": 1477663668
		},
		{
			"post_id": 1477733890,
			"body": "Question: How to mix two sound waves?\nSome times I try to g??gle answer to this question and I fail. Today is another that time. I always got something else, but not what I want. Maybe I use wrong words. So here is a problem. You have bunch of numbers form -32768 to +32767. Each 44100 of those numbers represent one second of sound. So you have 2 or 2+ groups of numbers, and want to create new one which will be represent all those sounds combined. I know about making average, but it makes loss of volume. How to combine sound waves without loss of volume?\nAnother similar problem. I can generate wave file out of nothing using assembler program I can write. For example I can generate 10 seconds of A of 1st octave - 440Hz wave file, and I can generate 10 seconds of A of 2nd octave - 880Hz wave file (simple sinus/cosine multiplied by 32K). How can I generate wave that sounds like both A of 1st and 2nd octaves?\nCan someone give me a links, please?",
			"date_added": 1477733787
		},
		{
			"post_id": 1477775739,
			"body": "I do not watch TV for years.\nSo I am \"+1\" to this guy! https://www.youtube.com/watch?v=LIIUg7WjGKA Watching TV makes you negative.",
			"date_added": 1477775635
		},
		{
			"post_id": 1477827792,
			"body": "Lets play Human vs Human chess.\nDo you know you can easily play chess with other guy? Here is instruction:\n.1. Go lichess.org and click \"play with a friend\" option at right side.\n.2. Select your color: white, random or black. Site will give you a link. Something like this https://lichess.org/mPzr08FV\n.3. Post this link anywhere (ZeroMe, chatroom (like http://127.0.0.1:43110/zeromedia.bit )). First guy who goes by that link will be your opponent, 2nd, 3rd and other guys will be spectators. For you and your opponent there is a chat, chessboard, ability to rewind bad moves by asking your opponent's permission to do that.",
			"date_added": 1477827687
		},
		{
			"post_id": 1477990219,
			"body": "Question: How to watch youtube without annoying messages?\nOne simple ways is to download video, then watch it via player. No pop-ups, no commercials. You just take url like https://www.youtube.com/bla-bla-bla and transform it into https://www.ssyoutube.com/same-bla-bla-bla (just add two \"s\"es before \"youtube\" word), it will take you to place where you can easily download video and watch it without \"distractors\". Some times youtube doesn't allow you to watch some videos, it demands you to proof you are adult or something, but screw that, I do not want to proof anyone anything, I can use this method and get video in that case.\nHere is my question: does anyone know some other effective ways to watch youtube without being under constant distraction of some banners/pop-ups/comments? I heard something that sounds like \"add-block\" or \"odd-block\". How to spell it, what is it, and how to use it?",
			"date_added": 1477990113
		},
		{
			"post_id": 1477994438,
			"body": "Economics basis in 30 minutes: https://www.youtube.com/watch?v=2jj2ye0XuXE\nI never use a credit/debt: I never borrow money from anyone, and I never give someone money in exchange for promise he/she will give it back. To be 99.9% true, there can be some exceptions (I can give someone money), but in those cases I am prepared that person can never pay me back. I watched this video and for me it is a new idea that \"credit\" and \"debt\" can be somehow different. I always thought (and I still think that way) that word \"credit\" is lying/bullshitting/polite variant of truthful/cynical word \"debt\". And word \"debt\" means someone wants money or other resource from you and this someone have reasons for this. I do not want willingly give reasons for anyone to be wanting something from me.\nAnother fun linguistic thing: in russian language constructions such as \"you must bla-bla\" or \"you have to bla-bla\" use word forms based on word \"debt\". For example \"I must go visit my friend\" in russian sounds like \"I am indebted to go visit my friend\", or \"you must be nice\" sounds like \"you indebted to be nice\". Most people do not bother themselves to think about it, but I do think and find it is ridiculous. If someone says to me \"you are indebted (you must) bla-bla-bla\" and my Anti-Troll Defense System Alarm Activates then I can do one of those:\n.1. Say: \"I didn't borrow anything, so I am not indebted to anyone (I must not)!\n.2. Ask: \"Who wants this from me?\" or \"Indebted to whom?\".\nMost trolls become scared after this, I am not \"easy target\" for them.",
			"date_added": 1477994331
		},
		{
			"post_id": 1477996218,
			"body": "It made me laugh! Just started to watch this video: https://www.youtube.com/watch?v=oEtJcOZmxjI&index=35&list=PLFfM65xLnO-ElYIU3swM2v4wSHqy2ccDV I did not watch it, so I talking about 1st 30 seconds of it. It starts from quote: \"We learn from history that we do not learn from history\". I can't explain, but something very funny happens in my mind every time I think and try to understand this statement! :-] It is some kind of blowing mind paradox!",
			"date_added": 1477996110
		},
		{
			"post_id": 1478000462,
			"body": "Joke: Anti addiction programm promo.\nIn russian language there are many jokes based on fact that there are many unhappy families. So it is common to have struggle inside family, and think that making family was a mistake. There are many jokes about \"mother of wife\" (do not know english word, lazy to use dictionary now) attacking (psychologically) husband and so on. So this joke is result of combining that fact with some typical anti addiction programm promo. \"You got married - Stop your friend!\".",
			"date_added": 1478000353
		},
		{
			"post_id": 1478079443,
			"body": "Question: How to manage Limit (of text you can write) of ZeroMe?\nHere is a problem: \"Content sign failed: invalid private key.\" message started to appear every time I post or comment something, or edit and save on ZeroMe. I had a conversation with SickBird when same thing happened to him. And it looks like it is because of Limit. Should I delete my old posts to be able to write new ones? I deleted some and \"sign fail\" message stopped to appear. Should I delete every comment in the past I wrote on other people posts? Is there some automatic way to start from \"blank\"? And what if I comment someone's post and then author of post deletes it then what happens with my comment? Is it becomes deleted or is it becomes stuck in the timeline? In last case am I doomed to eventually become unable to do/write anything in long term? I do not want to create new ID like Flyman1, Flyman2, Flyman3 and so on. Is there a way to kill Flyman profile entirely and create new one? And how to check my usage of Limit?",
			"date_added": 1478079331
		},
		{
			"post_id": 1478256716,
			"body": "Question: Coordinates inside jpg file. How to detect, read, remove, edit them?\nTimes to times I hear about modern photo cameras and cell phones add coordinates of where picture was made (when picture was made). Surprise (I hate them)! So now I want to know how to deal with this fact. I want to know my photos doesn't contain coordinates. Simple idea is to convert jpg file into bmp file, check size of bmp (it must be header + 3 * X * Y) to be sure this bmp has no \"additional\" data, then convert this bmp into jpg file back. But it causes loss of quality. So where exactly in jpg file are those coordinates? How can I read them from my and other's photos, and how can I \"zero\" them?\nP.S. this video inspired me to ask this question: https://www.youtube.com/watch?v=fSErHToV8IU&index=2&list=PLOGi5-fAu8bGbhMeeCBndw_q9cbajYo5z",
			"date_added": 1478256603
		},
		{
			"post_id": 1478261211,
			"body": "YT Parody:\n.1. Simpsons + Game of Thrones: https://www.youtube.com/watch?v=ZcSSpw7t044\n.2. \"Game of Thrones\" 2D/Old RPG: https://www.youtube.com/watch?v=hftnySHVnF0",
			"date_added": 1478261097
		},
		{
			"post_id": 1478337961,
			"body": "Half Joke or \"I am 50% Serious\": Fail of judgemental thinking. Or proof of relativeness of \"Loser and Winner\" idea.\nConsider two guys who both jump over gaps. 1st guy jumps over 1 meter gap and successful, 2nd guy tries to jump over 3 meters gap and fails. They both have same skill to jump over 2 meters gap, but here is a paradox (?): one is a \"loser\", other is a \"winner\". Conclusion: reality and opinions are very different things.",
			"date_added": 1478337846
		},
		{
			"post_id": 1478344820,
			"body": "Youtube video: Money vs Currency.\n* Your true wealth is your time and your freedom.\n* Money is a trading tool that stores the economic energy that is your time and freedom, whereas currencies leak them away.\n* Gold and silver are the ultimate money, simply because of their properties.\n* Fiat currencies are based solely on confidence, and are always return to their intrinsic value of zero.\n* Government  don't like gold, because it imposes restraint.\n* Rising prices are a symptom of an expanding currency supply.\n* Gold and silver always account for an expanding currency supply.\n\nIt is a quote from 1st (of 7) episode \"Hidden Secrets of Money\": https://www.youtube.com/playlist?list=PLE88E9ICdipidHkTehs1VbFzgwrq1jkUJ\nP.S. Fun thing, in english language you have words \"money\" and \"currency\". It was a surprise for me those words can have different meanings! I thought they are pointing to same thing. And in russian language I can't remember words I can use to distinguish (to make difference) between \"money\" from \"currency\". You have bunch words that seem to be meaning \"currency\", but I can't remember word for \"money\" in it's true meaning.",
			"date_added": 1478344704
		},
		{
			"post_id": 1478356318,
			"body": "Fun term: Cycle-logical.\nThis word sounds like word \"psychological\", but not exactly. :-]\nIt is like system-thinking considering long-term cycles. \"Cycle-Logical\" - very fun word that can be useful :-] (I took it from 7th part of \"Hidden Secrets of Money\").",
			"date_added": 1478356201
		},
		{
			"post_id": 1478512351,
			"body": "Thought of Pessimist: Life is short, so wait/suffer a little.",
			"date_added": 1478512233
		},
		{
			"post_id": 1478598926,
			"body": "Quantum mechanics visualized: https://www.youtube.com/watch?v=WIyTZDHuarQ (At last I found something that makes some sense!).\nP.S. Walkers... :-]",
			"date_added": 1478598807
		},
		{
			"post_id": 1478687936,
			"body": "Watching Youtube about AntiTroll Tactics: Narcissist's Bag of Tricks.\nhttps://www.youtube.com/playlist?list=PL4eLWsS5ND-9GyCbo6DFQ25nn-XkRb3Tf\nI watched 04 of 51(actually I didn't watched, I was listening while doing some work using my eyes and hands). What he is talking about is strongly correlated/aligned/resonated (fail to get right word) with my thoughts and experience.",
			"date_added": 1478687816
		},
		{
			"post_id": 1478689265,
			"body": "Antitroll Tactics Fun: They playing a game with you.\nTrolls (you can call them Narcissists, Toxic or Highly-manipulative people, it doesn't matter) like to ask you not because they want to know answer on their question. No, it is a game they play. They want something else. How to detect this. Easy. They can ask same question many times and act as if they didn't ask it before. If they were interested in your answer, then they could learn it from your 1st answer and never ask it again. But what they want is to play with you, to see your reaction. Especially if you showed them very emotional reaction before, or you became unbalanced/unstable. Some troll seek for victims, there fore they try to unbalance you emotionally, and if they succeeded once, they can try it again same way in the future. So purpose of troll's question can be unbalancing you.\nSome times I am thinking about general rules of games troll playing. One rule of those game is very simple: \"Hide the fact that you playing the game!\". In case of \"asking a question\" goal of game is not \"to get an answer\", and of course Troll will deny it! So that is why one of \"fun antitroll tactics\" is just answer a question without any thinking about what Troll means by that. It is one of my favorite counter reactions if I know (or just suspect) my opponent is being a Troll. They hate it. They pretend they \"just asking a simple question\", and I \"just saying correspond answer\" and \"that's it!\". Troll can't allow himself to show you what it's goal is (goal of his game), because of foundational rule of the game (\"you must hide the fact that you playing the game\").",
			"date_added": 1478689144
		}
	],
	"post_like": {
		"1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1473785042": 1473785315,
		"15ySnmVuP2xGCWGxfbDdpjQxajSndfkmyL_1474001652": 1474013845,
		"19rk3ktkoBozUXDEpVHjUNoJNGCnsbzPra_1474065050": 1474119526,
		"1M29UgKTUcDsSHafheTS2W8Ec9RZiNMvRk_1473443056": 1474286360,
		"1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1474994523": 1475002875,
		"1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY_1475327310": 1475352898,
		"1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY_1475329176": 1475353708,
		"1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475777634": 1475780397,
		"14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1475865189": 1475946874,
		"1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1476127415": 1476170032,
		"14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1476515439": 1476518828,
		"1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY_1477010812": 1477034350,
		"1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY_1477119922": 1477138174,
		"14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1477078700": 1477145408,
		"14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1477336379": 1477377912,
		"14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1477335413": 1477386059,
		"1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1478037467": 1478076719,
		"1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY_1478263741": 1478263849,
		"1M5S5iwDzmj3yvzaf753c9qDckz3Vx5Qxo_1478312207": 1478336896
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Nofishes: what is this chinese text here? Did you translated this joke into chinese? Do you know chinese language?",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_12",
			"date_added": 1471455343
		},
		{
			"comment_id": 2,
			"body": "Link, please!",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1473785042",
			"date_added": 1473785334
		},
		{
			"comment_id": 3,
			"body": "I was hoping for something I can download and listen with my pocket player. But thank you anyway.",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1473785042",
			"date_added": 1473786026
		},
		{
			"comment_id": 4,
			"body": "Here is example of podcast I listen regularly: https://radio-t.com/ It is russian podcast so it may be useless for you, but what I want to say - it is easy to download mp3 from sites like that one. And when site hides \"download possibility\" or tries to feed me \"some bullsh*t\" I just prefer to seek for other things to do. :-]",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1473785042",
			"date_added": 1473788845
		},
		{
			"comment_id": 5,
			"body": "@Talnicrom: Try to unfollow me, please. And tell me does this work for you. If it works, you can follow me again if you want. Oh, sorry, I confused you for guy who follows me.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474136251",
			"date_added": 1474136879
		},
		{
			"comment_id": 6,
			"body": "Anyone who follows me, please, try to unfollow me and tell me does it work for you or not.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474136251",
			"date_added": 1474137137
		},
		{
			"comment_id": 7,
			"body": "@Talnicrom: Oh, one mystery solved. So it was you who fixed my \"unfollow\" problem? :-]",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474138033",
			"date_added": 1474140127
		},
		{
			"comment_id": 8,
			"body": "@Talnicrom: Another nice way to \"hunt\" for whom to follow is \"everyone\" mode and \"activity feed\" list. What about hashtags? Is it enough to type something like \"#myHashtag\" inside a post to associate this post with some topic?",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474138033",
			"date_added": 1474140956
		},
		{
			"comment_id": 9,
			"body": "I do not know what facebook is, and I do not want to know what is it (a can guess it is something like ZeroMe). And with ZeroNet you do not have to! Pink Floyd \"The Wall\" says: \"we don't need no force control. Teachers, leave us kids alone!\". :-]",
			"post_uri": "1M29UgKTUcDsSHafheTS2W8Ec9RZiNMvRk_1473443056",
			"date_added": 1474286742
		},
		{
			"comment_id": 10,
			"body": "@Talnicrom: I just checked this. I still can not unfollow using ZeroMe, but I can do it using ZeroMePlus. So it doesn't matter did you anything or not, it is still makes difference to use ZeroMePlus instead of ZeroMe!",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474398564",
			"date_added": 1474481308
		},
		{
			"comment_id": 11,
			"body": "@Hankrearden: That is the point! To find russian joke which is very funny and to have a trouble to translate it into english without being lost in translation and without loss of humor. So in that one I think I failed. And this is great.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474577170",
			"date_added": 1474581706
		},
		{
			"comment_id": 12,
			"body": "Try this sequence:\n1. Create a Test post.\n2. Do a pixel hunting between picture representing you (your awatar) and your post.\n3. Find pencil symbol which should appear and click it.\n4. Then options \"cancel/delete/save\" should appear.\n5. Use \"delete\"!",
			"post_uri": "1674XymFPbmAXh78xEpt3Pehtko6i2kvtA_1474653769",
			"date_added": 1474654795
		},
		{
			"comment_id": 13,
			"body": "@weakish: Because Shtirlitz is very cool super spy, so he can do coldblooded thinking in very difficult situations.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474657261",
			"date_added": 1474818729
		},
		{
			"comment_id": 14,
			"body": "@weakish: this joke is both russian and english because of same \"unhealthy\" association of word \"pussy\" with... same thing that is not a little cat! This is true for both english and russian language.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474575552",
			"date_added": 1474819049
		},
		{
			"comment_id": 15,
			"body": "Did anybody try it already? From my point of view nothing is happening.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474903876",
			"date_added": 1474904943
		},
		{
			"comment_id": 16,
			"body": "Oh, it looks like this new features are filters which are individual for every user. So it is not like \"like\"s or \"antilike\"s.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474903876",
			"date_added": 1474905629
		},
		{
			"comment_id": 17,
			"body": "@Talnicrom: This is great! Now we can \"like\" comments here.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474903876",
			"date_added": 1474915054
		},
		{
			"comment_id": 18,
			"body": "@Talnicrom: About messages which are marked as spam or ugly by guys I follow. I do not know is this a good idea. I think for start/test it can be nice to have some indication... I mean it is good to see some warning sign that one of your friends marked this post as a spam or it is ugly rather than hide this post.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474903876",
			"date_added": 1474915549
		},
		{
			"comment_id": 19,
			"body": "@weakish: Here is another strange coincidence: why in both russian and english languages word \"to nut\" (he went nuts, он рехнулся (\"орех\" [orekh] is \"nut\" in russian)) as a verb is associated with madness/crazyness/insanity. I mean, what is a connection between nut and insanity? It is one of linguistic mysteries! :-]",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474575552",
			"date_added": 1475258646
		},
		{
			"comment_id": 20,
			"body": "@weakish: and another fun thing: I have read book about black holes and history of science about black holes. And in this book it was told French people considered term \"black hole\" as something unspeakable like english word \"f??k\". And the meaning of these french \"black holes\" were the same: \"NOT a little pussy cat\"!",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474575552",
			"date_added": 1475259188
		},
		{
			"comment_id": 21,
			"body": "Imagine what can happen if someone throw his poodle out of house and it will become wild. Wild Dire Poodle (not cute anymore). Scary.",
			"post_uri": "1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY_1475327310",
			"date_added": 1475353183
		},
		{
			"comment_id": 22,
			"body": "Magnet link is just little string (bunch of text symbols). Something that begins like \"magnet:?xt=urn:bla-bla-bla-bla-bla...\" and ends before next \"=\" symbol. How it possibly can not work? You just need to copypaste text to your torrent client. I hope this will help you.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1475400513",
			"date_added": 1475504721
		},
		{
			"comment_id": 23,
			"body": "@Dergatt: Yes, that is annoying. I mean, when you searching for something and you find at last some (download link)/(magnet link)/(torrent)... and it doesn't work! Sad thing. It is \"pointers and objects\" thing (pointers are not objects they point to), or it is \"map and territory\" thing, or... I am short of analogies. Oh, here is good analogy: it is like someone tell you there is an apple on a table, you check the table, but there is no apple for some reason. Annoying.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1475400513",
			"date_added": 1475609422
		},
		{
			"comment_id": 24,
			"body": "And I got audiobook \"Wisdom of Psychopaths\". One big 400Mb mp3 file. I've splitted it into 10 parts 50 minutes each wav, made them loud, encoded into mp3 again and load them into my \"pocket\" mp3 player. This made me happier for a while. What a joke: psychopath needs to split something into pieces!",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475609939",
			"date_added": 1475612134
		},
		{
			"comment_id": 25,
			"body": "@meidan: here is a magnet link for audiobook \"Wisdom of Psychopaths\" after my manipulations: magnet:?xt=urn:btih:96095659B476046B19EA3AFA0A028FC1052EB88A&dn=__wisdom_of_psychopaths It is new way for me to share files, so I am not sure if it works or not. I will be glad to know if you successfully download mp3s. Hash is: 96095659b476046b19ea3afa0a028fc1052eb88a Wait a minute, it looks like hash of a torrent is part of magnet link of a torrent.",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475609939",
			"date_added": 1475655091
		},
		{
			"comment_id": 27,
			"body": "@meidan: I am seeding now, but it looks like nobody downloading. I will be online for about 2 hours from now... After 2 hours nothing happens. I am about to go offline. Next time I will try to ask people to download this torrent. Maybe I am not understand how it works and made some mistake.",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475609939",
			"date_added": 1475692210
		},
		{
			"comment_id": 28,
			"body": "@Voruman: how about this one? magnet:?xt=urn:btih:96095659B476046B19EA3AFA0A028FC1052EB88A&dn",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1475739367",
			"date_added": 1475740545
		},
		{
			"comment_id": 29,
			"body": "Or simply using hash: 96095659B476046B19EA3AFA0A028FC1052EB88A",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1475739367",
			"date_added": 1475740617
		},
		{
			"comment_id": 30,
			"body": "Oh, It looks like someone managed to download! Is that you, Voruman?",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1475739367",
			"date_added": 1475740904
		},
		{
			"comment_id": 31,
			"body": "@Voruman: strange, I think I start to understand you without translator. Jes looks like Yes, laboras looks like labour (hard work). So hash works, and my magnet link doesn't. Thanks, it helps a lot.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1475739367",
			"date_added": 1475741141
		},
		{
			"comment_id": 32,
			"body": "@meidan: Voruman managed to download this torrent using hash. And it looks like something wrong with my understanding of magnet link, so magnet link doesn't work. Try to use hash: 96095659b476046b19ea3afa0a028fc1052eb88a",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475609939",
			"date_added": 1475741330
		},
		{
			"comment_id": 33,
			"body": "@Voruman: is that so? All you need to fix my magnet link to make it work is change all capital/big letters into noncapital/small letters? I will check this hypothesis next time I try to send something via magnet link. It is very funny! :-]",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1475739367",
			"date_added": 1475741977
		},
		{
			"comment_id": 34,
			"body": "@meidan: Voruman says this link works: magnet:?xt=urn:btih:96095659b476046b19ea3afa0a028fc1052eb88a&dn=__wisdom_of_psychopaths It is strange and funny, but all I need to fix magnet link to make it work is \"decapitalize\" big letters into small ones.",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475609939",
			"date_added": 1475742224
		},
		{
			"comment_id": 36,
			"body": "@meidan: I love very much movies where time travel is involved. Here is example: https://www.youtube.com/watch?v=UTO0ogdNMdY It lasts less than 20 minutes, but it is worthy time travel movie. Here is list of time travel movies I am using: https://en.wikipedia.org/wiki/List_of_time_travel_works_of_fiction be careful not to mess movies list with book list - they both on the same page. Strange, I can't find movie \"Paradox\" 2016, maybe because it is new movie. It is nice time travel movie. Here is some films from that list I found nice: \"Coherence\" 2013, \"About Time\" 2013, \"Mine Games\" 2012, \"Source Code\" 2011, \"FAQ About Time Travel\" 2009 (It is fun half comedy film). And movie with 4 or 5 seasons \"Continuum\" 2012-2015. But I watched them so now I don't. If you want to know what I am watching currently, it is: \"Supernatural\" (watched 5 seasons of 9 or 10, 6th to go), \"Californication\" (you may found this show disgusting, but it is about guy from X-Files, and I watched 5 seasons before, so I am hooked and want to continue watch it just because!), Simpsons (23th season).",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475609939",
			"date_added": 1475778555
		},
		{
			"comment_id": 37,
			"body": "It can be happening because you study too much. Be sure you do not study more than 10 hours per day! I am 50% serious! And do not forget to sleep, it may cause hallucinations. :-]",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1475777634",
			"date_added": 1475780370
		},
		{
			"comment_id": 38,
			"body": "https://www.youtube.com/watch?v=1g0KThAbkjU",
			"post_uri": "1CPx3458RryZUzbz2vBUpomG2ihbcNgg6w_1475769382",
			"date_added": 1475781293
		},
		{
			"comment_id": 44,
			"body": "It can help you to detect bullshit: https://yourlogicalfallacyis.com/pdf/Logical_Fallacies_on_A4.pdf\nPoster: https://s3.amazonaws.com/yourlogicalfallacyis/pdf/LogicalFallaciesInfographic_A3.pdf",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1476127415",
			"date_added": 1476175095
		},
		{
			"comment_id": 47,
			"body": "@Sick Bird: do you really think (<A> St. Bernard Dog) can go inside a fox or rodent hole? E-e-e-e! Wrong! :-] Poor St. Bernard Dog might stuck in one of those holes. Or do you mean by (answer is A) it is answer to your question: hexagonal grid? I do not know this software, but I watched youtube to figure out what background it has.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1476173990",
			"date_added": 1476257936
		},
		{
			"comment_id": 48,
			"body": "@Sick Bird: :-] Are you kidding me? You are choosing big dogs to go to the small hole? I think your next answer is <D>, but huge one: big nasty evil mutant godzilla poodle.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1476173990",
			"date_added": 1476258781
		},
		{
			"comment_id": 49,
			"body": "@Sick Bird: But I can see your messages: \"this is double dip lifeline\" and \"sorry i can't post, the massage is ::: Content sign failed: invalid private key.\".",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1476173990",
			"date_added": 1476262032
		},
		{
			"comment_id": 50,
			"body": "@Sick Bird: I engaged same thing on one of chat rooms. And I do not know solution for that. I will create a new post about your problem, lets see maybe people can help... Here is an idea: there are at least two different zites for ZeroMe: ZeroMe itself and ZeroMePlus. Try to switch to another zite. I, for example, can't do \"unfollowing\" at ZeroMe but can do it at ZeroMePlus. Another possible solution is to wait a day. One day I was unable to see anything on ZeroMePlus as if I had no posts sent ever, as if I had no profile, only option was to create new idenity, there was no option to select Flyman because Flyman was already exist. And next day ZeroMePlus came to normal as if it was normal all time.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1476173990",
			"date_added": 1476267431
		},
		{
			"comment_id": 51,
			"body": "@Sick Bird: can you comment here?",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1476267669",
			"date_added": 1476267637
		},
		{
			"comment_id": 52,
			"body": "@meidan: i am watching https://www.youtube.com/watch?v=0tqq66zwa7g at 7th minute I am thinking it might be interesting for you too. It is about \"placebo effect\" and how our expectations cause significant effect on what happens in our body. It is probably not in this video (I am at 7th minute) but I like to do mystical thinking and often believe that our expectations even cause events around us. For example, I knew some guy who was expecting all dogs around want to bite him, and many dogs were reacted accordingly (they were trying to bite him). I expect dogs are nice... mostly, there fore they ignore me (mostly).",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1476127415",
			"date_added": 1476269626
		},
		{
			"comment_id": 55,
			"body": "My 1st/native language is russian, english is 2nd. And Russia is not country where I live.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1476261899",
			"date_added": 1476341261
		},
		{
			"comment_id": 57,
			"body": "Yeah. Optical Illusions are Brain Failures! That is great thought.",
			"post_uri": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1476515439",
			"date_added": 1476518924
		},
		{
			"comment_id": 58,
			"body": "emotionless stubborn person with purpose in his/her mind. :-] 252 divided by 36 is exactly 7 (7 x 36 = 252). So I suggest there is \"Stoic Test\" with 36 questions in it. Each has 7 possible answers. Each answer has it's score from 1 to 7. Or maybe there are 4 answers <A>, <B>, <C>, <D> and scores for them 1, 3, 5, 7 randomly distributed to be interesting. For example, question: imagine you studying something, reading books, thinking and some person tells you: \"you wasting your time, that is sux what you are doing\". What is your common reaction: <A> Sadness: \"Mummy, I wanna cry and see my mummy :-[ \" - one point of stoicness <B> Anger. \"How rude of you!\" - 3 points; <C> Little disturbed: \"Go play your stupid games by yourself. I am studying here.\" - 5 points. <D> Completely Cool, no emotions at all: \"I am not interested in your opinions, my friend\" - 7 points. But I am just kidding. Do you have whole \"Stoic Test\" (or link)? Can I test myself just for fun?",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1476634027",
			"date_added": 1476698002
		},
		{
			"comment_id": 61,
			"body": "Me too! What I did for myself is started to think there is no Daylight Saving Time. So all my clocks ticking by GMT +3:00 constantly (at any time in the year). So I know when I wake up and when I fall asleep. Here are some fixes for possible troubles:\n.1. At question \"what time is it?\" I automatically add \"by summer time\" at the end of my answer.\n.2. You need to be aware of summer or winter time it is now outside anytime you make appointment with other people, so before you talking somebody to make meeting at specific time, be sure you both in same \"time zone\".",
			"post_uri": "1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY_1476757760",
			"date_added": 1476777021
		},
		{
			"comment_id": 62,
			"body": "@meidan: I am file oriented person. I like sites where I can easily download some files, or at least I can see something interesting on that site. This kind of site I do not like. This kind of sites has properties that warn me that it is a bad site: 1. It says \"We, maybe (just maybe) have something interesting, but we will not show it to you. 2. You not registered, go make registration. 3. All that bla-bla-bla around Stoicism without saying anything what Stoicism is.\nStoicism seems like something interesting, so I will search for it in some other places (Youtube, G??gle, e.t.c). I'll post a link in case I found something interesting.",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1476634027",
			"date_added": 1476861446
		},
		{
			"comment_id": 66,
			"body": "This model uses only 2 grades of power: it is within your power or it is not within your power. I find more useful model which uses 3 grades of power: red, yellow, green. I do not know other sources, there fore I think I am invented it (and it will be some fun for me if you give me a link someone described this model more accurately). So here it is: all you can or can not do you can place in 3 different zones: 1. Green. You can do it easily. You have enough resources (skills, knowledge, time, energy, proper mood, e.t.c.). 2. Yellow. You can do it, but... it may cost you very much: you must work hard, make research, investigate; overspend time, energy. And you never know will you succeed or not. 3. Red zone. It is like yellow zone, but extreme. You have less chances of success, you need to waste almost all your efforts, and you can damage your health or mind for nothing. Very dangerous.\nHere is exampls: eating piece of cake is piece of cake - easy, you can do it, you did it before lots of times - green zone; breaking wall using your head as a ram - red zone - you probably will not break the wall, but you can be disappointed and have your health damaged, or even die trying. For some guy breaking wall with his head may be in green zone - he is a trained ninja, monk or something, but I guess for most of us it is in red zone. Problem is you never can be sure about is it possible or is it impossible, but it is useful to think about things as they are in red zone... for now at least. More powerful you become, more things shifts into your green zone, and some things can even shift from red into yellow zone.",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1476805852",
			"date_added": 1476871839
		},
		{
			"comment_id": 68,
			"body": "I know case where person bought PC video game on dvd. Game is totally single player and offline. And guess what? Game demands you to go online and do some stuff just to prove you are not pirated it. Think this. Guy bought game and it not works, he had no i-net. So those \"developers\" deserve to be \"pirated\"! Best solution for guy was to download cracked version of same game using his friend's i-net. :-]",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1476959631",
			"date_added": 1476968863
		},
		{
			"comment_id": 69,
			"body": "@Dergatt: @Durand: I want to share with you my definition of word \"own\". If something truly is your own it means you can do anything with it: share it with your friends/enemies, multiply/duplicate it, destroy it (if you don't like it anymore), study it's contents (reverse engineering), anything you can imagine you can do if you truly own something. Thing is you do not truly own anything. It is more like you loan it: I mean someone else own this thing and you just loan it and this someone else dictate you rules (you can do that, and you can't do that). Very big \"red flag\" you loaning something instead of owning thing is you have to pay every month/year/day for \"owning\" that thing. It is not owning it is loaning. And same thing is about legal-illegal concept. What is legal or illegal? Someone powerful dictates his will: he do not like some things you might do and names those deeds \"illegal\", he wants you to do things specific way - that he calls \"legal\". Joke: soon it can become illegal just refuse to be stupid! You doing something and you do not pay for it because you smart enough to find your own ways - you criminal! Example: you learned illegally how to read, so you do not have to pay some specialist to read books for you - it is illegal, you are criminal! You can grow your own food, so you do not have to pay for food - you are criminal! Jeez, all this \"copyright\" thing is totally bullshit of men in power to make other people stupid because it is profitable. And one last question: when you pay for some \"legal\" thing, where goes you money, wha? Do you really think you support guys who create something. Most money goes to powerful people who use those guys who create.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1476959631",
			"date_added": 1477034032
		},
		{
			"comment_id": 70,
			"body": "I never thought kefir can be something special. I used to fact that in my surroundings I can just buy kefir in same place I can buy milk. I like kefir much more then a milk. I wonder, you making kefir just because it is fun for you to make your own kefir, or you can't buy it and it is only way to have it?",
			"post_uri": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1477078700",
			"date_added": 1477145403
		},
		{
			"comment_id": 71,
			"body": "I am not using Zero Board few months. So, if nothing changed then ZeroBoard has 10 minutes interval preventing you to post anything. You post something, you wait 10 minutes, you post again, otherwise: \"...Please try again later\".",
			"post_uri": "1FeQLPvd3hmLFAjrY3xzNvwz3gadTB2gu4_1477262687",
			"date_added": 1477291618
		},
		{
			"comment_id": 72,
			"body": "Never engaged this type of humor before, thanks. Do??ld Tr?mp saying: \"Excuse me? I don't need the people! I wand ME, personally. Forget all the people!\" thats was very funny. And politician woman talking about rise of the dead and zombies...",
			"post_uri": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1477336379",
			"date_added": 1477378309
		},
		{
			"comment_id": 73,
			"body": "There is no multiplayer games here as I know (I want to be wrong). There are some single player, for example: http://127.0.0.1:43110/1PANDAML8mLaRKPinGihTj5RkJV15awcjs/",
			"post_uri": "1BidCEzNjETypKRCaRFQ6myvDo71o6FDyC_1477383132",
			"date_added": 1477384272
		},
		{
			"comment_id": 74,
			"body": "Do not trust. Ask for proof. :-]",
			"post_uri": "19dSnqd1GpiMTnuiD4n1tPasyKTDfNSFyz_1477322954",
			"date_added": 1477386286
		},
		{
			"comment_id": 75,
			"body": "Blue.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477389461",
			"date_added": 1477389376
		},
		{
			"comment_id": 76,
			"body": "Red.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477389461",
			"date_added": 1477389383
		},
		{
			"comment_id": 77,
			"body": "Yellow.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477389461",
			"date_added": 1477389400
		},
		{
			"comment_id": 78,
			"body": "Orange.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477389461",
			"date_added": 1477389410
		},
		{
			"comment_id": 79,
			"body": "Green.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477389461",
			"date_added": 1477389417
		},
		{
			"comment_id": 80,
			"body": "White.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477389461",
			"date_added": 1477389424
		},
		{
			"comment_id": 81,
			"body": "Black.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477389461",
			"date_added": 1477389430
		},
		{
			"comment_id": 82,
			"body": "<A> Some guy who does bad behavior.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477391433",
			"date_added": 1477391373
		},
		{
			"comment_id": 83,
			"body": "<B> There is animal which looks like donkey or mule. It digs hole in the ground and uses it as home. So ass hole is home where ass lives.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477391433",
			"date_added": 1477391393
		},
		{
			"comment_id": 84,
			"body": "<C> It is point on the body of living beings which used to do defecation.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477391433",
			"date_added": 1477391405
		},
		{
			"comment_id": 85,
			"body": "@Militaryriotlab: Maybe I am stupid because I believe in this principle. I mean, if someone offer me something and at same time start to \"bullshit\"ing me about \"there is no time\", in that case I tend to \"say goodbye\" automatically, like stupid guy. It may be stupid in some situations, but it is a price I willing to pay to be protected in most situations. Does it applies to job offers? I do not have that experience, so I do not know. But I guess yes, if you have choice, I think, you better chose job offer where they allow you to think about it. Or even if you take \"there is no time\" offer, then be prepared to waste some of your resources for nothing (time, money, energy).",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477384249",
			"date_added": 1477392333
		},
		{
			"comment_id": 86,
			"body": "@Militaryriotlab: how did you make word \"my\" to be bold? Teach me, please.\nOh, ZeroNet Hello just showed me how to do this. **Testing**.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477384249",
			"date_added": 1477395023
		},
		{
			"comment_id": 87,
			"body": "@ZAlex: .1. Didn't know it works only with ZeroMe Plus, thanks.\n.2. As I know in ZeroPolls you can't allow other people to create their own option, which can be used for even other people to vote for it. In this example, people can add new color to vote.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477389461",
			"date_added": 1477399709
		},
		{
			"comment_id": 88,
			"body": "@Militaryriotlab: Thanks, I tested those things, now I can do that.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477384249",
			"date_added": 1477400027
		},
		{
			"comment_id": 89,
			"body": "@Renha: It doesn't matter. What I mean is word \"пятьдесят\" is often pronounced not as \"пятьдесят\" but something much shorter. And yes, your \"пейсят\" feels like very common too. But \"писят\" looks more like \"to pee\" verb.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477467816",
			"date_added": 1477470403
		},
		{
			"comment_id": 90,
			"body": "\"Not music at all\" category maybe?",
			"post_uri": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1477500870",
			"date_added": 1477553114
		},
		{
			"comment_id": 91,
			"body": "@ks: it is not any kind of jazz. Jazz is complex: it has rules, it has harmonies, structure. Jazz is not some random crap anybody can do. It requires a study. It is like science or mathematics. Check this example which shows idea: https://www.youtube.com/watch?v=ofHPxmkN6G4 (skip about 2 minutes of talking).",
			"post_uri": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1477500870",
			"date_added": 1477554503
		},
		{
			"comment_id": 92,
			"body": "@ks: Oh, now I can see clear, thanks. Thing is I wasn't been aware (to this moment) that I consider something as music **only** if it is tonal and has harmonies.",
			"post_uri": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1477500870",
			"date_added": 1477559003
		},
		{
			"comment_id": 93,
			"body": "How do you like this kind of music? https://www.youtube.com/watch?v=sqAs2SBCgMU It is made from something that definitely not a music. https://www.youtube.com/watch?v=J7UwSVsiwzI\nFun motivators:\nhttps://www.youtube.com/watch?v=yQb1JVxv8ZE\nhttps://www.youtube.com/watch?v=gJscrxxl_Bg\nhttps://www.youtube.com/watch?v=UhRXn2NRiWI&index=5&list=PL08FD35E184A24E7F",
			"post_uri": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1477500870",
			"date_added": 1477560490
		},
		{
			"comment_id": 94,
			"body": "@ks: \"Bad Lip Reading\" and \"Schmoyoho\" are great. Thank you.",
			"post_uri": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1477500870",
			"date_added": 1477565078
		},
		{
			"comment_id": 95,
			"body": "why do you sorry? It is fun japan improvisation on \"Pen-Pinapple-Apple-Pen\". \"If you sorry, do not do thing which makes you feel sorry. If you do something, do not feel sorry\".",
			"post_uri": "1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY_1477613214",
			"date_added": 1477640421
		},
		{
			"comment_id": 96,
			"body": "First you fart, then you overweight, it is not OK, if you see fast food, stay the f??k away, it's not OK! I am 50% serious: https://www.youtube.com/watch?v=yQb1JVxv8ZE",
			"post_uri": "1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY_1477646860",
			"date_added": 1477648912
		},
		{
			"comment_id": 97,
			"body": "@KosherX: At the same time I am 50% kidding/joking. There is type of joke when you can't call it a joke 100% because part of it is \"serious thing\". Same thing with something \"serious\": things are serious only by some part of whole, other part is not serious, it is a joke. So I created this expression and think it is fun: \"I am 50% serious!\". You can imagine tree that have two branches at some point, lets call them left branch (50%) and right branch (50%). So this tree have left branch and it is 50% of whole tree.",
			"post_uri": "1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY_1477646860",
			"date_added": 1477727064
		},
		{
			"comment_id": 98,
			"body": "@Eibriel: it is not just a sum, because in wave file (or inside memory that will be interpreted by your computer as a sound) there are words (1 word is 1 byte + 1 byte), words are just numbers from 0 to 65535 (can be interpreted as numbers from -32K to +32K). Imagine you making sum of two sounds and in some point 1st sound has 65535 and 2nd sound has 65535 too. Sum of 65535 + 65535 doesn't fit in two bytes! You can make sum and cut result to 65535 each time it is \"out of range\" but result sounds very bad (you can hear it). Someone told me to use something \"logarithmic bla-bla\" but I didn't understand and now I can't remember what it was.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477733890",
			"date_added": 1477770273
		},
		{
			"comment_id": 99,
			"body": ".1. What do you want exactly? And who stops you from doing it?\n.2. Words \"freedom\", \"force\", \"oppressor\" are empty structures. They make no sense unless someone fills them with his/her own experience. Imagine you are movie director. You can't just capture \"freedom\" on your video camera. To make movie \"We fight for our freedom\" you can make scenario where some \"bad\" guys locked some \"good\" friends in some dungeon inside some castle. \"Bad\" guys torture poor \"good\" guys. And other \"good\" people preparing and then executing assault of that castle, killing \"bad\" guys and rescue \"good\" guys. You can call that \"Freedom\", but this is one of those things that exists in your head only! There can be \"good\" guys, \"bad\" guys that involved in some activity (they do specific things), but in reality out there, there is no such \"thing\" as \"freedom\", it is imaginary.\n.3. With my own associations with your spectrum I more like to \"do nothing\". If someone successfuly stops me from doing one thing I want to do, then I most likely choose to do something else (from my list of things I want to do) to make this \"oppressor\" to do more hard work to stop me this time. Or I can seek for other ways to do same thing. And I prefer to detect how I support \"oppressor\" and at same time not aware of it. Best way to deal with oppressor is to stop feeding it. Eventually it will lose it's power and cease to exist.",
			"post_uri": "1MdwjTFbwpWCLfyo2ZjeXzB7DbL7euNPBi_1477774571",
			"date_added": 1477818287
		},
		{
			"comment_id": 100,
			"body": "@Militaryriotlab: Words are like variables in programming languages. If you use variable without filling it with some exact value, it will not work. Let me try fill those variables, but your teacher can have other meanings. Lets guess that \"Law\" is just list of \"rules\" - list of thing you can do and things you can avoid to do for being \"good\" guy for all people who agreed with this \"Law\". Word \"by\" used to show that someone is cause of some activity, so \"rule by law\" means \"law is ruling (people)\", so word \"rule\" is verb in this case. Word \"of\" used to connect two nouns, so \"rule of law\" means \"law has this rule\", so word \"rule\" is noun here.",
			"post_uri": "1MdwjTFbwpWCLfyo2ZjeXzB7DbL7euNPBi_1477772920",
			"date_added": 1477819248
		},
		{
			"comment_id": 101,
			"body": "@Militaryriotlab: here is another idea: word \"by\" is much stronger than word \"of\". It is like \"I am sure\" is much stronger than \"I think\". \"Book written by Flyman\" is very strong, it means exactly that Flyman is one who wrote this book. And \"book of Flyman\" is not so specific, you know that \"book\" somehow related to \"Flyman\" but you can't tell how: maybe Flyman wrote this book, maybe someone else wrote this book about Flyman, maybe Flyman likes this book, maybe Flyman mentioned this book, maybe Flyman has this book, e.t.c. So \"rule by law\" can mean \"this rule is for sure caused by law\", and \"rule of law\" can mean \"this rule somehow related to law\".",
			"post_uri": "1MdwjTFbwpWCLfyo2ZjeXzB7DbL7euNPBi_1477772920",
			"date_added": 1477900986
		},
		{
			"comment_id": 102,
			"body": "@Durand: I do watch TV shows. To not watch TV for me is about something else. By TV I mean this TV-box where you have no control: you can't pause, rewind, you have to watch those promos and commercials, where you can't choose when to watch you TV-show. All you can do with TV-box is switch it on or switch it off, switching channels doesn't make any difference. I am not so \"advanced in  self actualization\" as this guy, so I download TV-shows, and this way I can regulate when and how much I watch. And what is \"The Newsroom!\" show about? Is it about Time Travel? Is it about multidimensional space? And one more thing about why I hate TV: here where I am all english language movies/shows are translated into russian/ukrainian (basically 90% same language), and this translation becomes worse and worse (Maybe I'll post some fun details of this phenomenon) year after year, and my understanding of english language is growing, so it was natural for me to stop watching TV-box.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477775739",
			"date_added": 1477986088
		},
		{
			"comment_id": 103,
			"body": "@Eibriel: Thank you very much, just started to use uBlock.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477990219",
			"date_added": 1477995621
		},
		{
			"comment_id": 104,
			"body": "@Eibriel: Oh, uBlock is extremely addicting! I can't even say \"I can leave it whenever I want\"! People, be warned. Once you used this, you can't quit. There is no return. :-]",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477990219",
			"date_added": 1477999424
		},
		{
			"comment_id": 105,
			"body": "@Durand: Thank you. Just started to download 3 seasons of \"Newsroom\": srt, ~1Gb per episode, 23.7Gb total, hash = 59b1c8120fda05bf8821f6bb056da4cbc978dd2c",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477775739",
			"date_added": 1478073578
		},
		{
			"comment_id": 107,
			"body": "@meidan: are you talking about typing some text? If this is the case, I use FAR. It is file manager and I am very file oriented, you can copy, delete, make folders, make files, you have two panels, and you have text editor. You can press \"F2\" any time you want to \"update\" file you editing.\nBeing file oriented means you aware/understand your work is just bunch of files. Files are just organized bunch of numbers. When I do something, I make \"_Backup\" folder somewhere and every day I change files while working, I create folder \"16_11_02_some_comment\" (inside \"_Backup\" folder) and I copy all files there. 16 is year, 11 is month, 02 is day, so when you have dozens of those folders they will be organized by time. And I backup the backup time to time :-] So backup your work and it will survive, and you will be happy and sane.\nP.S. \"So, FAR so good\". :-]",
			"post_uri": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1478038094",
			"date_added": 1478078310
		},
		{
			"comment_id": 108,
			"body": "@Cxgreat2014: Thank you.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1478078020",
			"date_added": 1478078400
		},
		{
			"comment_id": 110,
			"body": "@Durand: Thank you for the link. I like to watch long videos like lectures.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477994438",
			"date_added": 1478091978
		},
		{
			"comment_id": 111,
			"body": "@Nofish: Thank you for instruction. I found \"Identity Address\", it says \"105Kb of 164Kb used\".",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1478079443",
			"date_added": 1478092351
		},
		{
			"comment_id": 112,
			"body": "@KosherX: I didn't know, I tried to download this japan video via \"ss\" method. It doesn't work for me too.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477990219",
			"date_added": 1478246490
		},
		{
			"comment_id": 113,
			"body": "@ZAlex: https://en.wikipedia.org/wiki/Exif Yes, that is what I am talking about. EXIF or TAG or whatever. How to edit/read/remove it? Any software, or algorithm (I can do hex-edit)?",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1478256716",
			"date_added": 1478257424
		},
		{
			"comment_id": 114,
			"body": "@ZAlex: Thank you, ExifToll looks promising, because it is command line and I like to be doing things via FAR.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1478256716",
			"date_added": 1478260138
		},
		{
			"comment_id": 115,
			"body": "@KosherX: I delete a post in this kind of case. Do you know about limit on ZeroMe? If you encounter message in red something like \"your private key fail, can't sign your post\", it means you need to delete some of your old/any post(s) to be able to post new ones.",
			"post_uri": "1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY_1478263741",
			"date_added": 1478334790
		},
		{
			"comment_id": 116,
			"body": "Do you know you can edit/delete posts and comments you wrote? Deleting your previous post can be useful because of limit (at some point you will not be able to post new messages unless you delete previous one(s)).",
			"post_uri": "1NQvmcUkean3BWS9N88P9dKYnP1TAB5kHz_1478314675",
			"date_added": 1478335999
		},
		{
			"comment_id": 117,
			"body": "What is that? Is it some quote? Is it some kind of humor or you are serious? Looks like speech of lying teenager, who wants to pretend he is \"cool\". There is a class/type of pretenders that talks like that (I am booper-trooper, top secret agent-smagent, I will get you, because you said something I do not like). Very typical. So what do you say, Thejumono? Are you this \"stupid teenager\" or you just posted a quote of some \"stupid teenager\"? In case you are \"stupid teenager\" than come and get me! :-]",
			"post_uri": "1M5S5iwDzmj3yvzaf753c9qDckz3Vx5Qxo_1478312207",
			"date_added": 1478336841
		},
		{
			"comment_id": 118,
			"body": "@Durand: Tried to listen to lectures on Steve Keen's channel. It looks like it is not for me. I do not like unnecessary complication by lots of references to something I didn't study/learn. I more like something like that: https://www.youtube.com/watch?v=ogqZ6pnWM7o Thank you anyway! :-]",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477994438",
			"date_added": 1478340950
		},
		{
			"comment_id": 119,
			"body": "Now I started to watch 7 episodes of \"Hidden Secrets of Money\": https://www.youtube.com/playlist?list=PLE88E9ICdipidHkTehs1VbFzgwrq1jkUJ",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1477994438",
			"date_added": 1478341601
		}
	],
	"follow": [
		{
			"follow_id": 21,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "156HySyXH37jFXXqKCwVq8HqsrZLZzy8Qx",
			"user_name": "rushka life feed",
			"date_added": 1473618993
		},
		{
			"follow_id": 22,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS",
			"user_name": "ZAlex",
			"date_added": 1473709146
		},
		{
			"follow_id": 23,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS",
			"user_name": "ZAlex",
			"date_added": 1473924817
		},
		{
			"follow_id": 24,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa",
			"user_name": "Talnicrom",
			"date_added": 1474138826
		},
		{
			"follow_id": 25,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ",
			"user_name": "ulrichard",
			"date_added": 1474357964
		},
		{
			"follow_id": 28,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC",
			"user_name": "meidan",
			"date_added": 1475782553
		},
		{
			"follow_id": 29,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY",
			"user_name": "KosherX",
			"date_added": 1476875487
		},
		{
			"follow_id": 30,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx",
			"user_name": "ks",
			"date_added": 1477649367
		}
	],
	"comment_order": 1,
	"settings": {
		"reverse_comment_order": true,
		"mute_ugly": false,
		"mute_spam": false,
		"mute_blocked": false
	},
	"flags": {
		"post-1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1474903876": 0
	},
	"blocked": [
		"14fdwxPt83nTw5vFaXTCR7KQkAxkXuGbAR"
	],
	"comment_like": {
		"19M1DT5vruSATEcbEczYRwCk2uPuLcATBa_29": 1475354406,
		"13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_14": 1475609431,
		"1EizNCr1TBaytrcEFBPrk8yk6eUFgNCC5r_10": 1477555041
	}
}