{
	"next_comment_id": 8,
	"user_name": "Technoshaman777",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "NinjaBeats sounds like an amazing project and I'm looking forward to it's debut. I am unable to get any of the demos listed above to work on Firefox, Edge or Chome. What am I doing wrong here? I can usually get webtorrent content to stream through Firefox. My error says \"it appears to be taking longer than usual, possibly lacks peers.\"  ",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478368568",
			"date_added": 1478426639
		},
		{
			"comment_id": 2,
			"body": "If a lack of peers is an issue, have you considered \"cloud seeding\" your demo content on a google drive or other cloud service? Kopykate does this with several of her streams on this webpage:   http://127.0.0.1:43110/1aCq7GiJfUfGZ4GftjYaYbsEngPFzcxvN/",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478368568",
			"date_added": 1478426751
		},
		{
			"comment_id": 3,
			"body": "@PaintNinja:  Maybe you could make the magnet link accessible as well on the streaming page. That way someone like me could download and assist with hosting it on Webtorrent. If more people do this, then your demo content will be available 24/7 because my PC is on 75% of the time with Webtorrent running.",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478368568",
			"date_added": 1478656965
		},
		{
			"comment_id": 4,
			"body": "If I share something on NinjaBeats as a test right now, does it somehow end up in your archive? Or is it private unless I send someone the link nor hash?",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478551863",
			"date_added": 1478822576
		},
		{
			"comment_id": 5,
			"body": "Looks good PaintNinja. I'm also seeding your demo content through Webtorrent Desktop. ",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478984039",
			"date_added": 1478992244
		},
		{
			"comment_id": 6,
			"body": "This is a really cool idea. I wonder if someone could adapt the your work to create a multimedia \"Facebook\" experience for ZeroNet. All content on a person's page could be webtorrent seeds that play albums, videos, and music when selected. A totally decentralized social media platform would be exciting. Not to get ahead of myself, but I dont' have any idea how you could control permissions on such a page so that those outside of your network can not view content you don't want them to see. ",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1478890231",
			"date_added": 1478992821
		},
		{
			"comment_id": 7,
			"body": "Great news!",
			"post_uri": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_1479068328",
			"date_added": 1479784455
		}
	]
}