{
	"next_post_id": 4,
	"next_comment_id": 4,
	"next_follow_id": 5,
	"avatar": "generate",
	"user_name": "Clarjon1",
	"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
	"intro": "Completely Random (As determined by dice roll) ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1471550269,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 2,
			"body": "uff. Nearly done with work. Just a few more hours, and then I can relax...\n\n\nSay, does anyone have some neat things I can check out on zeronet? ",
			"date_added": 1471651348
		},
		{
			"post_id": 1471973835,
			"body": "Hello, Zeronet! How are we doing today?",
			"date_added": 1471973832
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Andrewm: Not too much, just checking out zeronet :)",
			"post_uri": "1GoqcX6nr3x1DHM9L1Hmd9fona9ds5XuGo_1",
			"date_added": 1471551632
		},
		{
			"comment_id": 2,
			"body": "@Execin: I am so far!",
			"post_uri": "1GoqcX6nr3x1DHM9L1Hmd9fona9ds5XuGo_1",
			"date_added": 1471552492
		},
		{
			"comment_id": 3,
			"body": "Here is a translation via Google Translate:\n\nKriptobuduschee: Bitcoin among us Cocktail\nIn the center of Moscow has opened the item exchange Bitcoin - the first and most famous cryptocurrency. The correspondent of \"Snob\" tells what Bitcoin, what it can be spent and evidenced by his appearance\nBitcoin exchange points, which I could not find a half-hour, even using the card is no different from the usual currency exchange: tiny room where a couple of people can fit, an iron box with double safety glass, followed by the operator. We greeted each other through the glass, he asked me to close the door, and only then put forward a cash tray for us to hear each other better.\n- I'd like to buy you Bitcoins.\n- We do not sell, only buy.\nThen I learned that even if sold, afford them I could not - one Bitcoin is worth tens of thousands of rubles.\nBitcoin - the currency and at the same time, digital goods, they can pay off, and it is possible they invest: at the time of this writing, the price of one Bitcoin was 36,518 rubles, and the year before 18 August 2015, he was worth in more than two times less - only 16 799 rubles. Price change is happening very quickly: two weeks ago for Bitcoin could help out 43,612 rubles. Cryptocurrency not linked to gold, as the national currency. Its value is determined by the demand on the stock exchange: the higher the demand, the more money you need to pay for the purchase. The peculiarity of money that each monetary unit is unique and has its own code, which can not be faked. Cryptocurrency different from the electronic money that are in our bank cards, so that it does not need to make to the account through an ATM and to turn this into a real digital, it immediately - digital.\nIf you want to have a Bitcoin, not necessarily to buy them, you can engage in mining, \"prey.\" With the help of special programs necessary to solve the problem, which is based on the algorithm, written by an anonymous hacker, then you get a coin - Bitcoin.\nThe more time passes since the inception of this system, the more difficult the task becomes, so that at the moment \"Mine\" alone does not make sense, because one processor does not have enough computing power - \"miners\" are going in groups. Single server the system does not, it is built on the principle of equal participating sites that organize group miners based on the source code that is created and posted in 2009 in the open access in the Internet hacker, who worked under the pseudonym Satoshi Nakamoto. It is not known, it is one person or a group, but it is believed that under the nickname Satoshi hiding American businessman Steven Wright.\nAbout that, what can be useful to point Bitcoin exchange operator said the following: \"In many online banks have a limit on the daily translation, eg, 500 000 rubles. For $ 100 more you do not translate, so you have to use another person's card, or wait until tomorrow - all of this is due to the inconvenience. In addition, a map on which large sums of money transferred to several days can cause suspicion among the security services of the bank: if the person is engaged in criminal activity, whether money laundering. You can get a bank transfer, but it will take a few days. But if a person has a Bitcoin wallet, he can receive a transfer Bitcoins for any amount, and then exchange them with us. It all seems obscure, because our society is almost primitive state, and in the West for several years cryptocurrency used in everyday life. To Bitcoin transactions are legitimate to be heard - we must show that we do have. The government will see our activities, analyze, and will continue to limit or vice versa to encourage. \"\nLottery, Xbox and cartoons - which meets Bitcoin\nIn Europe, the USA, Israel and Canada from 2013 set Bitcoin-ATM, through them, you can top up your Bitcoin wallet, and then spend cryptocurrency, for example, to pay for a subscription or Xbox apps from the Windows Store. Or buy her clothes, something in the music store or just a cup of coffee. But while it is the unique cases that the media write. Mass use in everyday life have no Bitcoin.\nEarn on cryptocurrency can not only investing in it. On the Internet a lot of work online exchangers, buying and selling Bitcoin and receiving a percentage of the transactions. You can create a wallet for cryptocurrency and receive a percentage of Bitcoin users of translations. But there are also unusual enterprise: Oleg Osorgin engineer until 2015 worked in Gazprom, together with partners opens Kibo lottery, in which instead of the usual currency Bitcoin can win. When asked what to do with Bitcoin, the entrepreneur said that the Russian Bitcoin is irrelevant that - unlike the West, where they can pay for goods and services, we can only exchange. But it is profitable, given how much you can sell your Bitcoins.\nBitcoins are often in the news. In recent months, there have been many events associated with cryptocurrency: \"The Party of growth,\" said he was going to accept donations in Bitcoins; Bitfilm company made a cartoon about them; \"MMM\" Mavrodi cryptocurrency sells, and this interested in Chinese; terrorists were going to infect Ebola Czech Republic, if the government does not pay them to Bitcoins 5000; in the AppStore detected and removed Bitcoin wallets, through which fraudsters to steal money from users; Business Ombudsman Boris Titov asked workers Saratov elektropribornogo plant if they can make Bitcoin, on what he was told that they had heard about their illegality, but \"if the birthplace of orders - we'll do.\"\nBitcoin and safety\nCryptocurrency very popular with cybercriminals. In the shadow Internet (TOR), which has become in recent years quite famous by Edward Snowden, who passed secret information just through him settled between arms dealers, drug dealers, killers and their clients mostly occur via Bitcoin. For example, over the past two years, traffickers have turned to 20 times more likely to use Bitcoins. This may be due to the increasing popularity of the Internet and the increase of the shadow cost of Bitcoin. In addition, the TOR can be found that represent a threat to national security: as written in the media, on one of the hidden sites collect Bitcoins for killers that could eliminate the politicians and public figures - it turns out that something like kraundfandingovoy platform for the murders of payment .\nThe government has not yet decided whether to allow the use cryptocurrency in Russia: September 16, 2015 the Ministry of Finance began to suspect that Bitcoin is a danger, 17 September the head of Sberbank German Gref stood up for them, and even admitted that he has a certain number of them, September 18 Central Bank set up a working group to study the Bitcoins. A week later, the Ministry of Finance proposed to punish trafficking cryptocurrency correctional labor for up to two years, and in March 2016 it advocated stricter liability - up to 7 years in prison. The reason for such measures in the Ministry of Finance considered the risk of money laundering and tax evasion. However, on 12 August it became known that the Prosecutor General's Office and Ministry of Justice has so far refrained from imposing criminal liability for Bitcoins.\nNikita Maslennikov, an expert on the economy of the Institute of Contemporary Development, told \"snob\" about the threats that may in itself carry cryptocurrency: \"For owners of Bitcoin there are risks in the fluctuation rate cryptocurrency, and law enforcement are concerned that gangs can create a private network for the exchange of Bitcoin and instantly transfer money to each other, which will be impossible to trace. In many countries, this option is being studied - the Americans have learned to prevent such initiatives effectively. While that information about all transactions available to the public. \"\nSimilar opinion Oleg Osorgin. He said that the technology, which is built cryptocurrency makes transparent conducting business, because all transactions with its use can be seen. The safe use of such currency entrepreneur has no doubts: \"cheat with Bitcoins is impossible because kriptoshifrovaniya algorithm is very complex and can not be compromised at the moment.\"\nFuture cryptocurrency\nNikita Maslennikov also told how Bitcoin can take place in the future: \"Imagine that there is a powerful technological wave and cryptocurrency - a spray, a derivative of the technological solutions, to be followed by the new technological revolution. Savings in the research departments are actively exploring the possibility of using cryptocurrency, the Central Bank also have a group that studies the financing of a new generation of technology. Digital currencies are evolving, and financial analysts to compare them with the invention of the Internet. If Bitcoins will enter into mass life, the whole system will change: transformed the relationship between the parties, there will be new services, the rate of change of the existing and new structures will be supervising the Government. This transformation of the financial system were a few of the world's history: first was barter, then as money began to use metal bars, later ones were minted coins on any bills, and now there are digital money. If the coin - it feudalism, the bank notes - is capitalism and the current situation - a certificate of transition of the world in a completely new quality. Already banknotes lose their popularity, we gradually pass to the plastic drives. No specialist does not tell with certainty what's going on, but what you need to look closely to what is happening, rather than hinder the development - it certainly. I think that the global financial system in the next 10-15 years will change radically. \"",
			"post_uri": "18WFCAqYM3Kdhm5qskvR1rS3REQVZGjiHe_2",
			"date_added": 1471974274
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1EizNCr1TBaytrcEFBPrk8yk6eUFgNCC5r",
			"user_name": "Execin",
			"date_added": 1471551927
		},
		{
			"follow_id": 2,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1EizNCr1TBaytrcEFBPrk8yk6eUFgNCC5r",
			"user_name": "Execin",
			"date_added": 1471552032
		},
		{
			"follow_id": 3,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "16ayEL9rXHKdbhoFu1LUanUaPVrzRVe331",
			"user_name": "Andrewm",
			"date_added": 1471552068
		},
		{
			"follow_id": 4,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1GoqcX6nr3x1DHM9L1Hmd9fona9ds5XuGo",
			"user_name": "Clarjon1",
			"date_added": 1471974050
		}
	]
}