{
	"next_post_id": 11,
	"next_comment_id": 18,
	"next_follow_id": 10,
	"avatar": "png",
	"comment_order": 1,
	"user_name": "Planteater",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"intro": "Decentralization enthusiast, like many of you",
	"post": [
		{
			"post_id": 1,
			"date_added": 1474253449,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1474815271,
			"body": "It is a lovely day to be alive.  Notes of autumn can be heard on the cool breeze.  There is a hard clarity to the air which allows the sunlight to strike things like hail.  We thrill to fight against entropy. #thoughts #feels",
			"date_added": 1474815269
		},
		{
			"post_id": 1474816651,
			"body": "Does anyone here grow vegetables?  How much of your vegetable needs have you been able to meet with what you grow? #gardening #food",
			"date_added": 1474816648
		},
		{
			"post_id": 1474844068,
			"body": "Working on bikes is fun for the first 10 minutes, then sucks. #bikes #noitscooltocomplain",
			"date_added": 1474844064
		},
		{
			"post_id": 1475265540,
			"body": "Whoa.  The [Chicago Tribune just endorsed](http://www.chicagotribune.com/news/opinion/editorials/ct-gary-johnson-president-endorsement-edit-1002-20160930-story.html) *Gary Johnson*, the somewhat feckless Libertarian Party candidate.",
			"date_added": 1475265535
		},
		{
			"post_id": 1475337224,
			"body": "I just bought a bonsai spruce from the garden store.  It is my first bonsai tree.  Anybody have any tips to share?",
			"date_added": 1475337218
		},
		{
			"post_id": 1475615962,
			"body": "[Possible Clinton Foundation hack](https://guccifer2.wordpress.com/2016/10/04/clinton-foundation/).  Some food for thought (if it's legit).",
			"date_added": 1475615955
		},
		{
			"post_id": 1475703538,
			"body": "Is there really a massive disaster drill going on somewhere in Russia right now?",
			"date_added": 1475703530
		},
		{
			"post_id": 1476283014,
			"body": "It looks like some version of I2P integration might be in alpha right now.  [ZeroNet pull request](https://github.com/HelloZeroNet/ZeroNet/pull/602) & [i2p.socket patch](https://github.com/majestrate/i2p.socket/issues/4)  I'm going to see if I can get it running.  If some other people manage to run the patched software we can test if it is possible to find and connect to I2P peers!",
			"date_added": 1476283005
		},
		{
			"post_id": 1476902646,
			"body": "This is kind of spam, but I thought people might be interested.  I posted some propositions on BetMoose.  [Here is my referral link](https://www.betmoose.com/hostedBets/hokamuxtik?ref=Hokamuxtik) if you want to check them (and the rest of the site) out.",
			"date_added": 1476902636
		}
	],
	"post_like": {
		"15Hi7MDddHwzTZmmcsj8MWLpZaDz6mLPXg_1474638112": 1474638852,
		"1EizNCr1TBaytrcEFBPrk8yk6eUFgNCC5r_1474734570": 1474814118,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1474786070": 1474817571,
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1475596777": 1475616496,
		"1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1476366105": 1476377395,
		"1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1478184567": 1478234572
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Icf20: What do you mean when you say that bitcoin makes restitution impossible?  There is no axiom that restitution must be implemented on the blockchain. ",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1474186161",
			"date_added": 1474254380
		},
		{
			"comment_id": 2,
			"body": "@Icf20: (and @ulrichard:)  Any reasonable legal system should solve the problem of restitution.  For some reason, you are insisting on restitution *in kind* with Bitcoin.  If a thief steals your watch and destroys it, restitution in kind is certainly not possible.  Are we to say that stealing and destroying is a different crime somehow than stealing and using?  In both cases, the criminal is obligated to make it up to you according to some agreement that you, the criminal, and the courts eventually reach.  If the criminal pays for the watch in gold, is restitution not accomplished?  \n\nI like the idea of property claims on a blockchain.  However, it seems there is a chicken-and-egg problem.  The mechanics of signing over property to someone else are trivial once the property is on the blockchain.  What then is to be mechanism by which property is legitimately added to the blockchain?",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1474186161",
			"date_added": 1474293169
		},
		{
			"comment_id": 3,
			"body": "@Icf20: \n> there is more, things are not so simple... \nI don't understand this post.  Could you reformulate?  Regarding your other post: it doesn't make sense to say that a bitcoin thief can ignore any compensations imposed by a judge and pretend that the same is not true of a watch thief or someone who stole seven $20s from you.  Anyway, I think that we can all agree that anyone who is deciding to use bitcoin should certainly weigh the risk of theft, user error, volatility, etc. against the gains.  ",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1474186161",
			"date_added": 1474323925
		},
		{
			"comment_id": 4,
			"body": "@Icf20: You did not address my point.  We can think of Bitcoins as public records of hidden property.  After all at the core bitcoins are private keys.  So what is the difference between stolen bitcoins and other hidden stolen goods?",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1474186161",
			"date_added": 1474469678
		},
		{
			"comment_id": 5,
			"body": "@Icf20: Let's think about the MN farmer, call him F, in a world where third parties cannot force people to do things.  Suppose that a long dead ancestor A of F took the land from someone else B.  In the present day, suppose that a descendant C of B finds irrefutable proof that A stole the land from B.  Now, C sues F for the land.  It is not cut and dry what the outcome would be.  Sure A stole the land, but F had nothing to do with it.  So we'll leave it to the court to decide.  After the legal proceedings, there could be several outcomes.  First, the courts may decide that too much time has passed and that C has no claim on the land.  In this case, nothing changes.  Second, the courts may decide that both C and F have some claim to the land.  In this case, F may be asked to make restitution by giving C a portion of the produce of the land.  Third, it may be found that F has no claim to the land and is trespassing on C's land. In the second case, C and F might enter into a contract spelling out the terms of restitution.  F may not agree to the ruling and ignore it, but this carries costs of its own.  If the court is reputable, then F has just declared that he does not respect the common law of the land.  Others would be unlikely to enter into contract with F, etc.   In the third case, C might pay a firm to go onto his property and remove F.  (C might pay with money or with a promise of a share of future farm produce.)  ...But wait, what about the blockchain?  Well here we come back to the problem of putting property on the blockchain in the first case.  It only makes sense to put *valid* claims to property on the blockchain.  After all, a blockchain is just a data structure that is useful for keeping a record of what people say the claims are.  If the claims are to previous records on the blockchain and all miners are checking all transactions for validity, then there is no problem.  If the claims are to real world things, then there are serious complications, no different from any other accounting system.  If F has his claim on the blockchain and doesn't sign it over to C, the property no less belongs to C in the third case.  It's just that the database is now wrong.  From an engineering point of view, a blockchain for property claims could easily have a dispute resolution feature built in.  So if I own property and you make a claim, we could pay the property into an escrow account with the legal body as the third party.  Then upon resolution the property is divided up according to the ruling.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1474186161",
			"date_added": 1474471384
		},
		{
			"comment_id": 6,
			"body": "Hashtags: #property #restitution #commonlaw #bitcoin #blockchain",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1474186161",
			"date_added": 1474471614
		},
		{
			"comment_id": 7,
			"body": "@ulrichard: For it is written on the ancient blockchain, which hath existed for all of time...",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1474186161",
			"date_added": 1474481408
		},
		{
			"comment_id": 8,
			"body": "@Elspru: What are you talking about?  You would be more convincing if you gave an argument that went beyond poetic imagery.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1474786070",
			"date_added": 1474813902
		},
		{
			"comment_id": 9,
			"body": "@Icf20:  @ulrichard: Nice talking to you guys.  I love when disagreements stay polite :D",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1474186161",
			"date_added": 1474816777
		},
		{
			"comment_id": 10,
			"body": "@Elspru: Cool!  Could you get that 10% up (if you wanted) by preserving some of your produce for the winter?",
			"post_uri": "1JuUHRJ3A1wy5zgT6c2KviH9cHtq8Zr4X9_1474816651",
			"date_added": 1474897386
		},
		{
			"comment_id": 11,
			"body": "@Elspru: I want to understand what you have to say about this, but I have no idea what you mean.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1474786070",
			"date_added": 1474911574
		},
		{
			"comment_id": 12,
			"body": "@Elspru: In what kind of climate do you live?  Do you use a greenhouse?  I had no idea that zinc and boron are common deficiencies.  I don't own any land and don't do any gardening myself, but I would like to at some point! ",
			"post_uri": "1JuUHRJ3A1wy5zgT6c2KviH9cHtq8Zr4X9_1474816651",
			"date_added": 1474911731
		},
		{
			"comment_id": 13,
			"body": "@Elspru: That's very interesting.  Thanks for satisfying my curiosity.",
			"post_uri": "1JuUHRJ3A1wy5zgT6c2KviH9cHtq8Zr4X9_1474816651",
			"date_added": 1475014104
		},
		{
			"comment_id": 14,
			"body": "@Meidan: I hope it's not glued to the base.  I trust the store where I bought it.  How would I check without hurting the tree?  Thanks for the tips!",
			"post_uri": "1JuUHRJ3A1wy5zgT6c2KviH9cHtq8Zr4X9_1475337224",
			"date_added": 1475423888
		},
		{
			"comment_id": 15,
			"body": "Running str4d's fork of ZeroNet right now with the latest i2p.socket.  I had to put the for loop starting on line 34 in `plugins/AnnounceZeroPlugin.py` inside a conditional \n`if peers.get(\"i2p\",False):`\nto get it to run.  I'm running i2p services for a handful of sites but I don't have any i2p peers.",
			"post_uri": "1JuUHRJ3A1wy5zgT6c2KviH9cHtq8Zr4X9_1476283014",
			"date_added": 1476286835
		},
		{
			"comment_id": 16,
			"body": "Would you elaborate?",
			"post_uri": "17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3_1476401739",
			"date_added": 1476404098
		},
		{
			"comment_id": 17,
			"body": "@Brkaka: Ok, thanks for the links.",
			"post_uri": "17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3_1476401739",
			"date_added": 1476408345
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ",
			"user_name": "ulrichard",
			"date_added": 1474324255
		},
		{
			"follow_id": 2,
			"hub": "185yXNL48LTZyKfNo6WgyKshtMgcV3mecL",
			"auth_address": "1JARuoKjvXanUeKyPTXU9cus2jRzi4DZU5",
			"user_name": "Icf20",
			"date_added": 1474324259
		},
		{
			"follow_id": 3,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1EErpRfR94YZwEMpAwsGKYsgSqHuRxvWib",
			"user_name": "megfault",
			"date_added": 1474817474
		},
		{
			"follow_id": 5,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1474912225
		},
		{
			"follow_id": 6,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6",
			"user_name": "Border0464fred",
			"date_added": 1475266288
		},
		{
			"follow_id": 7,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC",
			"user_name": "meidan",
			"date_added": 1475599199
		},
		{
			"follow_id": 8,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY",
			"user_name": "KosherX - PT-🇧🇷, EN-🇺🇸 and very little of JP-🇯🇵.",
			"date_added": 1475701094
		},
		{
			"follow_id": 9,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC",
			"user_name": "Firebox",
			"date_added": 1476280458
		}
	],
	"settings": {
		"reverse_comment_order": true,
		"mute_ugly": false,
		"mute_spam": true,
		"mute_blocked": true
	},
	"flags": {},
	"blocked": [
		"1MRSDFESsBXDGvNoZ5ifztA89XfEahA5ka",
		"16APV8RqRHmu7Az39JLALAap8PKoJ4rAov",
		"1D4B7XbRYY5p9kx79NtKr3qiShR5Tcpnvo",
		"17gEFavobc7RsKNGbSzZwoSZ6jNB7hT2KN",
		"14fdwxPt83nTw5vFaXTCR7KQkAxkXuGbAR",
		"18oQPES15W27Ks1GBZRKx9zf9wFmXLraEW"
	],
	"comment_like": {
		"1A3XsuLB6P7LQPCw1QWASG7RGSwrCv6Xib_7": 1474942289,
		"14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_20": 1475776248
	}
}