{
	"next_comment_id": 6,
	"user_name": "Flyman",
	"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
	"post_like": {
		"19M1DT5vruSATEcbEczYRwCk2uPuLcATBa_1473992249": 1474014392,
		"15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1476125491": 1476170090,
		"1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_1478863604": 1478938511
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "My favorite definition of moral. Moral is just what many people agreed to think as \"good\", and amoral is simply what many people agreed to think as \"bad\". So moral is unreliable, unstable, relative. I think it is better to get smarter and smarter, learn things, and think and decide for yourself what is \"good\" or \"bad\" for you and other people around.",
			"post_uri": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa_1473992249",
			"date_added": 1474014372
		},
		{
			"comment_id": 2,
			"body": "In russian language there are two different \"moral\" words most people consider as synonims. I spend about 15 minutes g??gling and didn't find good enough english words. So I will try to explain it other way. Consider there are two different types of moral: inner and outer. Yes, people tend to confuse them, but there are huge differences between inner moral and outer moral. I, for example, often against outer moral (outer moral is usual moral I told in previous comment), but I like inner moral. Let me try to define inner moral. Inner moral is when person defines global/universal rules for himself/herself and tries to stick to those rules even if it contradicts usual (outer moral). Oh, I found great article in russian about differences between those two types of moral (in russian language it is even better - they have two different words for those entities) and I think it is good idea for me to translate it into english and post it... And I did it already. So go check my translation.",
			"post_uri": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa_1473992249",
			"date_added": 1474103522
		},
		{
			"comment_id": 3,
			"body": "I more like game \"Cyberia\". 1st part I completed on PSX emulator where you can save/load at any moment. It looks like there is no 2nd part for any emulator, so I didn't play 2nd part. Now I know there are two different Cyrebrias: Cyberia with \"C\" and Syberia with \"S\". I once tried \"Syberia 2\" with my friend who sad it is wrong Cyberia. Cyberia has episode where there is a big cooler you have to go through - hero calls it \"Slice-o-matic\" :-] Syberia 2 has phone on which you can dial any number you wish.",
			"post_uri": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_1475851000",
			"date_added": 1475852546
		},
		{
			"comment_id": 4,
			"body": "@KosherX - PT-🇧🇷, EN-🇺🇸 and very little of JP-🇯🇵.: Of course they are different:\n1. Syberia: https://www.youtube.com/watch?v=N2jOdWNUDzQ\n2. Cyberia: https://www.youtube.com/watch?v=WdAsCvVSpEs",
			"post_uri": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_1475851000",
			"date_added": 1476038909
		},
		{
			"comment_id": 5,
			"body": "You reminded me this guy at 1:15-1:27 in https://www.youtube.com/watch?v=Ih9ZM7PoBCc",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1477146259",
			"date_added": 1477146312
		}
	],
	"comment_like": {
		"19M1DT5vruSATEcbEczYRwCk2uPuLcATBa_159": 1475004080,
		"1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9_172": 1477145489
	},
	"flags": {}
}