{
	"next_post_id": 41,
	"next_comment_id": 37,
	"next_follow_id": 68,
	"avatar": "jpg",
	"user_name": "Dergatt",
	"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1471529435,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 2,
			"date_added": 1471639226
		},
		{
			"post_id": 3,
			"body": "Back studying after some weeks of holidays. Feels good and exhausting at the same time.",
			"date_added": 1471865704
		},
		{
			"post_id": 4,
			"body": "Can I recover a Blog I owned before?\nI backed up my keys but not my data Folder. If I claim ownership and want to publish new content it asks for my private key, in a popup. should I enter the path to key?",
			"date_added": 1471891342
		},
		{
			"post_id": 5,
			"body": "Would be nice to have a back button maybe disused as a close button if clicking on a post on Activity feed.",
			"date_added": 1471895104
		},
		{
			"post_id": 1472306102,
			"body": "Way to warm outside, perfect solution. eating Ice cream",
			"date_added": 1472306096
		},
		{
			"post_id": 1473367447,
			"body": "After hours of troubleshooting why snappy makes two snapshots of my root partition and none of my home partition.\nI found mounting both snaphots subvolumes to the same backup folder isn't the best idea.\nNext time I'm messing arround with my fstab I will do it not tired. :)",
			"date_added": 1473367440
		},
		{
			"post_id": 1473696447,
			"body": "come on Debian fix the nfs-server startup issue on rasbian. It's just so annoying.",
			"date_added": 1473696439
		},
		{
			"post_id": 1473700622,
			"body": "We had a Blackout earlier today and now the Internet isn't working properly any more, only all the tech Sites are online non of regular internet.\nLooks like only ipv6 is working, time to do some testing.\nYea no ipv4 connectivity but ipv6 according to http://ipv6-test.com\nIt's amazing how many ipv6 checking sites don't support ipv6 lookup.",
			"date_added": 1473700613
		},
		{
			"post_id": 1473931392,
			"body": "Still no proper free WLAN in Germany, at least no compensation must be paid.\nhttp://curia.europa.eu/jcms/upload/docs/application/pdf/2016-09/cp160099en.pdf",
			"date_added": 1473931382
		},
		{
			"post_id": 1474052316,
			"body": "The problem with all new (or old in case of xmpp) messaging apps is to get people using it.",
			"date_added": 1474052305
		},
		{
			"post_id": 1474280641,
			"body": "looking for a good way to encrypt my second HDD in my Laptop, ENCFS was crashing on me lately.\neCryptfs seems promising, using it on my home folder and I never had problems so far.",
			"date_added": 1474280629
		},
		{
			"post_id": 1474355310,
			"body": "HDD is set up with LUKS, for aoutomount I'm using pam-mounting. Logging in takes a bit longer than with using encfs but no mount issues so far.",
			"date_added": 1474355297
		},
		{
			"post_id": 1474492190,
			"body": "Yea Gnome 3.22 is released waiting till it shows up in #Arch",
			"date_added": 1474492176
		},
		{
			"post_id": 1474812156,
			"body": "What a lazy Sunday afternoon, just relaxing.",
			"date_added": 1474812141
		},
		{
			"post_id": 1475304242,
			"body": "Image Test\n![Picture](https://ipfs.io/ipfs/QmSiHtB6hgwAfsAxaj6nZpZwcuL1g4qABkcHuEmmyvhXQF)\nJust starting to play with IPFS seems interesting.",
			"date_added": 1475304226
		},
		{
			"post_id": 1475400513,
			"body": "It's always so annoying if magnetic links on distro Websites aren't working. I would love to share some bandwidth if you let me.",
			"date_added": 1475400496
		},
		{
			"post_id": 1475525607,
			"body": "I live drags you down there is a key to smiling :)\n![Smile](https://ipfs.io/ipfs/QmfCLzZ2bmtQMUJgTS3k3daif59ahYA3Sjdm1i1RY3Ptjj)",
			"date_added": 1475525589
		},
		{
			"post_id": 1476015258,
			"body": "Visiting old friends always such fun.",
			"date_added": 1476015239
		},
		{
			"post_id": 1476176555,
			"body": "My Pi Syncthing Backup solution is nearly finished. Just need to bring and set it up at my brothers house and I'm all done.",
			"date_added": 1476176535
		},
		{
			"post_id": 1476192380,
			"body": "it there a good overview of all text formatting options on zerome?\nNever used markdown.",
			"date_added": 1476192359
		},
		{
			"post_id": 1476289220,
			"body": "Nice Gnome 3.22 on arch has Wayland enabled by default. Let's see how ready it is.",
			"date_added": 1476289198
		},
		{
			"post_id": 1476306517,
			"body": "Problems I encountered on Wayland on Gnome so far:\n1. Turning of my laptop Monitor and just using my external one doesn't work. Laptop Monitor is still turned on even if gnome settings claim it's turned off.\n1. Thunderbird header bar is transparent until I unmaximize and maximize again.\n1. Redshift isn't working any more.\n1. Global hotkey for tilda isn't working any more.\n\nThe two last once are reasonable as they rely heavily on X.\nFirst once quite annoying.\nOverall it's surprisingly working well.",
			"date_added": 1476306494
		},
		{
			"post_id": 1476358009,
			"body": "Changing Bitcoin is treated as changing any other currency, at least in Europe.\nhttp://curia.europa.eu/jcms/upload/docs/application/pdf/2015-10/cp150128en.pdf",
			"date_added": 1476357985
		},
		{
			"post_id": 1476437797,
			"body": "Wayland + Libreoffice + Arch = Interface Problems.\nCan't select text style in header bar and alt + enter in bullet points doesn't work.\nSearching for Libreoffice and Wayland first thing that popped up was the official Libreoffice Flatpak side. The Flatpak runs without a problem. Guess I'm looking more into Flatpak if I have some time.",
			"date_added": 1476437772
		},
		{
			"post_id": 1476814314,
			"body": "I'm so annoyed by events only hosted on Facebook. You can't even look at them properly without an account.",
			"date_added": 1476814288
		},
		{
			"post_id": 1476959631,
			"body": "What a world we live in. I want to buy an ebook Terry Pratchets The Shepherds Crown but my next ebook reader probably won't be a kindle so I don't want to buy it on amazon because of DRM.\nBut after 20 minutes of searching I can't find a DRM free version which can be used on every device no matter which reader I choose to buy next.\nSo is my only option to pirate or not read a book I would enjoy?",
			"date_added": 1476959604
		},
		{
			"post_id": 1477405408,
			"body": "Who here is using #ipfs and can answer some of my questions?\n1. How can I see which files I actually share?\n1. How can I unshare a file?\n2. How can I see the path were these files are located on my machine?\n3. If I ipfs get a file Do I automatically share it if I have the daemon running?",
			"date_added": 1477405380
		},
		{
			"post_id": 1477475052,
			"body": "My IPFS daemon is now running properly and links to a repository on my second HDD.\nUsing systemd and running ipfs as a user you have to edit `/etc/systemd/user.conf`\nuncomment and change following line\n`DefaultEnvironment=\"IPFS_PATH=path to your repository\"`.\nNext stop getting it working with the ipfs command.\n\nIt looks like this also stets the environment, since this change the normal ipfs command reveres to the right path. Even if the daemon isn't running.",
			"date_added": 1477475023
		},
		{
			"post_id": 1478327626,
			"body": "Nice Rasbian fixed the rpcbind issue. It no longer needs to be enabled by hand after a reboot.",
			"date_added": 1478327595
		},
		{
			"post_id": 1478377258,
			"body": "This looks nice, maybe there is hope for real open devices at some point https://plasma-mobile.org/",
			"date_added": 1478377226
		},
		{
			"post_id": 1478598137,
			"body": "Everyone should use Linux Laptops if working in a Library. Apples and Windows boot sound is just annoying.",
			"date_added": 1478598104
		},
		{
			"post_id": 1478683982,
			"body": "What a sad year for democracy, populists winning all over the world (Philippines, Brexit, USA) and all I see from politicians is to join the game for more votes.\nStop being such assholes and start making proper politics.\nInvolve people more so they see they have something to say!\nStart being transparent about what you do and why you do it!\nSo people don't need to vote in protest to hope something changes.\n\np.s.\nThe happiness of most people doesn't grow because the economy grows, but because they get a better standard of living and those things are not necessarily  connected.",
			"date_added": 1478683948
		},
		{
			"post_id": 1478684422,
			"body": "mmmm pictures",
			"date_added": 1478684387,
			"meta": "{\"img\":\"900,600,222000333666777555444111999888,0123444435676488894450649948946276222254665335344333444494433344999443\"}"
		},
		{
			"post_id": 1479285346,
			"body": "Cm 14 just landed on the One Plus One.\nSo no more updating for a week or two until mayor bugs are fixed. Until then being tempted to push the update button.",
			"date_added": 1479285310
		},
		{
			"post_id": 1479495043,
			"body": "I put cm14 on my tablet and quick reply from notification is pretty sweet. Now I want it even more on my phone.",
			"date_added": 1479495006
		},
		{
			"post_id": 1479568693,
			"body": "I got an email today in Arabic that someone created an apple id with my email address apple Id. After some calling around apple told me they can't delete my email address or close the account because I'm not the person who opened the account.",
			"date_added": 1479568655
		},
		{
			"post_id": 1482237535,
			"body": "Egypt is censoring access to Signal.\nhttps://twitter.com/whispersystems/status/810945070182469632\n\nThat's why federated or even better peer to peer services are way better.\nEven thou Signal is still the best messaging app out there at the moment. Hope for some good xmpp clients in the future.",
			"date_added": 1482237496
		},
		{
			"post_id": 1482634543,
			"body": "[Sad to see CM go.](https://www.cyanogenmod.org/blog/a-fork-in-the-road). They are the reason I believe In an open android.\n[Welcome Lineage OS](https://github.com/lineageos) I hope you will strive and make Android more open.",
			"date_added": 1482634503
		}
	],
	"post_like": {
		"14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1476856825": 1476859867,
		"14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1478600286": 1478684151
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Talnicrom: Thanks.\nHow can I extract the string from key-rsa.pem?",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_4",
			"date_added": 1471894676
		},
		{
			"comment_id": 2,
			"body": "@Shellbound: luckily it does :)\nBut I was looking for a close button and it feels like an overlay and not a new site.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_5",
			"date_added": 1471896635
		},
		{
			"comment_id": 3,
			"body": "@Nofish: OK thanks.\nI copied the cert and key, so I was able to set up zeroID. I guess this means starting over again and make proper backups in the future.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_4",
			"date_added": 1471897649
		},
		{
			"comment_id": 4,
			"body": "@Chako: I know, but in my case I was on a site of an other user and wanted to see what they commented on a post.\nSo going back is the only option to got back to the profile page.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_5",
			"date_added": 1471941770
		},
		{
			"comment_id": 5,
			"body": "what about WebRtC solutions like palava.tv",
			"post_uri": "16it6qRi6MnCQ9JcqE1WBqNDU14qyXkExX_1471991726",
			"date_added": 1472023724
		},
		{
			"comment_id": 6,
			"body": "Worst part is if websites only alow a certain length and don't tell you about it.\nGenerate a 40 character length password paste it and if you want to log in your password is wrong.",
			"post_uri": "1JwPBvZYXLJzrA6YisjpsyTuuieFLCARS6_1472116229",
			"date_added": 1472120043
		},
		{
			"comment_id": 7,
			"body": "Firefox and Chromium if I need to use flash.",
			"post_uri": "16it6qRi6MnCQ9JcqE1WBqNDU14qyXkExX_1473389086",
			"date_added": 1473444547
		},
		{
			"comment_id": 8,
			"body": "and back online, what about ipv6 support for zeronet :)",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1473700622",
			"date_added": 1473702152
		},
		{
			"comment_id": 9,
			"body": "@Ulrichard: Yea maybe that's more what I'm looking for. Hole disk seems more useful.\nLet's see if user mounting will work like I want to",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1474280641",
			"date_added": 1474284701
		},
		{
			"comment_id": 10,
			"body": "I feel it always takes a day or two till the updates are in Arch. On the other hand never had less problems with updating my packages.",
			"post_uri": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1474385882",
			"date_added": 1474407648
		},
		{
			"comment_id": 11,
			"body": "@weakish: I already see the difference, write performance is up and CPU usage is down.\nEncfs is great for Dropbox like use but not for entire HDD, haven't thought about it since I never had a second HDD before.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1474355310",
			"date_added": 1474464526
		},
		{
			"comment_id": 12,
			"body": "Did you guys delete some of your comments?\nsome seem to be missing",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1474812156",
			"date_added": 1474813816
		},
		{
			"comment_id": 13,
			"body": "Same here, with the same problem on arch. Just wrote my own systemd service and it starts without problems.",
			"post_uri": "1njejdirgM2P3ibyYys7siVKmAGeLcj7f_1474875815",
			"date_added": 1474890278
		},
		{
			"comment_id": 14,
			"body": "@Flyman: Thank you that's what I did but if I cant find any peers there is no downloading, big problem op p2p :D",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1475400513",
			"date_added": 1475525447
		},
		{
			"comment_id": 15,
			"body": "I only used localbitcoins (for buying) so far",
			"post_uri": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1475770304",
			"date_added": 1475782185
		},
		{
			"comment_id": 16,
			"body": "@Nofish: Thanks a lot",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1476192380",
			"date_added": 1476194874
		},
		{
			"comment_id": 17,
			"body": "@Shellbound: The Flatpak ist around 150mb, according the installed folder is arround 800mb to [Arch package](https://www.archlinux.org/packages/extra/x86_64/libreoffice-fresh/) ist 90 mb and 350 when installed.\nSo it's a lot bigger.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1476437797",
			"date_added": 1476563048
		},
		{
			"comment_id": 18,
			"body": "@Shellbound: I would love to have an option. I prefer native packages but sometimes there is a strange bug if a dependency. Specially with games this is a huge problem in my experience.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1476437797",
			"date_added": 1476700497
		},
		{
			"comment_id": 19,
			"body": "@Shellbound: I can't get namecoin-qt working on Arch and I don't have the time and energy to put hours into it. So If you find a fix let me know :D",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1476437797",
			"date_added": 1476791842
		},
		{
			"comment_id": 20,
			"body": "@Shellbound: It's not building correctly, neither the aur script or from github. More people have the same issue according to comments on [aur package](https://aur.archlinux.org/packages/namecoin-qt). Tried google with error message no luck there either.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1476437797",
			"date_added": 1476883115
		},
		{
			"comment_id": 21,
			"body": "@Shellbound: on all of their websites they point to this source as a gui client and i couldn't find an other source anywhere.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1476437797",
			"date_added": 1476912823
		},
		{
			"comment_id": 22,
			"body": "@Shellbound: Oh true haven't seen that. Still no easy way to just get it.\nThat's all I want all software easy accessible.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1476437797",
			"date_added": 1476948552
		},
		{
			"comment_id": 23,
			"body": "@KosherX: You can copy epup (non drm) to mobi without a problem but non those with drm. In order to do so I violate copyright, same as if I download the book illegal and I have to pay for it. If I pay I want a legal copy.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1476959631",
			"date_added": 1476974367
		},
		{
			"comment_id": 24,
			"body": "@Flyman: Same with movies if you own a legal copy you need to sit thru all this copying is stealing trailers at the beginning. On a illegal copy none of this annoying stuff.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1476959631",
			"date_added": 1476974544
		},
		{
			"comment_id": 25,
			"body": "@Flyman: I agree that most money doesn't go to the person actually creating the content and about your owning/loaning argument.\nBut even if the system is not the best if I like a Band author or whatever and I buy their \"creation\" I support future creation of similar works.\nDo I want that more money goes to the creator, Yes. That's why I always prefer to buy the smaller self published content if I have a choice.\nEven tho the current copyright laws are blown way out of proportion, 70 years after death of the author is way to long, I think copyright in some way is necessary.\nI'm not talking about the Anglo-American Law where copyright means right to copy and only cares about the profit.\nSpecially in France and Germany the concept of copyright is different. The work is part of the intellectual creation of the author and can't be detached from him. This way a wholesale of your creation is not possible. This way his creation can not be used out of context because it doesn't represent it in a correct way.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1476959631",
			"date_added": 1477035195
		},
		{
			"comment_id": 26,
			"body": "@meidan: Thanks, I already did that, there is a delete button, but it's not working. There is already a github issue about that.\nSo I thought maybe it's just the UI.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1477405408",
			"date_added": 1477415478
		},
		{
			"comment_id": 27,
			"body": "@Eibriel: Thanks a lot that helped a lot. I thought it would be linking back to the plain files I added or downloaded.\nDo you know what is the best way to set the config dir to another path? If I use the export function it doesn't stick after a reboot and if I add it to /etc/profile it doesn't recognizances it.\nI thought about putting it on my Pi and use it for sharing files. So I would like to store them on an USB drive.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1477405408",
			"date_added": 1477429005
		},
		{
			"comment_id": 28,
			"body": "@Ulrichard: I looks like that what I will do in the end. But that's the easy way.\nThe hard way you learn how this stuff actually works \nAt the moment I try to set the environment for my systemd file, could be useful in the future.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1477405408",
			"date_added": 1477431304
		},
		{
			"comment_id": 29,
			"body": "@meidan: The `ipfs pin rm` command is the delete command.\nAnd yea this would be some nice features.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1477405408",
			"date_added": 1477465989
		},
		{
			"comment_id": 30,
			"body": "I'm using opennic since over a year now and never had any problems.",
			"post_uri": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1478011914",
			"date_added": 1478021644
		},
		{
			"comment_id": 31,
			"body": "@Twelves: No a world where the well being of every human counts. Not determined by color of skin or by any borders.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1478683982",
			"date_added": 1478726635
		},
		{
			"comment_id": 32,
			"body": "@ks: I'm able to reset the password but after entering it asks me security questions I don't know the answer to.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1479568693",
			"date_added": 1479587241
		},
		{
			"comment_id": 33,
			"body": "@Eibriel: I did that but I don't think my email was hacked. They used used my address.\nAfter half a hour of arguing with apple on the phone I gave up and now I'm looking for legal options now.\nI also tried to open a random apple account If you do this on their website you can't proceed until you confirm the email. I seems like it's different on a phone. But I can't test that.",
			"post_uri": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_1479568693",
			"date_added": 1479642482
		},
		{
			"comment_id": 34,
			"body": "As I'm using Gnome, NetworkManager",
			"post_uri": "1JwPBvZYXLJzrA6YisjpsyTuuieFLCARS6_1479944536",
			"date_added": 1479968574
		},
		{
			"comment_id": 35,
			"body": "I like it",
			"post_uri": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1480177371",
			"date_added": 1480236210
		},
		{
			"comment_id": 36,
			"body": "If it's worse than 2016 the world is doomed.",
			"post_uri": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1483178536",
			"date_added": 1483182987
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx",
			"user_name": "ks",
			"date_added": 1471529511
		},
		{
			"follow_id": 2,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1CTut2qbaj54ZjNoYeuWSGwV75iVieKY6N",
			"user_name": "Quadrangle",
			"date_added": 1471529525
		},
		{
			"follow_id": 3,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "13KnmV3n2ZEpU77hx4WuLVdBrUR3kidtq7",
			"user_name": "Nobite",
			"date_added": 1471529552
		},
		{
			"follow_id": 4,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1DjUq8hd2jYZgc5uNhQEtWUVZjMHkMQkpU",
			"user_name": "Alek",
			"date_added": 1471529565
		},
		{
			"follow_id": 5,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN",
			"user_name": "Flyman",
			"date_added": 1471529575
		},
		{
			"follow_id": 6,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp",
			"user_name": "FraYoshi",
			"date_added": 1471529605
		},
		{
			"follow_id": 7,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "16nArdxrSaNThNp83kL8E6NLL9WD98iUne",
			"user_name": "Jayofthezero",
			"date_added": 1471532002
		},
		{
			"follow_id": 8,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1471544589
		},
		{
			"follow_id": 9,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "17gEFavobc7RsKNGbSzZwoSZ6jNB7hT2KN",
			"user_name": "Fav",
			"date_added": 1471545386
		},
		{
			"follow_id": 10,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR",
			"user_name": "weakish",
			"date_added": 1471545428
		},
		{
			"follow_id": 11,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "15Ja9eyNUrAuoPpyoZ32Vw8Gb7ar1Rqz5o",
			"user_name": "Zeroalchemist",
			"date_added": 1471545445
		},
		{
			"follow_id": 12,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1BBCbDdZtZ5ZJGhF2WcMRcn3FEKQ7PaoMS",
			"user_name": "Drymer",
			"date_added": 1471545472
		},
		{
			"follow_id": 13,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "13U9mRgV3bdkXiNXjMZeBWTcSHZjgNmk2z",
			"user_name": "Dios",
			"date_added": 1471600975
		},
		{
			"follow_id": 14,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "19JDsMSW9XKbhFcrXFyE82YKSvj2MZG5wK",
			"user_name": "Toobee",
			"date_added": 1471613251
		},
		{
			"follow_id": 15,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1JF3eQjW4voiKdcvCkMXvUx5bLmZAiVdyi",
			"user_name": "Edantes",
			"date_added": 1471613335
		},
		{
			"follow_id": 17,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1471682412
		},
		{
			"follow_id": 18,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS",
			"user_name": "ZAlex",
			"date_added": 1471702740
		},
		{
			"follow_id": 19,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1EErpRfR94YZwEMpAwsGKYsgSqHuRxvWib",
			"user_name": "megfault",
			"date_added": 1471783171
		},
		{
			"follow_id": 20,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa",
			"user_name": "Talnicrom",
			"date_added": 1471894692
		},
		{
			"follow_id": 21,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ",
			"user_name": "Musickiller",
			"date_added": 1471894835
		},
		{
			"follow_id": 22,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "16it6qRi6MnCQ9JcqE1WBqNDU14qyXkExX",
			"user_name": "Deadjoker",
			"date_added": 1471895913
		},
		{
			"follow_id": 23,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1K7pivtg6E1qRnih7nmnnPrCnRRSxSCMQQ",
			"user_name": "Lain",
			"date_added": 1471895930
		},
		{
			"follow_id": 24,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L",
			"user_name": "Alex",
			"date_added": 1471896003
		},
		{
			"follow_id": 25,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "15QGRquMETTn5LnCHjTm1qa9eaXGtq7gpT",
			"user_name": "Klaus Jónsson Zimmermann",
			"date_added": 1471900293
		},
		{
			"follow_id": 27,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ",
			"user_name": "ulrichard",
			"date_added": 1471941319
		},
		{
			"follow_id": 28,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "19SbSoytV8aD6GtpJi9F6RDSnGzunYgYzo",
			"user_name": "Johnhamelink",
			"date_added": 1471987380
		},
		{
			"follow_id": 29,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9",
			"user_name": "Shellbound",
			"date_added": 1472038039
		},
		{
			"follow_id": 30,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1JwPBvZYXLJzrA6YisjpsyTuuieFLCARS6",
			"user_name": "Emeraude",
			"date_added": 1472119918
		},
		{
			"follow_id": 31,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t",
			"user_name": "tkarita",
			"date_added": 1472409680
		},
		{
			"follow_id": 32,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u",
			"user_name": "Lola",
			"date_added": 1472653278
		},
		{
			"follow_id": 33,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ",
			"user_name": "Sirenyc",
			"date_added": 1472653289
		},
		{
			"follow_id": 34,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1KkA3C1iVDfieotYpuPUCpUtKzdFcfHMRy",
			"user_name": "cryp7ix",
			"date_added": 1473409309
		},
		{
			"follow_id": 35,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "16ScAEZDt1u39wfVWZETfogqze3pq8ABMg",
			"user_name": "StephenStarkie",
			"date_added": 1473444831
		},
		{
			"follow_id": 36,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "14A8hwxKNWnCYD4kEcG9Vw5sTZnnDqWJ7A",
			"user_name": "Thegreekgeek",
			"date_added": 1473444950
		},
		{
			"follow_id": 37,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu",
			"user_name": "PaintNinja",
			"date_added": 1473448309
		},
		{
			"follow_id": 38,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "16ayEL9rXHKdbhoFu1LUanUaPVrzRVe331",
			"user_name": "Andrewm",
			"date_added": 1473448334
		},
		{
			"follow_id": 39,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "16YP1ZeHrKq3KB3DdBWHec984oQAfVPT9d",
			"user_name": "Wire",
			"date_added": 1473804487
		},
		{
			"follow_id": 40,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "15Hi7MDddHwzTZmmcsj8MWLpZaDz6mLPXg",
			"user_name": "Limelatt",
			"date_added": 1474479936
		},
		{
			"follow_id": 41,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "12aUNK5oaVy24PUFxevXvh63iDvVyncGHx",
			"user_name": "Durand",
			"date_added": 1474538123
		},
		{
			"follow_id": 42,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV",
			"user_name": "Mynameislegion",
			"date_added": 1474813533
		},
		{
			"follow_id": 43,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1CFhytwoGGPNqmueehPqotaf2iG9uxD98e",
			"user_name": "Method-X",
			"date_added": 1474813967
		},
		{
			"follow_id": 44,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1Vy5x8HrbwRc2GM32GfZtpxdgoB5f34fd",
			"user_name": "Sifr",
			"date_added": 1474890120
		},
		{
			"follow_id": 45,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC",
			"user_name": "Firebox",
			"date_added": 1475056293
		},
		{
			"follow_id": 46,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1AjxW1N844WRpscEFSotfsqLXsQurz83xc",
			"user_name": "Arne Bolen",
			"date_added": 1475078063
		},
		{
			"follow_id": 47,
			"hub": "18FheQ1v3bz4iv5yx8hr9hg5W5BJ8WNJ8d",
			"auth_address": "19Es1UM3o3N1ME2RP7ps3nvSGk4AAgwNtK",
			"user_name": "Musickiller7777",
			"date_added": 1475158135
		},
		{
			"follow_id": 48,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1KrJgpJqJij8zdhJ4gFZg7gscskgtCgNmX",
			"user_name": "Rambotito",
			"date_added": 1475345941
		},
		{
			"follow_id": 49,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS",
			"user_name": "Openuser",
			"date_added": 1475363501
		},
		{
			"follow_id": 50,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw",
			"user_name": "Balancer73",
			"date_added": 1475363923
		},
		{
			"follow_id": 51,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1BAAgotwK2Noy6kz9BNeywZve2nvADfjXE",
			"user_name": "Bashrc2",
			"date_added": 1475422856
		},
		{
			"follow_id": 52,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1Cr9GMEngZVtcsNwaoHo2XNw1EuMFu8WxF",
			"user_name": "N3z",
			"date_added": 1475440779
		},
		{
			"follow_id": 53,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw",
			"user_name": "Balancer73",
			"date_added": 1475493040
		},
		{
			"follow_id": 54,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1CtXM9gSE1bdV6yXKZGHzSLbCJheBub33k",
			"user_name": "espectalll",
			"date_added": 1475525172
		},
		{
			"follow_id": 55,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1P7F9po18mshkbRG5zEVV47vHtLEX19QJa",
			"user_name": "Bashrc",
			"date_added": 1475525896
		},
		{
			"follow_id": 56,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1JuUHRJ3A1wy5zgT6c2KviH9cHtq8Zr4X9",
			"user_name": "Planteater",
			"date_added": 1475525930
		},
		{
			"follow_id": 57,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1NqBLri771MGN6eJLzUP6dqenvVqdC6b5L",
			"user_name": "01served",
			"date_added": 1476192028
		},
		{
			"follow_id": 58,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY",
			"user_name": "KosherX",
			"date_added": 1476821571
		},
		{
			"follow_id": 59,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC",
			"user_name": "meidan",
			"date_added": 1477599432
		},
		{
			"follow_id": 60,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1EnFfeVqTYtJfhzucfQB8Z7sCfUBipRRow",
			"user_name": "MilitaryRiotLab",
			"date_added": 1477815877
		},
		{
			"follow_id": 61,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1GCsW9TFfjDsvcdmKPADq1n8Q3ha72UtDQ",
			"user_name": "Mod",
			"date_added": 1478683975
		},
		{
			"follow_id": 62,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1ByuEoBeryNCZXqRArMfDiAL9bFTqmM5yN",
			"user_name": "mls",
			"date_added": 1479494535
		},
		{
			"follow_id": 63,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "18YRQmcqeLKHBVB2F7oAFThL2qEy851rDR",
			"user_name": "Vsitnikov",
			"date_added": 1479494577
		},
		{
			"follow_id": 64,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1AxLMGKjSdsL3Sxa2x1WHJmoap3Z93YdCm",
			"user_name": "Hexagon",
			"date_added": 1480188946
		},
		{
			"follow_id": 65,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NZbgDUpFDLLFfy3BFN6No2RVQYvcwstrn",
			"user_name": "ark",
			"date_added": 1482095932
		},
		{
			"follow_id": 66,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "186iABum7pzWcqQhQ7x5Uvp3z7Ayaaw4iu",
			"user_name": "Paladin",
			"date_added": 1482095939
		},
		{
			"follow_id": 67,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc",
			"user_name": "Rapapobre",
			"date_added": 1482568882
		}
	],
	"settings": {
		"reverse_comment_order": false,
		"mute_ugly": false,
		"mute_spam": false,
		"mute_blocked": false
	},
	"flags": {},
	"blocked": [],
	"comment_like": {
		"1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_39": 1476194865
	}
}