{
	"next_comment_id": 5,
	"user_name": "PaintNinja",
	"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
	"post_like": {
		"1EizNCr1TBaytrcEFBPrk8yk6eUFgNCC5r_5": 1471551323,
		"1EizNCr1TBaytrcEFBPrk8yk6eUFgNCC5r_1473182435": 1473186431,
		"1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1475846794": 1475861005,
		"1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1476366105": 1476373774,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_23": 1479046153,
		"1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1479051315": 1479053567,
		"1P7F9po18mshkbRG5zEVV47vHtLEX19QJa_1480262710": 1480276851,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1482038462": 1482077709,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1482463645": 1482506179
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "What is the benefit of using zstd 0.7.0 over LZ4 HC mode?",
			"post_uri": "1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9_1473095371",
			"date_added": 1473099188
		},
		{
			"comment_id": 2,
			"body": "Please stop with the crap about Microsoft apparently breathing over your shoulder spying on everything. Unlike Google they're not any significant online advertising company and can do very little with your info if they wanted it (from a profit perspective). Microsoft is pushing for Win10 because they can get continuous revenue from a percentage of purchases made on the Windows 10 Store and their services like Groove Music, Microsoft Films & TV, Xbox and all that. They have been using telemetry since Windows Vista to help shape their products and on 10 they just made it more clear to consumers. If they genuinely wanted to spy on people they wouldn't make them available as options on their own dedicated \"Privacy\" tab on the front page of the settings app.\n- See this for details on the realities of this hoax: https://imgur.com/gallery/oQDnY",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1479222139",
			"date_added": 1479232363
		},
		{
			"comment_id": 3,
			"body": "@ulrichard: Since when can Microsoft \"gain access to private computer systems\"? Also, since when are they \"gathering sensitive information\"? A client-side automated email scanner that looks for keywords and auto creates calendar events isn't gathering sensitive info, it's using it for a feature locally. Optionally backing up encryption keys isn't a bad idea imho, as if you lose the key you still have the chance of getting your stuff back and you are still welcome to delete the backup of course. What about device and diagnostic data? Personally I don't think an anonymous compilation of your system specs is sensitive - chances are there's always going to be way more than just you using one or more similar components. Usage data? Knowing that someone opens the news app frequently or that the web browser is more popular than the weather app in a certain country isn't sensitive data to me.\nTell me, what sensitive data is actually being collected on Windows 10 that you can prove? Also, did you see that imgur link I sent you?",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1479222139",
			"date_added": 1479243369
		},
		{
			"comment_id": 4,
			"body": "Here's the download you wanted: https://go.microsoft.com/fwlink/?LinkID=799012",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1482507164",
			"date_added": 1482511099
		}
	],
	"flags": {},
	"comment_like": {
		"13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg_7": 1477762660,
		"13RFJdsXQGN5cfMK8GctB6nQZ5xwLmjcfB_7": 1478956844,
		"12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu_2": 1479232483
	}
}