{
	"next_post_id": 4,
	"next_comment_id": 1,
	"next_follow_id": 1,
	"avatar": "generate",
	"user_name": "Chenyu",
	"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1471961483,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 2,
			"body": "Криптобудущее: биткоины среди нас Коктейль \nВ центре Москвы открылся пункт обмена биткоинов — первой и самой известной криптовалюты. Корреспондент «Сноба» рассказывает, что такое биткоин, на что его можно потратить и о чем говорит его появление\n\nПункт обмена биткоинов, который я не мог найти полчаса, даже пользуясь картой, ничем не отличается от обычного пункта обмена валют: крошечная комнатка, куда могут поместиться лишь пара человек, железное окно с двойным защитным стеклом, за ним операционист. Мы поздоровались через стекло, он попросил меня закрыть за собой дверь и только после этого выдвинул кассовый лоток, чтобы мы лучше слышали друг друга.\n\n— Я бы хотел купить у вас биткоины.\n\n— Мы их не продаем, только покупаем.\n\nПотом я узнал, что даже если бы продавали, позволить их себе я бы не смог — один биткоин стоит несколько десятков тысяч рублей.\n\nБиткоины — это валюта и в то же время цифровой товар, ими можно расплачиваться, а можно в них инвестировать: на момент написания этого текста цена одного биткоина составляла 36 518 рублей, а за год до этого, 18 августа 2015-го, он стоил в два с лишним раза дешевле — всего 16 799 рублей. Изменение цены происходит очень быстро: две недели назад за биткоин можно было выручить 43 612 рублей. Криптовалюта не привязана к золоту, как национальные валюты. Ее стоимость определяется спросом на бирже: чем выше спрос, тем больше денег нужно заплатить за покупку. Особенность таких денег в том, что каждая денежная единица уникальна, имеет свой код, который невозможно подделать. Криптовалюта отличается от электронных денег, которые находятся у нас на банковских картах, тем, что ее не нужно вносить на счет через банкомат и этим превращать вещественное в цифровое, она сразу — цифровое.\n\nЕсли вам хочется иметь биткоины, необязательно их покупать, вы можете заняться майнингом, «добычей». С помощью специальных программ нужно решить задачу, которая строится по алгоритму, написанному анонимным хакером, после чего вы получаете монету — биткоин.\n\n\nЧем больше времени проходит с момента создания этой системы, тем сложнее становятся задачи, так что на данный момент «майнить» в одиночку не имеет смысла, потому что одному процессору не хватает вычислительной мощности — «добытчики» собираются в группы. Единого сервера у системы нет, она построена по принципу равноправных узлов-участников, которые организуют группы майнеров на основе исходного кода, который создал и выложил в 2009 году в открытый доступ в интернете хакер, работавший под псевдонимом Сатоши Накамото. Неизвестно, один это человек или группа, но есть мнение, что под никнеймом Сатоши скрывался американский предприниматель Стивен Райт.\n\nО том, зачем может пригодиться пункт обмена биткоинов, операционист рассказал следующее: «Во многих онлайн-банках есть лимит на суточный перевод, например 500 000 рублей. На 100 рублей больше вы уже не переведете, так что вам придется использовать карту другого человека или ждать до завтра — все это связано с неудобствами. К тому же карта, на которую несколько дней подряд переводят крупные суммы, может вызвать подозрения у службы безопасности банка: не криминалом ли занимается этот человек, не отмывает ли деньги. Можно получить банковский перевод, но это займет несколько дней. А вот если у человека есть биткоин-кошелек, он может получить перевод биткоинов на любую сумму, а потом обменять их у нас. Все это выглядит малопонятным, потому что наше общество почти в первобытном состоянии, а на Западе криптовалюта уже несколько лет используется в быту. Чтобы операции с биткоином были законными, чтобы нас услышали — мы должны показать, что мы вообще есть. В правительстве увидят нашу деятельность, проанализируют и дальше будут ограничивать или наоборот поощрять».\n\nЛотерея, Xbox и мультики — где встречается биткоин\n\nВ Европе, США, Израиле и Канаде с 2013 устанавливают биткоин-банкоматы, через них можно пополнить свой биткоин-кошелек, а потом потратить криптовалюту, например, на оплату подписки Xbox или приложений из магазина Windows. Или купить на нее одежду, что-то в музыкальном магазине или просто выпить кофе. Но пока это уникальные случаи, о которых пишут в СМИ. Массового применения в повседневной жизни у биткоинов нет.\n\nЗаработать на криптовалюте можно не только инвестируя в нее. В интернете работает много онлайн-обменников, покупающих и продающих биткоины и получающих процент с операций. Можно создать кошелек для криптовалюты и получать процент от переводов биткоинов пользователями. Но есть и необычные предприятия: Олег Осоргин, инженер, до 2015 года работавший в Газпроме, вместе с партнерами открывает лотерею Kibo, в которой вместо обычной валюты можно выиграть биткоины. На вопрос, что делать с биткоинами, предприниматель ответил, что в России биткоины пока что неактуальны — в отличие от Запада, где ими можно оплатить товары и услуги, у нас их можно только обменивать. Но и это выгодно, учитывая то, за сколько можно продать свои биткоины.\n\nБиткоины часто оказываются в сводке новостей. За последние месяцы произошло много событий, связанных с криптовалютой: «Партия роста» заявила, что собирается принимать пожертвования в биткоинах; компания Bitfilm сделала о них мультфильм; «МММ» Мавроди продает криптовалюту, и этим интересуются китайцы; террористы собирались заразить Чехию Эболой, если правительство не заплатит им 5000 биткоинов; в AppStore обнаружены и удалены биткоин-кошельки, через которые мошенники воровали у пользователей деньги; бизнес-омбудсмен Борис Титов спросил у работников Саратовского электроприборного завода, могут ли они делать биткоины, на что ему ответили, что слышали об их незаконности, но «если родина прикажет — сделаем».\n\nБиткоин и безопасность\n\nКриптовалюта очень популярна среди злоумышленников. В теневом интернете (TOR), ставшем за последние годы достаточно известным благодаря Эдварду Сноудену, который передавал секретные данные как раз через него, расчеты между торговцами оружием, продавцами наркотиков, киллерами и их клиентами в основном происходят с помощью биткоинов. Например, за последние два года наркоторговцы стали в 20 раз чаще использовать биткоины. Это может быть связано с ростом популярности теневого интернета и увеличением стоимости биткоина. Помимо этого, в TOR можно найти то, что представляют угрозу государственной безопасности: как писали в СМИ, на одном из скрытых сайтов осуществляют сбор биткоинов для киллеров, которые могли бы устранить политиков или общественных деятелей — получается что-то вроде краундфандинговой площадки для оплаты убийств.\n\nВ правительстве пока не решили, можно ли разрешить использование криптовалюты в России: 16 сентября 2015 года Минфин заподозрил, что в биткоинах есть опасность, 17 сентября глава Сбербанка Герман Греф заступился за них и даже признался, что сам владеет определенным их количеством, 18 сентября Центральный банк создал рабочую группу для изучения биткоина. Спустя неделю Министерство финансов предложило наказывать за оборот криптовалюты исправительными работами на срок до двух лет, а в марте 2016-го оно выступило за ужесточение ответственности — вплоть до 7 лет лишения свободы. Причиной для таких мер в Минфине считают риск отмывания денег и ухода от налогов. Однако 12 августа стало известно, что Генпрокуратура и Минюст пока воздерживаются от введения уголовной ответственности за биткоины.\n\n\nНикита Масленников, эксперт по экономике Института современного развития, рассказал «Снобу» об угрозах, которые может в себе нести криптовалюта: «Для владельцев биткоинов есть риски в колебании курса криптовалюты, а в правоохранительных органах опасаются, что преступные группировки могут создать закрытую сеть по обмену биткоинами и мгновенно переводить друг другу деньги, которые будет невозможно отследить. Во многих странах такой вариант изучается — американцы научились достаточно эффективно пресекать подобные начинания. Пока что информация обо всех транзакциях общедоступна».\n\nПохожего мнения придерживается Олег Осоргин. Он рассказал, что технология, на которой построена криптовалюта, делает ведение бизнеса прозрачным, потому что все транзакции с ее использованием можно увидеть. В безопасности использования такой валюты предприниматель не сомневается: «Жульничать с биткоинами невозможно, потому что алгоритм криптошифрования очень сложный и не поддается взлому на текущий момент».\n\nБудущее криптовалют\n\nНикита Масленников также рассказал, какое место биткоины могут занять в будущем: «Представьте, что идет мощная технологическая волна, а криптовалюты — это брызги, лишь производная от технологических решений, за которыми последует новая технологическая революция. Сбербанк в исследовательских подразделениях активно исследует возможность применения криптовалюты, в ЦБ также есть группа, изучающая финансовые технологии нового поколения. Цифровые валюты развиваются, и финансовые аналитики сравнивают их с изобретением интернета. Если биткоины войдут в массовую жизнь, вся система изменится: преобразятся отношения между контрагентами, появятся новые услуги, скорость предоставления уже существующих изменится, со стороны правительства появятся новые надзирающие структуры. Подобных трансформаций финансовой системы было несколько за мировую историю: сначала был бартер, потом в качестве денег начали использовать слитки металлов, позже из них стали чеканить монеты, дальше возникли банкноты, а теперь появляются цифровые деньги. Если монеты — это феодализм, то ассигнации — это капитализм, а сегодняшняя ситуация — свидетельство перехода мира в совершенно новое качество. Уже сейчас банкноты теряют свою популярность, постепенно мы переходим на пластиковые накопители. Ни один специалист не скажет с полной уверенностью, что именно происходит, но то, что к происходящему нужно присматриваться, а не препятствовать развитию — это несомненно. Думаю, что в ближайшие 10-15 лет мировая финансовая система изменится в корне».\n\n",
			"date_added": 1471962040
		},
		{
			"post_id": 3,
			"body": "https://youtu.be/RuZ80TPUF_A",
			"date_added": 1471962198
		}
	],
	"post_like": {
		"131fLpXo4zvnE1eVSktpWvQhP9obMAnUUN_1": 1471961562
	},
	"comment": [],
	"follow": []
}