{
	"next_post_id": 19,
	"next_comment_id": 59,
	"next_follow_id": 2,
	"avatar": "generate",
	"user_name": "Obatoyou",
	"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1479451096,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1479481280,
			"body": "http://www.yogeev.com/article/34345.html “胖蒜”的出现说明中国耕地质量的下降到了非常严重的程度。连续30年来，农民只施加化肥不用有机肥，并在种植大蒜以后将除草剂、剧毒农药都施加在地里，并蒙上一层塑料膜。这样严酷的环境，植物怎么能够生长好呢？其实解决“胖蒜”的办法很简单，停止大量化肥、农药、农膜、除草剂使用，改用有机肥养地。我们用有机办法种植的大蒜，没有一个得“胖蒜”的，土地很肥沃。农民看到这一好处，纷纷来购买牛粪，化肥就不被农民看好了。",
			"date_added": 1479481278
		},
		{
			"post_id": 1479534074,
			"body": "海牙人民法庭就孟山都“生态灭绝，生物灭绝！种子灭绝”启动审判程序！ ... 如今人民组织起来，审判孟山都，审判转基因。遭人民审判的孟山都及其转基因\n\n吕永岩：孟山都反人类罪将在海牙国际法庭受审！_环球之音 ...\n内容摘要：国际环境保护团体宣布将在海牙国际法庭起诉生产转基因及配套农药的恶行累累的孟山都公司，其罪名包括“通过谎言和腐败”“支持欺诈性的科学研究 ...\nwww.huanqiuzhiyin.com/hqjj/2015/12041508.html\n海牙人民法庭就孟山都“生态灭绝，生物灭绝！种子灭绝”启 …\n吕永岩按语：这是海牙历史上罕见的一幕：来自世界各国的代表组成人民法庭，被告是转基因巨头孟山都，罪名是“三个灭绝”：生态灭绝、生物灭绝、种子灭绝。惯用 ...\ndzzlch.red/article-8748-1.html",
			"date_added": 1479534067
		},
		{
			"post_id": 1479535094,
			"body": "\n.\n.\n欧洲15国，2015年11月7号禁止转基因：\n\n这些国家是：\n奥地利，比利时，保加利亚，克罗地亚，塞浦路斯，丹麦，法国，德国，希腊，匈牙利，意大利，拉脱维亚，立陶宛，卢森堡，马耳他，荷兰，波兰，斯洛文尼亚，爱尔兰和苏格兰。（木有中国哦 ！）\n\n只有欧洲人在拒绝转基因吗？\n\n离我们最近的菲律宾，也在近期2015年11月8号宣布了禁止转基因：菲律宾最高法院，基于“预防原则”判决永久禁止转BT毒蛋白茄子实验田的科学研究实验种植，法院认为科学家关于转Bt茄子的安全性缺乏共识。宣称现有科学与技术法规并不足以确保人民的安全环境和健康，当存在不确定性、不可逆转损害的可能性和严重伤害的可能性时，首先采取预防原则。\n\n\n\n\n\n台湾禁止学校使用转基因食品\n\n台湾地区立法机构2015年12月14日通过相关规定，明确未来台湾各级供应餐饮的学校，包括中小学营养午餐、大学餐厅，都全面禁止使用含转基因的生鲜食材及初级加工品。近年来转基因食品安全问题在岛内受到持续关注和讨论。国民党籍民意代表卢秀燕说，长期以来大人有权拒买拒吃转基因食品，但学童享用营养午餐却没有选择。今后，孩子能吃得更安全、安心，也象征民众食安观念的进步。\n\n\n新闻：25名学生在毫不知情的情况下被试吃转基因黄金大米。幸运的是这件事最后被曝光了，试着想想还有多少秘密的转基因在进行。\n\n\n现在 德国内阁批准了禁止种植转基因作物的法律。\n在俄罗斯禁止转基因食品 – 铁血网\n导读：[中文报道]俄罗斯农业部长费多罗夫声明，我国一贯致力于禁止生产转基因食品。全世界科学家、生态学家和生产者之间关于这个问题的争论由来已久。",
			"date_added": 1479535084
		},
		{
			"post_id": 1479544723,
			"body": "凡龍翔说:转基因农作物，主要是含毒蛋白，即杀虫晶体蛋白。伴孢晶体被敏感昆虫幼虫吞食后，在肠道碱性环境和蛋白酶作用下释放出的毒性肽与昆虫中肠上皮细胞的特异受体结合形成离子通道，破坏细胞渗透平衡，使细胞肿胀破裂，最终导致昆虫死亡。人食后后果更严重。",
			"date_added": 1479544712
		},
		{
			"post_id": 1479549126,
			"body": "这是一篇全世界人民都应该看的文章！！！不要觉得长，作者真的喊出了我们想说的。条理很清晰。\n.\n.\n孙锡良：有关转基因，我要讲十点\nhttp://mp.weixin.qq.com/s?__biz=MzAxODgxMTY2OQ==&mid=2650681282&idx=1&sn=ec0fdae78bc5b815892e7aacaf880d51&chksm=83da11b8b4ad98ae964871f22e0d16fe791b3be5c765a2c1499a55e2960aed5d3c2b1ac8474e&mpshare=1&scene=1&srcid=1118rgcD2wjcuLryVYv2jE7p&from=groupmessage#wechat_redirect\n原创 2016-11-18 孙锡良 孙锡良\n\n有关转基因，我要讲十点\n\n \n 最近三年，我几乎没有认真关注过转基因问题，因为我认为它已经演变为一个敏感性难题——顶端不想解决。这是很头痛的事，是不易解决的事。\n今天，我在各主流媒体中看到一篇醒目文章，某学者把中国“反转人士”的言行定性为“反党、反政府、颠覆国家政权”，并说这是配合外国敌对势力在搞破坏活动。这个定性就太可怕了，这会让人感受到一种恐怖气氛，我是坚决反对这种定性的。\n　　我不是一个反转者，我是一个转基因问题的讨论者。结合我以往的看法，今天想对有关部门提出十个问题，希望你们能听一两句。\n    \n",
			"date_added": 1479549114
		},
		{
			"post_id": 1479561006,
			"body": "无论砖家叫兽买办怎么鼓吹转基因无害http://blog.sina.com.cn/s/blog_165b3e4b10102xbgy.html\n1.欧盟绝对禁止（包括动物饲料）\n2.中国官员特供食品严禁转基因\n3.世博会严禁转基因食品\n4.亚运会严禁转基因食品\n5.非洲人饿死也不进口转基因\n6.大运会严禁转基因食品\n7.俄证实转基因食品使动物三代绝种\n8.农业部幼儿园禁止转基因食品！（农业部明明知道转基因食品有害，自己的后代不吃，却大量进口让全国人民去吃！）\n9.财政部食堂禁止转基因",
			"date_added": 1479560993
		},
		{
			"post_id": 1479738655,
			"body": "转基因生物武器大战－美国：国家安全头号威胁，Z国：专供全国13亿老百姓！\n作者：半解一知半解     时间：2013年7月20日修改  \nhttp://blog.sina.com.cn/s/blog_4b7683ce0102vitu.html\n.\n有关的支持材料和事实请参见以下文章：\n《俄罗斯研究报告称转基因已证实会绝育》\n《凤凰网：美学者曝转基因大豆将致人三代绝种》\n《转基因大豆导致出生缺陷和癌症》\n《美科学家在孟山都引入Z国的转基因作物中发现令人类绝种的新型病原体》\n《伪科学与欺骗的奇迹：90天的老鼠实验成为中华民族难以逾越的生死劫！》\n《老鼠不见了——山西、吉林动物异常现象调查》\n《十万火急，多地网友披露转基因玉米先玉335的巨大危害》\n《巨毒品转基因：亡鼠灭种、亡猪灭种、亡土灭种、断子绝孙亡国灭种！》\n《天花病毒让印第安人亡族灭种，转基因让中华民族亡国灭种！》\n《转毒基因已在全国泛滥成灾，中华民族再次到了最危急的时刻！》\n《贸然推动主粮转基因化将是亡国之举》\n《第三次世界大战已经爆发，Z国军队、公安一败涂地，举国沦丧！》\n《“执政为民”的党中央对转毒基因食品的态度和政策很明确：严禁！》\n《众多国内事实证明：转毒基因杀虫有限，却专杀动物、杀人！》\n《印尼国际知名接生员揭露转基因大豆对胎儿的巨大毒害与毒杀》\n《Z国北方网友揭露转毒基因玉米对胎儿的巨大毒害与毒杀！》\n《俄罗斯科学家：转基因玉米滋生植物病毒致2百万美国人死亡！》\n《丹麦一养猪农民揭露转基因大豆对猪的巨大毒害与毒杀！》\n《某专业生物男实验证明：转毒基因在特定情况下是速死巨毒品！》\n《小雌猪没有内生殖器官揭开了转毒基因导致断子绝孙的惊天真相！》\n《警告：转基因大豆、玉米将越来越毒，危害将越来越严重！》\n《新京报：人大教授朱信凯详解农产品比核武器重要》\n《每年数十亿吨转基因强喂13亿小白鼠，Z国惨遭转基因大屠杀！》\n《美国和转基因骗子精心布局 全Z国沦为剧毒品试验场 特供们也未幸免》\n《印尼转基因重大专项成农民噩梦，转毒基因骗子们再被抽大耳光！》\n《没有Z国相救，转基因垃圾技术早死了》\n《作为饲料的转基因，俄国将立法严控——Z国还要转基因食品合法化？》\n《农Y部拿什么让民众相信转基因的安全》\n《为什么说Z国农Y部是转毒基因食品化怪胎、魔鬼？！》\n《转基因监管“十关”一捅就破！》\n《中药转基因，伪科学骗子丧心病狂！》\n《人民R报首次披露转基因惊人污染不可控》\n《众多事实证明：转基因骗子和农Y部是邪恶的谎言制造机！》\n《毒疫苗与转毒基因双管齐下，比尔·盖茨至死方休反人类？！》\n",
			"date_added": 1479738639
		},
		{
			"post_id": 1479784275,
			"body": " Good News! A Sep. 2016 appreciation letter to board of China University of Mining (Beijing): \"I, Wang Yong-min, am parent of 2015 freshman. When I accompanied my child to register entering the university, I has food at three different canteens within the university and was very depressed to find they all used Lubao brand GM soybean oil. I first contacted the  logistics department director, then reported to Zhang Qing-guo, director of the canteen center. Upon learning the harm to health by GM food products, he suggested that I should write a report in name of student parents to vice president Fan responsible of logistics of the university, enabling the board of the university to discuss and decide during their next meeting! ... Upon submitting my report ... within half a month I received a short text message from vice president Fan confirming \"the university has already used non-GM soybean oil\". Thereafter, I went to the university a few time and verified that the university canteens have all changed to use non-GM soy oil! In view that the university so attaches great importance and accepts the positive suggestions by concerned, and considers if reasonable then actively adopts solutions, as a parent of a student who submitted this suggestion, I am deeply impressed and appreciate, hope the university not only accomplishes astonishing breakthrough in education quality together with great improvements in health of teachers and students.\" \n.\nThe suggestion report by Wang Yong-min in Oct. 2015: \"I am a parent of a 2015 freshman, very honored that my child can become a freshman at your university, but I have an issue with the feelings of urgent I need to the propose to the university: Change the GM oil used by the university canteens to non-GM compressed food oil. The reason is as follows: \"Effect on reproduction .. State important government department and major activities and meetings do not use GM oil ... GM food causes tumors ... GM food causes diabetes ... Argentina and Brazil are seriously suffered by GM crops ... As parents we hope our children healthy grow, all students are family members of the mining university family, I believe the leading members of the university and all teachers also hope all children healthy grow, achieve success in their studies, in the future make contribution to their motherland. You all do not want to see our children face the danger of not been able to have children and suffer by diseases. On behalf of parents of dozen of thousands students, we look forward to our suggestions be accepted and realized! (From what I learnt, the teachers of the university also eat at the canteens, face the same danger) Furthermore, the price for selecting compressed non-GM food oil is only slightly higher that GM food oil, only about 1 Yuan (about USD1.6)/litter, averaged to each meal is only increases the cost by about 3 cents. If the university considers that students from poor families might be under economic pressure, I am willing to donate a few dozen thousand Yuang for such sake.\" \n.\n[Comment: For their own whole life health and for healthy offspring, call to all teachers and university students to actively reveal systematic harm caused to health by illegal GM soy ingredient food and \"chemical extracted\" fool oil never approved by Ministry of Health nor Ministry of Agriculture, promote all universities, middle schools and primary schools around the nation to follow the example of the University of Mining (Beijing): change to safety and healthy non-GM compressed food oil!]   ",
			"date_added": 1479784258
		},
		{
			"post_id": 1479785946,
			"body": "美国第九巡回法庭上诉庭判决,联邦法允许各州和郡通过禁种转基因的法律,但因为夏威夷州法禁止各郡管理转基因,所以夏威夷2014年各郡公投禁种无效.有意思的是上诉庭确认转基因带来若干环境隐患,包括农药使用增加损害了有益的动植物,导致超级杂草和害虫,降低生物多样性,因污染而给种植非转农民带来经济损失\n6分钟前 来自 微博 weibo.com",
			"date_added": 1479785928
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 2,
			"body": "\n观察了2天zerome，开开心心注册个帐号，刚看到一个信息，转基因木瓜带有抗生素基因还有毒蛋白基因，我们这 是又是 吃毒又是加抗耐药呀，，，，，，，以后肯定没治了。。。",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1",
			"date_added": 1479453330
		},
		{
			"comment_id": 4,
			"body": "古巴是一个拉丁美洲的小国家，但它拥有全球规模最大的生态农业，都市居民吃的蔬菜、餐桌上的米饭，75%来自方圆十公里内的农地，当有机农业在全世界蔚为风潮，古巴农民早在20年前就不用农药化肥，在气候变迁日益严重、石油资源枯竭的今天，古巴用多样化的耕作方式，为全世界提供另类的粮食新解。   \n.\n       除了生态农业，来到古巴，你可能还会看到高级的华楼大厦前，种着一排排蔬菜、玉米、花卉，每块土地至少种了20个种类的蔬菜，在台湾，这可能是都市人的休闲娱乐，但在古巴却是随处可见的景象。\n.\n陈美玲表示，古巴政府将都市周围五公里定为城市农业，十公里定为郊区农业，全面禁止农药化肥，都市居民可以到这里买菜，若有兴趣也可在自家门口种菜，食物里程超短，有些农民甚至会设置小型风力发电机、自制储水系统，实现自给自足的循环型农业。陈美玲指着自家被蔬菜淹没的民宅入口，笑着说：“自从来到古巴就被他们感染了，感觉一定要好好利用家里每一块土地。”",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1",
			"date_added": 1479480737
		},
		{
			"comment_id": 5,
			"body": "@Hellblazer: 粮价直接和使用多少转基因专用农药量有关， 转基因种得越多，转基因专用农药草甘膦用得越多，粮价越贵，土地恶化，转基因农药用得更多，粮价更贵。。。。农药公司孟山都赚死了，，，，， 草甘膦在植物体内不能分解被人体吸收 再加上 毒蛋白，，，，，，",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479481280",
			"date_added": 1479532979
		},
		{
			"comment_id": 10,
			"body": "@Linkerlin: 对的，现在搞转基因的还不停的投毒污染，以后大自然肯定要惩罚所有没有反抗的人类的。     草甘膦的毒和毒蛋白都被人体吸收了，身体达到一定剂量就会有反应了，，这是迟早的事",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479535094",
			"date_added": 1479539143
		},
		{
			"comment_id": 12,
			"body": "       第二个问题：全国人民代表大会为何继续缺位？农业部的几个官员始终强调，批准转基因主粮有法可依，但据我所知，他们所说的“依据”仅仅是国务院的几个条例(有法律效力，但不是人大公开的立法)。\n我还要强调一点，目前的《条例》都是规范转基因研究和转基因成果管理的问题，并没有转基因产品商业化和转基因产品可成为主粮的详细实施细则，更没有正式的系统的产业化成文法律作支撑。按发达国家现成的经验，转基因粮食要走上餐桌必须要经过严格的议会讨论程序，只有议会讨论、严格立法后才能付诸实施。中国是一个人口超过十三亿多的大国，此事不与国际接轨，那还有什么值得接轨?\n全国人民代表大会必须对转基因研究和商业化有所行动，必须将此事列入中国未来的优先立法程序，全国人大代表不能沉默，你们之所以成为代表，是因为人民相信你们能为人民办事，能关心人民心中所想，如果你们都选择沉默，那要你们干什么?转基因的事情不管谁对谁错，交由全国人大公开讨论决不是坏事，只可能是好事。",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479549214
		},
		{
			"comment_id": 13,
			"body": "       第三个问题：转基因问题是纯科学问题还是民生问题？有很多人在谈到转基因主粮时，以为老百姓是没事找事，是杞人忧天，是无理取闹，以为科学家打包票的事情就万事大吉。有些专家说世界上已经有三千种转基因产品面世，但他们没有告诉人民到底有多少人在食用它？量有多大？到底是谁在食用它?到底是不是主食?他们没有告诉人民，转基因巨头们的家庭餐桌上是不是天天食用转基因主粮?中国批准转基因主粮的所有主管人物是不是以转基因主粮为生?科学不能成为民生的大帽子，想压到老百姓头上就压上。\n简单讲：自己餐桌上不常见的东西，不要尽往老百姓的餐桌上放。",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479549245
		},
		{
			"comment_id": 14,
			"body": "        第四个问题：转基因到底是有益于人类的科学还是反人类科学?谈这个问题之前，我姑且把转基因研究看作是一个科学问题，但，科学对于人类来说不一定都是正面的，有些是反人类的，人类在面对新科学时必须要有正确而全面的评估，评估其正面效应是否大于其反面效应，评估其反面效应是否能被人类所控制，评估其未来是否危及人类本身的存在，如果说人类对于其发展不具备任何有把握的信心，那么在开展这项研究时必然是小心谨慎的，尤其是对该科学成果的应用绝对是要保持足够长的时间和实践准备的，如果人类对于负面效应没有把握，我认为就只能限制于研究领域。三聚氰氨和瘦肉精都曾是科学新产品。\n我一直强调：中国可以跟随国际科学研究的步伐，加快转基因研究，甚至可以在规定的小范围内封闭种植，但是反对大面积商业化。",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479549264
		},
		{
			"comment_id": 15,
			"body": "        第五个问题：中国转基因技术真的世界领先吗？中国的某些科学家和官员不知天高地厚，到处吹嘘自己已经掌握转基因技术自主权，说中国转基因论文和专利居世界前列，超越了很多发达国家。\n我就很纳闷？既然核心技术绝大部分都掌握在自己手里，你们干嘛还要抱着孟山都、拜耳、先正达等跨国集团的大腿?你们干嘛还跟着他们的屁股后面闻臭?你看到英特尔公司抱联想集团的大腿吗?你看到微软董事长抱中科院的大腿吗?你看到宝马公司抱吉利的大腿吗?\n论文多，就代表实际水平居世界前列？不一定，中国的材料科学论文仅居美国之后，但我们的材料生产水平呢？中国的专利数也居世界前三，我们的产品原创能力又居第几？\n政府，请你们做一件事：晒晒世界转基因技术应用成果的真实情况，看看中国拥有多少不依附于欧美的独立可转化成果？",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479549281
		},
		{
			"comment_id": 16,
			"body": "     第六个问题：中国真的已经离不开转基因粮食？有很多支持转基因粮食作为主粮的人士认为，世界人口在急剧膨胀，中国人口数量巨大，要解决生存问题必须靠转基因粮食。\n实际上，到目前为止，几乎所有转基因粮食都不拥有量产优势，转基因水稻产量就没有中国现有水稻（包括新开发的常规稻种）产量高，其它作物也不比常规品种有多少优势。退一万步讲，世界粮食果真要靠转基因，难道非要中国人率先充当冒死鬼吗?别人不批准转基因粮食做主粮，为什么偏要十三亿多中国人先行试验?不是说中国连年获得粮食增收吗?不要转基因，我们能年年大丰收，不要转基因，我们能实现自给，我们又有什么必要充当转基因急先锋呢?",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479549301
		},
		{
			"comment_id": 17,
			"body": "       第七个问题：转基因产品抗虫能一劳永逸？“抗虫性好”是让很多民间人士接受转基因作物的最有力宣传武器，不打农药的作物，谁不喜欢呢？有专家拿转基因棉花为例，强调转基因棉花是如何有效抵抗棉铃虫的，强调每亩地能为农民多创收100多元收益。\n问题没那么简单，任何作物，包括自然作物，开始的时候，都是具有较强的生存能力和抗病性，最原始的棉花、玉米、水稻都很抗虫，并非只有转基因作物，人工种植久了，就不抗虫了。自然万物从来都是一个相互竞争的过程，过去种庄稼基本不用农药，现在为什么要大量使用农药?实践告诉我们：科学的进步永远不能改变自然的天敌，人与环境的相互进化是必然的结果，任何期待一劳永逸的科学顶峰都是不现实的，都是幼稚的。\n我家兄就种植过转基因棉花，头一年很好，第二年，新虫就出来了，对付了棉铃虫，又要抗新虫。有专家说，转基因粮食可以减少农药危害，可以保证食品安全。这一点也不足信，为什么呢?\n首先，转基因粮食短期的抗虫不代表长期抗虫，抗部分虫害，不代表抗所有虫害，仍然需要农药除害;\n其次，转基因粮食分泌的毒素能毒死害虫，并且是少量的粮食就可以将虫毒死，那么人类大量食用这种能毒死害虫的粮食到底有没有害呢?如果说没有，那虫是怎么死的?如果说有，那么到底有多大?长年累月的积累，会不会对人体产生作用?害虫和人类都是有生命的东西，不说完全相同，至少有相似性，能把虫毒死，我就不相信对人体一点害处都没有，哪怕是较小的毒性，时间长了，也许就是较重的后果。\n“药害”与“毒害”，到底谁轻谁重，我是不好下结论的，科学家能下结论吗?",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479549321
		},
		{
			"comment_id": 18,
			"body": "第七个问题：转基因产品抗虫能一劳永逸？“抗虫性好”是让很多民间人士接受转基因作物的最有力宣传武器，不打农药的作物，谁不喜欢呢？有专家拿转基因棉花为例，强调转基因棉花是如何有效抵抗棉铃虫的，强调每亩地能为农民多创收100多元收益。\n问题没那么简单，任何作物，包括自然作物，开始的时候，都是具有较强的生存能力和抗病性，最原始的棉花、玉米、水稻都很抗虫，并非只有转基因作物，人工种植久了，就不抗虫了。自然万物从来都是一个相互竞争的过程，过去种庄稼基本不用农药，现在为什么要大量使用农药?实践告诉我们：科学的进步永远不能改变自然的天敌，人与环境的相互进化是必然的结果，任何期待一劳永逸的科学顶峰都是不现实的，都是幼稚的。\n我家兄就种植过转基因棉花，头一年很好，第二年，新虫就出来了，对付了棉铃虫，又要抗新虫。有专家说，转基因粮食可以减少农药危害，可以保证食品安全。这一点也不足信，为什么呢?\n首先，转基因粮食短期的抗虫不代表长期抗虫，抗部分虫害，不代表抗所有虫害，仍然需要农药除害;\n其次，转基因粮食分泌的毒素能毒死害虫，并且是少量的粮食就可以将虫毒死，那么人类大量食用这种能毒死害虫的粮食到底有没有害呢?如果说没有，那虫是怎么死的?如果说有，那么到底有多大?长年累月的积累，会不会对人体产生作用?害虫和人类都是有生命的东西，不说完全相同，至少有相似性，能把虫毒死，我就不相信对人体一点害处都没有，哪怕是较小的毒性，时间长了，也许就是较重的后果。\n“药害”与“毒害”，到底谁轻谁重，我是不好下结论的，科学家能下结论吗?",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479549387
		},
		{
			"comment_id": 19,
			"body": "第八个问题：世界各国转基因现状到底如何？据目前世界上有关转基因粮食和食品的现状看，除开个别国家范围较广，绝大部分国家都是极小范围的销售，尤其是欧洲国家。表面上看，大家都有销售，但实际上有本质区别，美国人向亚洲推销转基因粮食，除了中国比较顺利以外，其它所有国家都遭遇了抵制，日本、韩国利用其严格的法律将美国的转基因产品压缩得几乎可以忽略不计，更谈不上大量进口主粮，而反观中国，进口美国的玉米当中有70%是转基因玉米。\n专家说中国人反对转基因，让美国的转基因产品赚了中国人的钱，美国大部分转基因粮食都销往了中国。我想反问的是：中国为什么不进口常规品种？欧洲人为何不把美国的转基因作物买过去？北京奥运，广州亚运，中国为什么要承诺食物中不含转基因？BJ峰会,HZ峰会，中国为什么承诺食物不含转基因？\n政府，专家们，请系统性地把世界各国种植或食用转基因粮食的详细情况编一本书，象学习某种精神一样学习世界各国转基因国情，大家把情况都搞明白了，搞不搞转基因，大家心里就有数，根本不用做思想工作。",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479549402
		},
		{
			"comment_id": 20,
			"body": "第九个问题：中国的转基因市场能监管好吗？如果不是看到专家访谈，我还真不知道转基因作物在中国已经产业化十多年了，我不知道这种信息，我相信绝大多数人肯定也不知道。从这个现象可以说明，中国政府在推广应用转基因作物时，自始至终都没有向公众开放，自始至终都缺少宣传，自始至终都缺少尊重民众自决权，市场上的转基因产品到底有何要求，老百姓一无所知。到目前为止，多少商品进入了中国人的餐桌?多少转基因饲料进入了大型养饲场的槽子?多少副食品含有转基因成分还不为人所知?\n有些人天真地认为，只要有了监管，转基因产品就不会泛滥。我不相信这个说法，近几十年来的实践告诉我：商人只要能赚钱，命都可以不要，不会怕监管。\n我还想问：中国谁能监管谁?中国有什么事情监管有效?妇孺皆知的事情尚且监管不好，撇开老百姓的转基因粮食能监管好?\n转基因监管还有一个监管上的致命问题是：技术壁垒。转基因技术的主要掌握者是欧美大巨头，检测技术大都由他们掌控，尤其是新型转基因产品的检测问题，中国完全跟不上国际巨头的步伐，即便能够引进国外检测设备，对13.4亿人的大国而言也是天文数字的开支，检测难度之大决非农药残留检测如此简单，无法监管，最终就要变成不必监管，危险性可想而知。\n要想让老百姓最大程度地接受并拥护政府决策，最有效的方法就是给人民知情权和决定权。有关转基因粮食的问题，决定权必须是十三亿多中国人，不是少数几个人，也不是少数几个团体。",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479549416
		},
		{
			"comment_id": 21,
			"body": "第十个问题：科学家、商家、政府能利益混杂吗？我观察转基因问题十多年，观察反转者也有十多年，总有一个感觉：利益纠葛高于转基因影响本身。大家都把自己装扮得如何如何的伟大，大家都把自己讲得多么多么地爱国。结果，每一次转基因事件都暴露，各自争的都是利益，哪里是什么站在对民族负责的高度？\n科学家，你拿了国家的钱，做研究便是，研究完了，成果交给国家，国家推不推广自有考虑。现在的问题是，科学家拿了钱，搞点研究，买点合作技术，然后象个商人一样到处炫耀、到处推广，有些人还象做贼一样非法播种，如果没有利益，科学家用得着这样搞么？外国科学家是这么做研究的么？\n商人，你想赚钱也行，你得光明正大地买合法专利种值作物，偷偷摸摸地非法种植，心里踏实吗？\n政府，你出了钱，让科学家做研究，出了真实成果，你就得收回来，种不种，依法办事就行，为什么非要把科学家和商人推到与大多群众对立的位置？对非法种植，为何不能严格管理？\n \n希望全国人民继续关注转基因粮食，无论转基因粮食是否安全，都必须有一个十分慎重和十分公开透明、十分广泛讨论的决策过程，任何刚愎自用的行为都必将遭到抵制。",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479549432
		},
		{
			"comment_id": 22,
			"body": "   第一个问题：转基因要不要过民意关？不管转基因有多好，也不管它有多大害处，涉及到全国人民的大事，必须尊重民意，不过民意关，就不是执政为民。一个涉及到十三亿多人的转基因主粮问题是不是可以算全民问题?如果不是，大可以漠视不理。如果是，那么执政者是不是要对人民的呼声给予足够重视?是不是应当问政于民?我这里所说的“人民”决不是指农业部和其它方面的几十位官员、专家、院士，这少部分人代表不了全体人民。世界各国人民在本国转基因问题上的民意力量如何？\n大家应该搞清楚！转基因粮食争论不同于科技革命初期的“科技恐慌”，不要把质疑人士归为“科盲”一类人。",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479550077
		},
		{
			"comment_id": 24,
			"body": "@Lmath: 不错，已经看到很多个地方中文化了，这对吸引普通人也是个好的吸引点，",
			"post_uri": "144GQ5Uz9dYQJ1MwjSFWWboLgHwdGpv21x_1479550094",
			"date_added": 1479550897
		},
		{
			"comment_id": 25,
			"body": "very nice , thanks",
			"post_uri": "19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ_1479527322",
			"date_added": 1479551263
		},
		{
			"comment_id": 29,
			"body": "@Monico: 我反对转基因毒蛋白，这样的东西给你吃好了，毕竟还能杀虫，多吃可以增寿。再加点三氯氰胺，瘦肉精加持。",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479555119
		},
		{
			"comment_id": 30,
			"body": "@Monico: 再给你喷点草甘膦激活毒蛋白活性，你可以天下无敌了，",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479555198
		},
		{
			"comment_id": 31,
			"body": "@Monico: 对了，还有二战时候孟山都用来打仗的橙剂，这个有点复古，大概也是你喜欢的毒药",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479555353
		},
		{
			"comment_id": 32,
			"body": "@Monico: 毒气逼人呀，简直是化学农药大公司孟山都的代表，你可以参加由孟山都资助的所有推广转基因的活动了，活动费用去孟山都官网领取，切忌名额有限。",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479555527
		},
		{
			"comment_id": 33,
			"body": "@Monico: 那么喜欢添 外国反人类化学农药公司 ，为什么不去自己去搜，懒得理你",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479549126",
			"date_added": 1479555690
		},
		{
			"comment_id": 36,
			"body": "美国基本都是出口的，出口给谁了，大家都明白！",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479561006",
			"date_added": 1479561120
		},
		{
			"comment_id": 42,
			"body": "@Linker: 是呀，人家的饲料成了我们的榨油。。。炒菜用。。。。好讽刺",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479738655",
			"date_added": 1479780894
		},
		{
			"comment_id": 44,
			"body": "能不能把 @Firebox 也喊上，他好像很行的样子，可能会对成功打包APK有帮助，",
			"post_uri": "13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ_1479740084",
			"date_added": 1479781805
		},
		{
			"comment_id": 45,
			"body": "请出示你的入网许可良民证，谢谢配合",
			"post_uri": "1NjeMbighrRwsSxmxi16xiurykccHnxtz_1479781713",
			"date_added": 1479783077
		},
		{
			"comment_id": 46,
			"body": "http://blog.sina.com.cn/s/blog_14e5f47970102wqz7.html\n2016年9月，对所有大学生健康负责任的一位家长致信中国矿大（北京）校领导感谢：“我是2015年考生家长王永民...送学生报到期间在校内三个不同餐厅就餐发现食用油全部是绿宝牌转基因大豆油，就很郁闷，先是找到后勤处处长...向主管副处长兼餐饮中心主任张庆国汇报，张处长听完我说的转基因的害处后，他建议我以学生家长的名字找主管后勤的范校长，范校长在听了我的汇报建议后，让我写个书面的建议，以便下次学校开会时上会讨论以便通过！...报告递上去后...过了不到半个月范校长给我短信“学校已启用非转基因大豆油”。后期我去过矿大多次，校餐厅一直在用非转基因大豆油！鉴于校方如此重视和接纳有关人士积极建议，而且认为只要合情合理就认真对待和积极解决，作为意见方的学生家长，深感敬佩和感激，愿校方不仅教学质量上有惊人的突破，而在师生健康上也有可喜的效果。”\n.\n王永民2015年10月致中国矿大（北京）校领导的建议信：“我是一名大一新生的家长，很荣幸孩子能成为矿大新生，但有一事今怀着急迫的心情向学校提出建议，将食堂转基因食用油改为非转基因压榨油。原因如下：关于生育能力的影响... 国家重点部门及大型活动会议不使用转基因油...转基因引起肿瘤... 转基因引起糖尿病... 阿根廷、巴西都深受其害... 作为父母希望自己的孩子健康成长，每位学生也是矿大大家庭的一员，相信矿大的领导和各位老师也希望孩子能健康成长，学业有成，将来报效国家。不愿意看到孩子们将来面临没有后代和疾病缠身的危险，我们也代表千万个学生家长，希望我们的愿望能够尽早实现，盼望！！(据了解，教职员工也都在食堂用餐，也同样面临危险）另外，选用压榨非转其因油价格会略高于转基因油，每升高1元钱左右，合到每人每餐增加3分钱，如果学校考虑贫困学生会有压力，我愿意赞助几万元。”\n.\n【评论：2015不孕不育大数据调查报告揭示“男性教师比普通男性不育的机率高出7倍”！为自己终生健康与后代健康，呼吁全国老师与大学生主动揭露卫生部、农业部从来没有批准过的非法转基因大豆食品、“化学浸出”油的系统性健康危害，推动全国大中小学效仿中国矿大（北京）: 换用安全健康非转基因压榨油！】",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479784275",
			"date_added": 1479784308
		},
		{
			"comment_id": 47,
			"body": "@ACG之神: 没有呀，是正常的“所有人”中看到的，你的信息也是呀，前一个hello我也看到了，只是没人先问你罢了，你也可以试着在别人的帖子下问别人，这样就可以得到互动了。",
			"post_uri": "1NjeMbighrRwsSxmxi16xiurykccHnxtz_1479781713",
			"date_added": 1479784469
		},
		{
			"comment_id": 48,
			"body": "@ACG之神: 你好zerome",
			"post_uri": "1NjeMbighrRwsSxmxi16xiurykccHnxtz_1479781713",
			"date_added": 1479785434
		},
		{
			"comment_id": 49,
			"body": "“你希望做點什麽？”  -------------我建议你首先做的就是宣传zerome给你朋友 和认识的人",
			"post_uri": "1NjeMbighrRwsSxmxi16xiurykccHnxtz_1479781713",
			"date_added": 1479785678
		},
		{
			"comment_id": 50,
			"body": "@Cxgreat2014: 对JAVA我有抵触，不如用 C C++ GOLANG 等写",
			"post_uri": "13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ_1479740084",
			"date_added": 1479787045
		},
		{
			"comment_id": 51,
			"body": "@Cxgreat2014:@莱文倩:  黑客 骇客 傻傻分不清，白帽黑帽 傻傻分不清，匿名维基解密傻傻分不清。。。。。",
			"post_uri": "13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ_1479740084",
			"date_added": 1479787196
		},
		{
			"comment_id": 53,
			"body": "@Lmath: 建议你去看下 《孟山都眼中的世界》，《转基因的前世今生》，法国纪录片《Tous cobays?（我们都是试验品）》，如果你信农业部的那套说法，喜欢转基因毒蛋白，那我支持你多吃些带了 科学帽子的 转基因毒蛋白，那是你的选择权利。",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479784275",
			"date_added": 1479794470
		},
		{
			"comment_id": 57,
			"body": "@Lmath: 我只想谈转基因，农业部能管好就好了，别只在嘴上重视，严惩。",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479784275",
			"date_added": 1479795635
		},
		{
			"comment_id": 58,
			"body": "@Lmath: 你家在哪里，我送你100桶转基因大豆油，不能转送他人，只能自己吃，我知道你很喜欢转基因毒蛋白大豆油。他们吃着特供，你吃着他们推销的转基因油，这才是支持的表现。",
			"post_uri": "1A5FxtwybRdveKnBCj4zyDoyJwA1ddVT4L_1479784275",
			"date_added": 1479795890
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1PK7r15RmMdmdnUCYeQEwuydfediNVDtt2",
			"user_name": "Linker",
			"date_added": 1479563314
		}
	]
}