{
	"next_comment_id": 11,
	"user_name": "rw",
	"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
	"post_like": {
		"18rFd7W9y5QGQEVXaCoJV7jyt7D8aN156h_1474908431": 1474974236,
		"1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_1478620854": 1479140068
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@theterminator: Communism will prevail",
			"post_uri": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa_26",
			"date_added": 1471942628
		},
		{
			"comment_id": 2,
			"body": "Hello, I don't know if this will post as my university's wifi, besides blocking any other port than 80 and 443 (even VPN!), is actually down due to server migration…",
			"post_uri": "19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ_17",
			"date_added": 1472683399
		},
		{
			"comment_id": 3,
			"body": "(Great, it turns out I've posted the comment by trying to RET)\n\nYou can install Emoji Keyboard, a – stillwhat buggy – Firefox extension which provides a large emoji keyboard and a search function.\n\nYou could have a look at emojipedia.org too.",
			"post_uri": "19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ_17",
			"date_added": 1472683540
		},
		{
			"comment_id": 4,
			"body": "ZeroBackup, for small and important documents (such as one's thesis), would be a pretty good idea, but there is the need to recover the documents if the computer gets lost, maybe through password. That would weaken security obviously.",
			"post_uri": "1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT_1472764174",
			"date_added": 1473006592
		},
		{
			"comment_id": 5,
			"body": "That could work if one would upload the Zeronet key on encrypted flash storage and give it to some friends though. But some people don't have friends running Linux. That'd still be a security problem, why not a separate key for ZeroCloud?",
			"post_uri": "1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT_1472764174",
			"date_added": 1473006735
		},
		{
			"comment_id": 6,
			"body": "@狗蛋: Seconding this. What?",
			"post_uri": "1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT_1473305850",
			"date_added": 1473465634
		},
		{
			"comment_id": 7,
			"body": "Besides morality, I believe legitimacy is what ultimately makes people happy.",
			"post_uri": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa_1473992249",
			"date_added": 1474833317
		},
		{
			"comment_id": 8,
			"body": "I mean that the end justifies the ways if this end is to make people happy.\n\nConversely, a legitimate end would just be a way to make people happy.\n\nThough I'm glad I can rely on law to know how to make people happy, that ends at some extant, such as the right of property (I'm not glad of this but I still respect it because I don't want to go to prison, and because respecting it right now prevents abusive situations).\n\nEveryone here seems to agree about it, but I just want to make clear that most governments simply don't seem to aim at individual and collective happiness anymore, that's the thing.",
			"post_uri": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa_1473992249",
			"date_added": 1474833739
		},
		{
			"comment_id": 9,
			"body": "Well, that's not what they're looking for anyway. You can't easily share medias or files, and I don't think they would recruit people here (people are on Facebook and Twitter). The problem to me would be authorities (I think about my country, France), blocking or forbidding the ZeroNet port.",
			"post_uri": "1AjxW1N844WRpscEFSotfsqLXsQurz83xc_1475067668",
			"date_added": 1475069103
		},
		{
			"comment_id": 10,
			"body": "The Declaration of Independance of the Cyberspace applies as well: https://www.eff.org/cyberspace-independence\n> On behalf of the future, I ask you of the past to leave us alone. You are not welcome among us. You have no sovereignty where we gather.",
			"post_uri": "1AjxW1N844WRpscEFSotfsqLXsQurz83xc_1475067668",
			"date_added": 1475069223
		}
	],
	"flags": {},
	"comment_like": {}
}