{
	"next_post_id": 4,
	"next_comment_id": 2,
	"next_follow_id": 6,
	"avatar": "jpg",
	"user_name": "Aesir",
	"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
	"intro": "",
	"post": [
		{
			"post_id": 1474698344,
			"body": "Hail victory, the pinnacle of humanity is not \"democratic\" savagery, but autocratic rule, with an iron fist. Democracy and individualism is what keeps us weak, when we band together, like sticks on a fasces, we are strong. And like the axe on a fasces, we can strike down our enemies. God bless you, my like minded individuals, may He grant you strength, in these difficult times. Sieg Heil.﻿",
			"date_added": 1474698342
		},
		{
			"post_id": 1474955549,
			"body": "The Racist Tree\n\nOnce upon a time, there was a racist tree. Seriously, you are going to hate this tree. High on a hill overlooking the town, the racist tree grew where the grass was half clover. Children would visit during the sunlit hours and ask for apples, and the racist tree would shake its branches and drop the delicious red fruit that gleamed without being polished. The children ate many of the racist tree's apples and played games beneath the shade of its racist branches. One day the children brought Sam, a boy who had just moved to town, to play around the racist tree.\n\n\"Let Sam have an apple,\" asked a little girl.\n\n\"I don't think so. He's black,\" said the tree. This shocked the children and they spoke to the tree angrily, but it would not shake its branches to give Sam an apple, and it called him a nigger.\n\n\"I can't believe the racist tree is such a racist,\" said one child. The children momentarily reflected that perhaps this kind of behavior was how the racist tree got its name.\n\nIt was decided that if the tree was going to deny apples to Sam then nobody would take its apples. The children stopped visiting the racist tree.\n\nThe racist tree grew quite lonely. After many solitary weeks it saw a child flying a kite across the clover field.\n\n\"Can I offer you some apples?\" asked the tree eagerly.\n\n\"Fuck off, you goddamn Nazi,\" said the child.\n\nThe racist tree was upset, because while it was very racist, it did not personally subscribe to Hitler's fascist ideology. The racist tree decided that it would have to give apples to black children, not because it was tolerant, but because otherwise it would face ostracism from white children.\n\nAnd so, social progress was made.",
			"date_added": 1474955546
		}
	],
	"post_like": {
		"12uT4vU8m2CkuLW8ymLz5kpAyFQZ3Jj8XH_1474698344": 1474780496,
		"1KujWmU9iTGYy2HM531ot55EuyW1uiPWcw_1473048544": 1474780502
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Mynameislegion: For you.",
			"post_uri": "12uT4vU8m2CkuLW8ymLz5kpAyFQZ3Jj8XH_1474698344",
			"date_added": 1474780837
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1Lxi4PBAxhmirZjNbZ1EDfDWwa18kh4okm",
			"user_name": "Cmdr",
			"date_added": 1474779381
		},
		{
			"follow_id": 2,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1CEnKfVALihFLwjwwb9qbA6JojRKFjGAZM",
			"user_name": "Klapaucius",
			"date_added": 1474780194
		},
		{
			"follow_id": 3,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1KujWmU9iTGYy2HM531ot55EuyW1uiPWcw",
			"user_name": "Counterinitiate",
			"date_added": 1474780210
		},
		{
			"follow_id": 4,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1DBGVQKU9VwjTZcoXCs1B6ZJ84VcGyimar",
			"user_name": "Mememagician",
			"date_added": 1474780427
		},
		{
			"follow_id": 5,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1CEnKfVALihFLwjwwb9qbA6JojRKFjGAZM",
			"user_name": "Klapaucius",
			"date_added": 1474789965
		}
	]
}