{
	"next_post_id": 9,
	"next_comment_id": 9,
	"next_follow_id": 9,
	"avatar": "jpg",
	"user_name": "Gnuru Wanabi",
	"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
	"intro": "quien no tiene problemas, tampoco tiene soluciones.",
	"post": [
		{
			"post_id": 1,
			"date_added": 1472312311,
			"body": "Gracias @nofish por la ZeroNet!"
		},
		{
			"post_id": 1472367580,
			"body": "quisiera hacer animaciones como [\"User Liberation\"](https://www.fsf.org/blogs/community/user-liberation-watch-and-share-our-new-video)",
			"date_added": 1472367578
		},
		{
			"post_id": 1472368034,
			"body": "no sabía que el término \"propiedad intelectual\" escondía tanto hasta que leí el texto **'not ipr' de r. stallman** y [este artículo de wikipedia sobre capitalismo cognitivo](https://es.wiki2.org/wiki/Capitalismo_cognitivo) que dice: _\"La articulación de los procesos productivos inmateriales en el contexto del capitalismo cognitivo han incidido en los procesos reformas a los sistemas de educación superior, como es el caso del Plan Bolonia, definiéndose en relación a la necesidad de regular el flujo de los conocimientos desarrollados en la Academia, controlando aquellos elementos que exceden el marco definido por la demanda de saberes desde el mundo empresarial, articulando aquello que autores ligados a la Universidad Nómada han planteado como el surgimiento de la Universidad-Empresa.\"_",
			"date_added": 1472368031
		},
		{
			"post_id": 1472369089,
			"body": "¿Estás aburridx?\n\n**por qué no leer un libro libre:**\n* [Proyecto Gutenberg](https://www.gutenberg.org/)\n* [OpenCulture](http://www.openculture.com/)\n* [DefectiveByDesign](https://www.defectivebydesign.org/guide)\n`sólo el primer enlace posee exclusivamente libros, pq cuando se cansa la vista...`\n\n**Otros enlaces relacionados para navegar y conocer:**\n* [FightForTheFuture](https://www.fightforthefuture.org/)\n* [PublicKnowledge](https://www.publicknowledge.org/)\n* [CreativeCommons](https://creativecommons.org/)\n* [ElectronicFrontierFoundation](https://www.eff.org/)\n* [TorrentFreak](http://torrentfreak.com/)\n* [Rebelion](http://rebelion.org/)\n* [ETCgroup](http://www.etcgroup.org/)\n* [FutureOfLife](http://futureoflife.org/)\n* [GNU](https://www.gnu.org/philosophy/)\n* [FreeSoftwareFoundation](https://www.fsf.org)",
			"date_added": 1472369085
		},
		{
			"post_id": 1472414958,
			"body": "La situación de la red/web está complicada: en lugar de estar formada por un montón de nodos, **acabó siendo un montón de idiotas (nosotrxs) contribuyendo a unos pocos nodos gigantes como Alphabet (Google) y/o Facebook**.\n\nMuchos diarios están cerrando sus imprentas y pasando a ser más exclusivamente digitales, en principio no está mal. Pero sucede que las entradas de dinero para ellos siempre fue la publicidad... hoy en día las publicidades van a comisión con google y/o facebook (aparte q [FB promueve clickfarms](https://www.youtube.com/watch?v=oVfHeWTKjag)); de este modo lo que ganan hoy los diarios es mucho menos, pues cada vez se consume menos el material impreso que posee publicidad que iba directo a sus bolsillos, y ademas está mucho mas desvalorizada esta publicidad (impresa) pues ya no se consume como antes. Estan cerrando muchos diarios, y es cierto que no había gran diversidad de voces pero el hecho de que cada vez sean menos... Pareciera que 1984 de Orwell está pronto a llegar, en cualquier año de estos. De hecho ya llegó algo mucho peor, es esta vida que se derime entre \"Gran Hermano\" mirándonos y/o nosotros mirando \"Gran Hermano\".\n\n[John Oliver tiene un video muy entretenido sobre la situación actual del periodismo, y lo publicaron hace poco en YouTube](https://www.youtube.com/watch?v=bq2_wSsDwkQ) (lamentablemente no conocen mediagoblin, rss+webtorrent u ipfs). Todo esto hace que, al fin y al cabo, nuestros administradores de contenidos (google, facebook) terminan siendo [burbujas que filtran la información por/para nosotros](https://www.youtube.com/watch?v=B8ofWFx525s) en pos de la personalización gracias al uso de algoritmos de (anti-)inteligencia artificial y _machine learning_.\n\n**¿Que podemos hacer?** quizás dejar de usar los grandes nodos, empezar a usar alternativas cómo [DuckDuckGo](https://duckduckgo.com/) para búsquedas, o directamente abandonar la Web e ir por la [ZeroNet](https://zeronet.io/) ya que es descentralizada, y además invitar a otros aquí. En medio de esta situación que la web pública atraviesa, el [W3C](https://www.w3.org/) --de la mano de Apple, Microsoft, Amazon y Netflix-- desarrolla *Encrypted Media Extensions* para la próx versión de HTML. Lo cuál será un estándar de como aplicar [la *administración de restricciones digitales* (DRM)](https://www.defectivebydesign.org/what_is_drm_digital_restrictions_management) a los usuarios-consumidores. \n\nNo hable de [DMCA](https://www.eff.org/issues/dmca) y la cantidad de sitios de torrent q estan cerrándose cada año, actualmente quedan sólo RARBG y ExtraTorrent. Incluso sitios de [Tor](https://www.torproject.org/) se han ido cerrando (¿cómo? el mayor nodo de salida está en ee.uu. y [bajo supervisación de la NSA](https://www.eff.org/deeplinks/2016/08/nsa-word-games-mass-v-targeted-surveillance-under-section-702)). Para cerrar, hay [un video que mediagoblin hizo para el *crowdsourcing* pasado y muestra claramente la debilidad de tener pocos nodos grandes en lugar de muchos pequeños: la importancia de la descentralizacion](http://mediagoblin.org/pages/campaign.html) como autodefensa contra la censura y la unicidad de discurso.",
			"date_added": 1472414953
		},
		{
			"post_id": 1473462651,
			"body": "\"El mito de la escasez para justificar las políticas de ajuste\"\nhttp://www.marcha.org.ar/el-mito-de-la-escasez-para-justificar-las-politicas-de-ajuste/\n(Por Carlos Javier Andújar/Foto por Gustavo Pantano)\n\n_¿Por qué nos resulta tan difícil entender la economía? ¿Es realmente tan inalcanzable o la cuentan así, para que nos sintamos lejos, como de quien viene a arreglarnos la heladera? ¿Por qué el ajuste es “tan necesario” para los Ministros de Economía? Iniciamos hoy una serie de miradas cercanas por lo mitos de la Economía (con mayúsculas) para acercarnos a su terminología tanto como lo estamos de las consecuencias de sus decisiones._\n\n### La economía de la abundancia\n\nImaginemos la primera clase de Economía en cualquier universidad de la Argentina. El profesor entra al aula con un gran manual bajo el brazo, saluda y luego de presentarse pregunta a las y los estudiantes ¿saben lo que es la economía? Ante el silencio, toma el manual, lo abre y lee en voz alta con una certeza similar a la de las ciencias naturales: La economía es la ciencia que se encarga de estudiar la asignación eficiente de los escasos recursos que posee la humanidad para satisfacer sus necesidades. Si todo fuese abundante y sobrase, continúa, ¿alguien estudiaría cómo producir y distribuir los bienes? Ahora sí, todas y todos responden al unísono: ¡Por supuesto que no!\n\nHemos sido testigos, quien lee este texto y quien lo está escribiendo, de un acto fundacional. Todo conocimiento económico posterior, sencillo o complejo, se estructurará a partir de allí. Muchas de las certezas que tendremos y, sobre todo, las preguntas que nunca nos llegaremos a formular, acaban de tener sentencia de muerte y, lo más cruel será, que nosotros seremos los propios sepultureros.\n\nPensemos juntos y juntas por un momento la “inocente” y “neutral” definición de economía que nuestro seguro profesor, provisto de su gran manual les leyó a las y los estudiantes. Escasez y eficiencia aparecen allí como ideas estrella.\n\nSi el problema de la economía es la escasez de recursos y bienes, serán criterios “científicos y técnicos” los que dominen todas las miradas. Si existen pocos recursos para satisfacer las infinitas necesidades de muchas personas, lo mejor que nos puede pasar es que los especialistas en economía nos digan la forma más eficiente de administrar la escasez de bienes con la que cuenta la humanidad. Si el problema es la escasez se habrá encontrado, en última instancia, una justificación para las desigualdades sociales. La escasez tiene la fuerza de lo inevitable y la claridad de lo evidente y en ello fundamenta su poder de hegemonizar los discursos académicos y los que no lo son.\n\nEficiencia y escasez son los conceptos a partir de los cuales se construyó el universo neoclásico a fines del siglo XIX en respuesta al marxismo (y neoliberal en la actualidad en respuesta a los populismos), imponiendo como único Dios de la eficiencia al mercado capitalista y como límite de las posibilidades a la escasez. Pensar desde estas categorías el problema de la economía tuvo y tiene la intención de hacer de la economía una ciencia neutral y universal, donde los sujetos sociales, la historia, la política, la ética y la ideología no tengan lugar. Las ausencias a la cita no son casuales sino son precisamente aquellas categorías desde las cuales se puede pensar la economía desde otro lugar. Ciertamente es la historia a quien debemos recurrir para repensar a la economía política.\n\nDesde la invención de la agricultura, hace ya más de diez mil años, la humanidad produce un excedente económico, es decir, produce más bienes de los que sus integrantes necesitan para reproducirse. Al hecho positivo de que cada persona haya aumentado la productividad de su trabajo debe sumársele su contracara, algunos grupos minoritarios dentro de las comunidades buscaron acaparar el excedente producido apropiándose, bajo distintas formas y modalidades, del trabajo ajeno. La vida de centenares de miles de personas que bajo el régimen esclavista entregaban el fruto de su trabajo a sus amos (en realidad entregaban sólo el excedente, es decir, todo el fruto de su trabajo menos los bienes necesarios para su supervivencia) no es muy diferente, en este sentido, de aquellos que trabajan bajo las formas asalariadas para otros quedándose sólo con un parte de la riqueza producida.\n\nCuando ciertas comunidades o, más precisamente, una parte pequeña de ellas, se apropia del excedente económico y lo administra de modo oligárquico, debe necesariamente construir paralelamente a la apropiación modos de legitimación. Es decir, debe crear y sostener formas para que quienes producen el excedente y no se apropian de él acepten pasivamente tal situación. Dichas formas de legitimación podrán ser según los tiempos más o menos violentas, coercitivas o consensuales, pero de una u otra manera deben existir.\n\nResumiendo, el mito de la escasez y la eficiencia económica del mercado capitalista es el modo actual que utilizan los sectores dominantes no sólo para naturalizar la apropiación oligárquica del excedente sino, principalmente, para ocultar su existencia.\n\n### El yugo de la escasez, el lastre de la abundancia\n\n¿Cómo es posible que los pueblos soporten políticas de ajuste si no es bajo el manto de que no hay otra alternativa? ¿Cómo es posible que los pueblos resignen derechos adquiridos por años de lucha si no es por estar convencidos de que estaban viviendo “una ficción por encima de sus posibilidades”? ¿Cómo es posible que los desarrapados de este mundo soporten las cotidianas humillaciones de una vida de bestias de carga si no es porque están profundamente persuadidos de que son ellos los responsables de su propia pobreza?\n\nLos resultados de la disputa por el excedente a nivel planetario pueden verse en el último informe anual de OXFAM denominado “Una economía al servicio del 1 por ciento”. En un extenso informe publicado en enero pasado (puede consultarse en https://www.oxfam.org) esta prestigiosa organización detalla las escandalosas desigualdades y cómo el poder y los privilegios se utilizan para ampliar la brecha. Lo que sigue son algunas de sus conclusiones. En 2015, solo 62 personas poseían la misma riqueza que 3.600 millones (la mitad más pobre de la humanidad). No hace mucho, en 2010, eran 388 personas.\n\nDesde el inicio del presente siglo, la mitad más pobre de la población mundial sólo ha recibido el 1 por ciento del incremento total de la riqueza mundial, mientras que el 50 por ciento de esa “nueva riqueza” ha ido a parar a los bolsillos del 1 por ciento más rico.\n\nCasi un tercio (30 por ciento) de la fortuna de los africanos más ricos, un total de 500.000 millones de dólares, se encuentra en paraísos fiscales. Se estima que esto supone para los países africanos una pérdida de 14.000 millones de dólares anuales en concepto de ingresos fiscales, una cantidad que permitiría financiar la atención sanitaria que podría salvar la vida de cuatro millones de niños y niñas, y contratar a profesores suficientes para escolarizar a todos los niños y niñas africanos.\n\nDespués de conocer estas cifras, ¿puede alguien decir y argumentar que el problema económico es la escasez? ¿Puede alguien decir que la distribución llegará cuando ese 1 por ciento derrame el excedente sobre los más pobres? ¿Puede alguien asegurar que los ajustes en contra de los sectores populares son inevitables fruto de variables macroeconómicas que estaban atrasadas?\n\nLa utopía neoliberal muestra una economía sin política ni historia. Una política sin lucha ni conflicto y una historia sin ideología. En definitiva, intenta imponer el pensamiento único como hegemónico, en el sentido de saturar conciencias y percepciones de la realidad. Como menciona Eduardo Galeano, “la derecha tiene razón cuando se identifica a sí misma con la tranquilidad y el orden: es el orden, en efecto, de la cotidiana humillación de las mayorías, pero orden al fin; la tranquilidad de que la injusticia siga siendo injusta y el hambre hambriento (…) La historia (y la economía política) es un profeta con la mirada vuelta hacia atrás: por lo que fue, y contra lo que fue, anuncia lo que será”. Debemos acercarnos a la economía de modo intencionado, comprometido, de modo no neutral, porque en definitiva no existe nada neutral. Si pensamos a la economía desde la abundancia se abrirán nuevos interrogantes… por ellos vamos.\n\n*Docente. Integrante del Colectivo Educativo Manuel Ugarte (CEMU). Contacto: fliaandujar@gmail.com",
			"date_added": 1473462645
		},
		{
			"post_id": 1473462877,
			"body": "“En la transmisión antigua el límite era la cantidad de espacio de las ondas radiofónicas. Solo se podían transmitir 10 canales de televisión, e inclusive con el cable, tenías 500 canales. En Internet todos pueden tener un canal. (...) Todos tienen una forma de expresarse. La cuestión no es quién tiene acceso a las ondas radiofónicas, sino quién controla la forma de encontrar personas. Empiezas a ver que el poder se centra en sitios como Google [o Facebook/Twitter/etc], estos guardianes que te dicen adónde debes ir en Internet. La gente que te brinda las fuentes de noticias e información. No es que cierta gente tiene licencia para hablar, ahora todos pueden hablar. La cuestión es quién se hace escuchar.”\n\n(Aaron Swartz, November 8, 1986 – January 11, 2013)",
			"date_added": 1473462870
		},
		{
			"post_id": 1476544774,
			"body": "Estoy escribiendo un libro de forma colaborativa [aún sólo]... quienes quieran sumarse, bienvenidos pues parece q va para largo... https://www.gitbook.com/book/adrianzo/autodefensa-cibernetica/details !!!",
			"date_added": 1476544766
		}
	],
	"post_like": {
		"13KzmLtPveSqxZKRzqs9nZXGLFcC2JLUKj_1472369089": 1473462682
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Los contenidos que publiques en esta red descentralizada además van a tener un sentido filosófico mucho más rico por estar aquí dónde somos pocos pero tirando para el mismo lado (más o menos)...!",
			"post_uri": "18EjLHTadBR6ci3XRWyMfsGeWVtXTR8xx_1472355743",
			"date_added": 1472366789
		},
		{
			"comment_id": 2,
			"body": "O el videoclip do the evolution, de perl jam... O \"man\" de Steve Cutts http://www.stevecutts.com/animation.html",
			"post_uri": "13KzmLtPveSqxZKRzqs9nZXGLFcC2JLUKj_1472367580",
			"date_added": 1472368222
		},
		{
			"comment_id": 3,
			"body": "siempre hay tiempo para leer y nunca es tarde amiguito ;)",
			"post_uri": "18EjLHTadBR6ci3XRWyMfsGeWVtXTR8xx_1472416754",
			"date_added": 1472417000
		},
		{
			"comment_id": 4,
			"body": "¿Ves alguna red WiFi con al menos 3 líneas de señal?",
			"post_uri": "18EjLHTadBR6ci3XRWyMfsGeWVtXTR8xx_1472869823",
			"date_added": 1473462971
		},
		{
			"comment_id": 5,
			"body": "Oh! and I thought it was just a \"wrapper site\"... gotta try it now!",
			"post_uri": "1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L_1473503109",
			"date_added": 1473521853
		},
		{
			"comment_id": 7,
			"body": "@Alex: Oops! And I was speaking of bwoi Music :P",
			"post_uri": "1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L_1473503109",
			"date_added": 1473619876
		},
		{
			"comment_id": 8,
			"body": "La cibernética es tan real como el aire que respiramos. Pero; de lo último que se entera el pez, es de la existencia del agua. Según la Real Academia Española, la cibernética es la ciencia que estudia las analogías entre los sistemas de control y comunicación de los seres vivos y los de las máquinas. Pero lo cierto es que la cibernética posee tantas definiciones como campos de estudio: filosofía, psicología, sociología, matemática, computación, química, física, biología, etcétera.\n\nSucede, que cada disciplina conceptualiza de una forma distinta la complejidad única que se le presenta, en este caso: el control y la comunicación. Ya desdibujados los límites, no sólo nos referimos \"entre\" seres vivos y máquinas como la definición de la RAE, sino también entre los seres vivos consigo mismos, y las máquinas entre sí. El avance de esta trans-disciplina y sus tecnologías es cada vez más vertiginoso. La autodefensa, ante todo ello, resulta cada día más relevante; y acorde a la digitalización de nuestras relaciones sociales.",
			"post_uri": "13KzmLtPveSqxZKRzqs9nZXGLFcC2JLUKj_1476544774",
			"date_added": 1476544800
		}
	],
	"follow": [
		{
			"follow_id": 2,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L",
			"user_name": "Alex (Bwoi)",
			"date_added": 1473484113
		},
		{
			"follow_id": 3,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1473484115
		},
		{
			"follow_id": 4,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1473484118
		},
		{
			"follow_id": 5,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu",
			"user_name": "PaintNinja",
			"date_added": 1473484183
		},
		{
			"follow_id": 6,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L",
			"user_name": "Alex",
			"date_added": 1473484209
		},
		{
			"follow_id": 7,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1CTut2qbaj54ZjNoYeuWSGwV75iVieKY6N",
			"user_name": "Quadrangle",
			"date_added": 1473484292
		},
		{
			"follow_id": 8,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "13KzmLtPveSqxZKRzqs9nZXGLFcC2JLUKj",
			"user_name": "Gnuru Wanabi",
			"date_added": 1474634141
		}
	]
}