{
	"next_comment_id": 6,
	"user_name": "Verification",
	"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "Galeano ? ¿Desde cuando es historiador? ¿Qué estudios de historia tiene? Como escritor de royo comunista esta bien...pero historiador  : ). ¿Exterminación programada?¿70 millones, por qué no 500 millones que suena más fuerte? Dejate de panfletos conspiranoicos  y lee a auténticos historiadores. Oye, ¿te suena lo de que la inmensa mayoría de los indígenas murieron por enfermedades que trajeron los colonos y que no existian en América? ¿te suena que a nosotros siglos atras los romanos nos llevaron nuestro oro (Las Médulas, Rio Tinto, etc) y demás materias primas?, ¿Qué fuimos destruidos por árabes, pueblos del norte y por franceses con Napoleón al frente? ¿Qué tuvimos una guerra civil y nuestro país quedó destrozado? ¿Sabes que Alemania fué destruido por completo en dos guerras mundiales?¿Japón destrozada por bombas atómicas?¿Cuántos millones de personas murieron por el comunismo en la extinta Unión Soviética? Y no lloramos tanto ni seguimos echando la culpa de nuestros males a los antepasados de un determinado país. Yo tengo amigos alemanes y nunca les echaría en cara nada del pasado nazismo, por cierto ahora son la tercera o cuarta potencia mundial. Los españoles (reyes de Castilla, Bartolomé de las Casas,...) promovieron leyes en respeto de los indígenes y se mezclaban con toda naturalidad con ellos. Esto no ocurrió con el resto de pueblos colonos que eran extremadamente supremacistas blancos, mira los ejemplos de los belgas, holandeses, ingleses... el apartheid en Sudáfrica, el Congo,...Informate de quienes fueron las naciones que más se dedicaron al exclavismo. Pero como la cultura dominante es la anglosajona se echa la culpa de todos los males a los españoles y se arrodilla ante los yanquis... Oye ese dibujo de tu blog no es un cantante yanki que abusaba de niños.¿ Metes cizaña sin venir a cuento entre hermanos y luego veneras a un gringo pedófilo? @Cer: ",
			"post_uri": "1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_4",
			"date_added": 1476205044
		},
		{
			"comment_id": 2,
			"body": "Cínico, te crees con superioridad moral por poner frasecitas. Hazte la victima ahora después de haber insultado a millones de personas. A mí no se me ocurría en una red social meterme con un país, cultura o etnia y llamarles genocidas. Pareces un poco xenófobo y cargado de prejuicios.",
			"post_uri": "1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_6",
			"date_added": 1476207729
		},
		{
			"comment_id": 3,
			"body": "Sí, tienes razón en lo del dibujo pero por lo que me he informado no andaba muy desencaminado. Sal de casa, echate amigos y novia y deja de buscar cosas raras en la Deepweb. Eres el típico amargado conspiranoico - \"Todo forma parte de una estrategia mundial\", \"Los marcianos ya están entre nosotros\", \"EE.UU no llegó realmente a la luna\".... :X  \nVeo que contestas con los mismos argumentos simplistas, demagógicos y mezquinos de siempre. Aunque seas medio analfabeto y no hayas leido nada más que panfletos comunistas en toda tu vida eso no te dá derecho a insultar a millones de personas de Europa por sucesos pasados. ¿De qué gran país eres tú ? ¿o te dá verguenza decirlo?. Si quieres luego comparamos en baremos de derechos, libertades, justicia, cultura, seguridad ciudadana, oportunidades laborales, ciencia, economía, corrupción, asistencia sanitaria, racismo, homofobia, apoyo a la mujer...Seguro que tu país queda a años luz ahora. (Apuesto a que eres chavista venezolano)\n¿Ideas fascistas dices? Eres un ignorante y lo sabes. Estoy a favor de la libertad individual, de la libertad de empresa y económica, el concepto de raza es científicamente una estupidez y tengo amigos de todas las razas, apoyo a los homosexuales/bisexuales/transexuales y tengo amigos que lo son, sanidad y educación pública, apoyo la adopción gay, la separación entre religión y leyes,...\nCampeón deja de lloriquear como una niñita y ponte a trabajar por tu país con los problemas ACTUALES y deja de remover mierda como hacen los mediocres apoyándose en el anonimato.",
			"post_uri": "1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_4",
			"date_added": 1476350047
		},
		{
			"comment_id": 4,
			"body": "Cer imbecil puedes dejar de poner spamm",
			"post_uri": "1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_1476355494",
			"date_added": 1476384902
		},
		{
			"comment_id": 5,
			"body": "Sucia mentirosa puedes ir a mi perfil y ver que llevo en Zerome desde el 27 de septiembre ¡antes de tu primer mensaje en Zerome!",
			"post_uri": "1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_1476466473",
			"date_added": 1476489520
		}
	],
	"flags": {
		"post-1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_4": 2,
		"post-1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_6": 2
	},
	"comment_like": {
		"1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk_2": 1476206277
	}
}