{
	"next_post_id": 3,
	"next_comment_id": 4,
	"next_follow_id": 2,
	"avatar": "jpg",
	"user_name": "Rebelb0y11",
	"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
	"intro": "Hobbyist Programmer",
	"post": [
		{
			"post_id": 1473301666,
			"body": "Not that anyone cares, but I'll be working on an image board type site for ZeroNet.",
			"date_added": 1473301664
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Inkertus: I figure for the most part like 4chan. I wont require sign in (but may still allow it). I'm thinking that i'll have posts timeout after so long without reply, which will delete them from the network. Once i have a working version, it'll be just /b/. but i'll add more boards afterwords. But considering how small the zeronet population is at the moment, I think one board is plenty.",
			"post_uri": "1NhDPqhia3TEmpsa2n6qa7rDv4XLvohRv3_1473301666",
			"date_added": 1473302944
		},
		{
			"comment_id": 2,
			"body": "@Inkertus: I really don't know what i'm aiming for honestly. 4chan, obviously. But i have no real goals. I'm interested in doing this for a few reasons.\n\n- Bored.\n- I don't really like the forums that are currently on zero\n- I want to see what this network can do.\n\nOther than that, no goals. It will likely go its own way before i'm satisfied with it.\nwill be at least a few weeks before I have a working copy. \n\nI will likely have mods elected should that need arise. I'm going to have minimum rules. Obviously no illegal content. Other than that, I don't care.\n\n\nAnd I'm not the best person with designing webpages. I'm good with the back end code though, so that should be pretty good.",
			"post_uri": "1NhDPqhia3TEmpsa2n6qa7rDv4XLvohRv3_1473301666",
			"date_added": 1473305096
		},
		{
			"comment_id": 3,
			"body": "@Execin: Hmm. I didn't find this through my various google searches. Thanks. I'll look into it.",
			"post_uri": "1NhDPqhia3TEmpsa2n6qa7rDv4XLvohRv3_1473301666",
			"date_added": 1473354099
		}
	],
	"follow": []
}