{
	"next_comment_id": 13,
	"user_name": "Kaffie",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"post_like": {
		"1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L_10": 1471385177,
		"1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L_11": 1471432704,
		"1DMBWEfQdEaRtsWEwZLY98b9t1ZcoG2ECM_1472248656": 1472208935,
		"17gEFavobc7RsKNGbSzZwoSZ6jNB7hT2KN_1472745017": 1472772476,
		"1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L_1472766375": 1472789398,
		"1H4xoahmzZ8UNyXLNogcDu39NhNENaEyJk_1473729852": 1473737098
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Just woke up, sorry. I have way more than 13 followers though. When I ran the code thingy, It popped up like 30 (of the 80 people at the time I ran it). As Nofish mentions, it seems to be ~164 now. I imagine the popularity comes from being an active ZeroNet user (on zerotalk, zerome, and my own blog), being a girl, and being the developer of Kaffiene, which is pretty popular as it is.\n\nI gotta say, makes me feel loved though :D",
			"post_uri": "1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L_10",
			"date_added": 1471385120
		},
		{
			"comment_id": 2,
			"body": "No way to enforce this. If you do it from the viewer side, people can just switch viewers to remove the limit (or edit the json files directly). If you do it from a hub side, people can just switch hubs. I personally run my own hub, and have a personal cloned ZeroMe, so I can avoid content limits.",
			"post_uri": "1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L_3",
			"date_added": 1471385299
		},
		{
			"comment_id": 3,
			"body": "@P2P: :P I thought it was obvious. I even have it listed in my ZeroMe bio. Was your usage of male pronouns just a default, or was there something about me (user name, writing style, etc) that made you do it? I'm honestly curious.\n\nEdit: Is it really mostly just guys here?",
			"post_uri": "1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L_10",
			"date_added": 1471395440
		},
		{
			"comment_id": 4,
			"body": "@P2P: Huh, alright then. At least in english (and maybe just the US) there's a common expression: A/S/L, which means age/sex/location. So you'd do something like: 23/F/US. And yea, most people into tech here are guys as well.",
			"post_uri": "1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L_10",
			"date_added": 1471398729
		},
		{
			"comment_id": 5,
			"body": "@P2P: It can either mean men, or as a gender neutral term. So all men would be guys. Mostly men and some girls would be guys. A good mix would be guys. But if it's all girls, then you'd go with girls/ladies/etc. I don't think I've ever seen 'guys' used to describe an all girl group. But it's definitely possible. A guy is a man, but guys can either be a group of all men, or a gender-mixed group. If you say something like 'the guys' it generally means all men.",
			"post_uri": "1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L_10",
			"date_added": 1471399825
		},
		{
			"comment_id": 6,
			"body": "@Quadrangle: The plural can. The singular 'guy' is masculine.",
			"post_uri": "1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L_10",
			"date_added": 1471399907
		},
		{
			"comment_id": 7,
			"body": "I always just load a new site up in the various proxies. The proxies almost are always up long enough for enough people to get the site and seed it. Then I link it on my other sites.",
			"post_uri": "1PoiRFseXaeGhnj2mpwS3xiXVrUd8noRLW_3",
			"date_added": 1471471028
		},
		{
			"comment_id": 8,
			"body": "@Dxtjgxz: ZeroMe? Or ZeroTalk? I'm unaware of any ZeroMe clones besides my own, the dark theme, and infinity hub. You can find a zerotalk with images here: http://127.0.0.1:43110/1C2JhCunGLtvyX56nQ88tcb87WnXspjWN",
			"post_uri": "1MzWT1C1LwRZmABNthcryXfsVKxP6Si5Ev_3",
			"date_added": 1471730846
		},
		{
			"comment_id": 9,
			"body": "The big issue with zeronet at the moment is that it's *awful* for sharing larger files. IPFS, however, is designed to do just that. That's why people often pair the two. I mean, you could just as well link to imgur or something, but I think most people would agree it's best to keep everything to decentralized services.\n\nYou can technically use IPFS for sites as well, but it's not as good as ZeroNet IMO.",
			"post_uri": "1H4xoahmzZ8UNyXLNogcDu39NhNENaEyJk_1473729852",
			"date_added": 1473737096
		},
		{
			"comment_id": 10,
			"body": "@Sirenyc: Sorry about that! I've sort of been drifting away from ZeroNet these past few months. I really need to get back into the swing of things. I'd really like to keep working on Kaffiene, but my mind's been other places lately. I still check in every now and again, but I haven't really had any time to dev.\n\nReally all that's left to be done is an automatic crawler/tagger that's left running continuously. I have the knowhow, but not the time/effort, haha. Though it seems Kaffiene has become the google of ZeroNet, so maybe I should put more of a focus on it, and really make the site great.",
			"post_uri": "1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L_1481137760",
			"date_added": 1481868346
		},
		{
			"comment_id": 11,
			"body": "Plans for a new video site? Please try not to squat domains.",
			"post_uri": "1EFRUQjydLVFKNFBiF2LW5rpQeqEr8EA6M_1482072363",
			"date_added": 1482101890
		},
		{
			"comment_id": 12,
			"body": "Well if it's any consolation, *I'm* a fan of your stuff. You're one of the few developers here who actually want to try and improve ZeroNet. I think everyone's just stepping on each other's toes right now, since there's still a lot of groundwork to be laid out. Remember, I basically just crushed ZeroSearch >_<. My whole intention with Kaffiene was to fix a frustration I had: that there wasn't a good way to search for sites.\n\nI'm really lazy at dev work, which is kind of why I've been gone for a long time (I wasn't gone, just fighting depression :\\\\). I try to share my code in hopes that stuff like Bwoi *will* pop up and perhaps become even better. Maybe you'll repurpose it into something else, like CensoredSearch did.\n\nTBH, I really have no idea what I'm doing. I'm just playing around with ZeroNet, and trying to make it a cool place. I'll support whatever you decide to come up with, whether it's a search engine, a video site, a music site, or something else. As of now, I really like seeing the competition between stuff like, say, KopyKate and ZeroTube. ZeroTube started out better and had my support, but it's dev has been slow, and KopyKate surpassed it.\n\nI see lots of opportunities here to make real cool stuff. But I don't see that many developers going at it. I'd love to do all that stuff, but I'm only one person and already have problems getting myself to work on my existing stuff. So I say just go do what you want to do. Just ignore me. If you want to make a real cool search engine, do that. \n\nBut whatever you do, be sure you stick around. I think you're a good person to have here.",
			"post_uri": "1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L_1482180332",
			"date_added": 1482210156
		}
	]
}