{
	"next_comment_id": 7,
	"user_name": "Binero",
	"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
	"post_like": {
		"1HL2193iASWKcTtZF86Z5EZhvcysHo93xF_1477877911": 1478291103,
		"1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1479325400": 1479332544
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Fiat currencies work fine. They are based on confidence, but there is nothing wrong with that. Don't forget that Bitcoin is also a fiat currency, and also based on confidence.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1478344820",
			"date_added": 1478351952
		},
		{
			"comment_id": 2,
			"body": "@Zerg: That's not what defines a fiat currency. A fiat currency is one that doesn't have an intrinsic value. Bitcoin doesn't. It only has value because we believe it does.",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1478344820",
			"date_added": 1478355465
		},
		{
			"comment_id": 3,
			"body": "@Zerg: It's also false that this is what we're doing with every fiat currency. Regular currency isn't just created indefinitely. In the Euro Area, inflation is kept at 2%. ",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1478344820",
			"date_added": 1478355524
		},
		{
			"comment_id": 4,
			"body": "@Zerg: Inflation rate correlates not only with the amount of money printed but mostly by the amount of money in circulation. A lot of money that is printed isn't circulating, and a lot of money that isn't printed _is_ circulating. ",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1478344820",
			"date_added": 1478368157
		},
		{
			"comment_id": 5,
			"body": "@Zerg: With money you do get something you can trust in. After all, the ones responsible for it are elected to do so by you. If you cannot trust them, the problem isn't with the currency but with how they are elected. \n\nIf you really wish to get something physical in exchange for what you earn, which is fairly stable, you can always _buy_ gold. \n\nSorry for the split comments, I'm just not used to it automatically posting on enter. :)",
			"post_uri": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN_1478344820",
			"date_added": 1478368292
		},
		{
			"comment_id": 6,
			"body": "There you are. :P",
			"post_uri": "1NNqtgJDAsBhQFRP5BRWneMoFGmUgMyRdH_1478370344",
			"date_added": 1478374687
		}
	],
	"flags": {},
	"comment_like": {
		"1EJ7j6nGoz84S8eYsfEmYA6hF9vV4nKkR4_5": 1478374652
	}
}